{
    "HELLO": "hello",
    "KNIT_BOT": "knitbot.ai",

    "COM": {
        "SET_API": "API Settings",
        "SET_TELE": "Telegram Settings",
        "CHG_LAN": "Languages",
        "CHG_DARK_MODE": "Dark Mode",
        "CHG_LIGHT_MODE": "Light Mode",
        "LOGOUT": "LOG OUT",
        "BOT_STATUS": "Status",
        "STOP": "Disabled",
        "OPERATING": "Working",
        "EXIT": "EXIT",
        "NOTICE": "Announcement",
        "HOW_TO_USE": "User Guide",
        "OFFICIAL_TELEGRAM": "KnitBot Telegram Group",
        "CHEER_TO_OFFICIAL": "Sponsored with Exchange",
        "DONATE_CREATOR": "Donate to Creator",
        "ADDRESS": "Address",
        "BANNER": "Banner",
        "HOME_NOTICE": "KnitBot is <span>free</span> and <span>doesn't require</span> referral signup.<br>This site is currently funded by Ads and sponsorships. Please consider supporting the creators.<br>So please disable adblock."
    },
    "AUTO": {
        "SETTING_INDICATOR": "Setting Indicator",
        "SET_AUTO_SALE": "BOT SETTINGS",
        "SELECT_INDICATOR1": "Indicator1",
        "SELECT_INDICATOR2": "Indicator2",
        "PERIOD": "Period",
        "STANDARD_DEVIATION": "Standard Dev",
        "RETRACEMENT": "Multiplier",
        "ATR_LENGTH": "ATR Length",
        "INITIAL_ACCELERATION": "Start",
        "INCREMENT": "Step",
        "MAXIMUM": "Maximum",
        "SMOOTHING": "Smoothing",
        "RSI_LENGTH": "RSI Period",
        "STOCHASTIC_PERIOD": "Stochastic Period",
        "MOVE_AVERAGE": "MA",
        "FIBONACCI_RETRACEMENT": "Fibonacci retracements",
        "SURPASSED_UPPER_LINE": "Surpasssed upper line",
        "DROPPED_BELOW_UPPER_LINE": "Dropped below upper line",
        "SURPASSED_LOWER_LINE": "Surpasssed lower line",
        "DROPPED_BELOW_LOWER_LINE": "Dropped below lower line",
        "HIGH_CURRENT_PRICE": "Current Price is high",
        "LOW_CURRENT_PRICE": "Current Price is low",
        "SURPASSED_RATIO": "Surpasssed Ratio",
        "DROPPED_BELOW_RATIO": "Dropped below Ratio",
        "SURPASSED_SIGNAL": "Surpasssed Signal",
        "DROPPED_BELOW_SIGNAL": "Dropped below Signal",
        "HIGH_CONSTANT": "Higher than a Constant",
        "LOW_CONSTANT": "Lower than a Constant",
        "HIGHER_K": "%K is Higher than a Constant",
        "LOWER_K": "%K is Lower than a Constant",
        "CROSS_K_DOWN": "Cross %K Down",
        "CROSS_K_UP": "Cross %K Up",
        "LONG_SIGNAL": "Long Signal",
        "SHORT_SIGNAL": "Short Signal",
        "NONE": "None",
        "CANDLE": "Candlestick",
        "THAN_INDICATOR_1": "Than Indicator 1",
        "THAN_INDICATOR_2": "Than Indicator 2",
        "CONSTANT": "Constant",
        "BOT_ACTION": "Bot Action",
        "OPEN": "Open",
        "CLOSE": "Close",
        "ADD_LONG_SETTING": "Add Long Settings",
        "ADD_SHORT_SETTING": "Add Short Settings",
        "REMOVE_LONG_SETTING": "Remove Long Settings",
        "REMOVE_SHORT_SETTING": "Remove Short Settings",
        "REVERSE_POSITION_EXIT": "Reverse the close position",
        "SHORT_SETTINGS": "Short Settings",
        "LONG_SETTINGS": "Long Settings",
        "TRADE_LAST": "Close",
        "TRADE_OPEN": "Open",
        "TRADE_HIGH": "High",
        "TRADE_LOW": "Low",
        "SHORT_TERM": "Fast MA Period",
        "LONG_TERM": "Slow MA Period",
        "MAXIMUM_ACCEL_ELEMENT": "Maximum",
        "SIGNAL": "Signal",
        "RSI_PERIOD": "RSI Period"
    },
    "DEFAULT" : {
        "DEFAULT_SETTING": "PREFERENCES",
        "RESET": "Reset",
        "MODES": "Modes",
        "FUTURES": "Futures",
        "SYMBOLS": "Symbols",
        "CANDLE_SETTING": "Candlestick Time",
        "1M": "1M",
        "3M": "3M",
        "5M": "5M",
        "15M": "15M",
        "30M": "30M",
        "1H": "1H",
        "4H": "4H",
        "1D": "1D",
        "QUANITITY": "Quantity",
        "TELEGRAM_INFO": "Telegram Info",
        "TELEGRAM_KEY": "Bot Token",
        "CONNECT_STATUS": "Connect Status",
        "CONNECTED": "Connected",
        "DISCONNECTED": "Disconnected",
        "BOT_CONTROL_STATUS": "Bot Control Status",
        "ON": "On",
        "OFF": "Off",
        "TRADE_TYPE": "Types",
        "ENTER_QUANTITY": "Quantity"
    },
    "USE": {
        "HOW_TO_USE": "Guide",
        "DISCLAIMER": "Disclaimer",
        "DISCLAIMER_TXT": "KnitBot ('Knitbot,' 'we,' or 'us') provides all of its features free of charge. However, setting up and executing automated trades is done entirely at your own risk. KnitBot assumes no responsibility for any losses or damages arising from such activities.<br><br>Technical issues, including but not limited to server communication errors or system failures, may occur, and KnitBot is not liable for any such issues. Additionally, we are not responsible for any discrepancies between your actual usage and the intended usage of our services.<br><br>By using this site, you acknowledge and agree that KnitBot is not liable for any features or functionalities provided. You use this site at your own discretion and risk.",
        "SET_API": "API Settings",
        "SET_API_TXT1": "1. Please select an exchange.",
        "SET_API_TXT2": "2. Enter the API key issued by the exchange. Refer to the instructions below for obtaining API keys from each exchange.",
        "SET_API_TXT3": "3. Enter the API secret key issued by the exchange. Note that the terminology may vary slightly depending on the exchange.",
        "SET_API_TXT4": "4. Enter the API passphrase issued by the exchange. This input field will appear if you select the Bitget exchange, and it may not be required for other exchanges.",
        "BITGET_USE": "How to issue an API on Bitget",
        "BITGET_USE_TXT1": "Log in to the Bitget website (step 1) and click on the profile at the top right corner(step 2). Click on API Management.",
        "BITGET_USE_TXT2": "Click on Create new API",
        "BITGET_USE_TXT3": "1. Enter an API name in English.",
        "BITGET_USE_TXT4": "2. Create a numeric password (8-32 characters).",
        "BITGET_USE_TXT5": "3. Check Read-only.",
        "BITGET_USE_TXT6": "4. Complete the verification (steps 4-5), then click Next (step 6). Copy and securely store all the information that appears.",
        "TELEGRAM_SETTING": "Telegram Settings",
        "TELEGRAM_SETTING_TXT1": "1. Enter the token of the created bot. e.g., 1234567890",
        "TELEGRAM_SETTING_TXT2": "2. Enter your chat ID to use various features. Optional.",
        "TELEGRAM_SETTING_TXT3": "3. This function allows you to receive notifications when the bot logs in or out.",
        "TELEGRAM_SETTING_TXT4": "4. This function allows you to control the bot within Telegram.",
        "AUTO_SALE_SETTING": "Bot Settings (Indicator Selection)",
        "AUTO_SALE_SETTING_TXT": "Select the indicators to be used for automated trading.<br><br>Indicator 1 is mandatory, and you can manually adjust the parameters required for the selected indicator.<br><br>Indicator 2 is optional. If both Indicator 1 and Indicator 2 are used, the set actions will only trigger if both indicators are satisfied.<br>(They are linked with 'AND' condition.)",
        "BOT_ACTION_SETTING": "Bot Actions",
        "BOT_ACTION_SETTING_TXT": "You can set up bot actions.<br><br>The 'Candle' refers to the current price of the selected symbol. You can choose from Close, Open, High, or Low prices, and these are based on the candle time frame set in the basic settings. The default recommendation is to use the Close price.<br><br>You can configure the bot's actions based on the price conditions relative to Indicator 1, which was set above, and the situation of the indicator against a constant.<br><br>For the bot's behavior, you can decide whether the bot will enter or exit a position when the specified conditions occur.<br><br>By adding Long (Short) settings, you can configure the conditions under which the bot will enter and exit positions, respectively. If either the entry or exit condition is not set, automated trading will not be possible.<br><br><span>In other words, you must configure at least two settings, and there must be no conflicts between the conditions!</span><br><br>If there is a conflict between the Long and Short settings, the bot will not operate!<br><br>For example, if you want the bot to enter a Long position when the price drops below the EMA (Indicator 1), set the bot's action to 'Enter' when the 'Candle value is less than' for Indicator 1. Conversely, if you want the bot to enter a Short position when the price rises above the EMA (Indicator 1), set the bot's action to 'Enter' when the 'Candle value is greater than' for Indicator 1.",
        "REVERSE": "Reverse",
        "REVERSE_TXT": "This feature automatically closes the previous position when the bot enters an opposite position.<br> For example, if the bot has previously entered a Long position and the Long exit condition has not yet been met, but the Short entry condition is fulfilled, the bot will close the existing Long position and only enter the Short position.",
        "DEFAULT_SETTING": "Preferences",
        "DEFAULT_SETTING_TXT": "You can select the trade type. <br>Currently, only Futures trading is supported.<br><br>In the Trade Symbol Selection, you can choose the symbol that the bot will trade.<br><br>In the Candle Settings, you set the time frame that will be used as the basis for evaluating automated trading indicators or bot action conditions. <span>Be cautious when setting the candle time frame, as certain indicators or conditions may vary depending on the selected time frame.</span><br><br>The Quantity refers to the amount of the selected trading symbol that will be used in automated trading. <span>Note that the quantity refers to the amount of the selected coin, not USDT, so make sure to set the quantity based on the coin's amount!</span>",
        "BOT_ACTING": "Bot Start and Stop",
        "BOT_ACTING_TXT ": "You can turn the bot on and off using the right icon on the remote control.",
        "SAVE": "Save",
        "SAVE_TXT": "When all settings are complete, you must save them before running the bot. If you do not save, the bot may not run, or the settings may not be applied, potentially causing errors. Therefore, it is essential to save your settings.",
        "BESIDE": "Others",
        "BESIDE_TXT": "For any other inquiries, please use the official KnitBot Telegram group."
    },
    "API": {
        "API_SETTING": "API Settings",
        "SELECT_TRADE": "Choose the exchanges",
        "API_KEY": "API Key",
        "API_SECRET_KEY": "API Secret Key",
        "API_PASSPHRASE": "API Passphrase",
        "API_KEY_TXT": "Enter your API Key",
        "API_SECRET_KEY_TXT": "Enter your API Password",
        "API_PASSPHRASE_TXT": "Enter your API Passphrase",
        "API_SETTING_NOTICE": "By using this free service, you acknowledge and agree that KnitBot is not responsible for any financial losses, damages, or claims arising from the use of this service, including but not limited to inaccuracies in indicators, technical failures, server outages, disruptions, or any external factors beyond our control. All tools and data are provided \"as is,\" and you are fully responsible for any decisions made while using the service. KnitBot disclaims any and all liability for losses or damages, regardless of the cause, that may result from using this service. For more details, please refer to our User Agreement."
    },
    "TELEGRAM": {
        "TELEGRAM_SETTING": "Telegram Settings",
        "TELEGRAM_KEY": "Bot Token",
        "TELEGRAM_KEY_TXT": "Enter your Bot Token",
        "CHAT_ID": "Chat id (Optional)",
        "CHAT_ID_TXT": "Enter your Chat id (Optional)",
        "OTHER_SETTING": "More Settings",
        "BOT_CONTROL_YN": "Allow Bot control with Telegram",
        "TELEGRAM_SAVE": "SAVE",
        "FAIL_SAVE": "Failed to save Telegram information. Please check the ID again."
    },
    "MEMBER": {
        "MEMBER_INFO": "Profile",
        "PROFILE_IMAGE_CHANGE": "Edit Profile Image",
        "PW_CHANGE": "Change Password",
        "MEMBER_WITHDRAWAL": "Delete Account",
        "PW_RESETTING": "Reset Password",
        "EMAIL": "Email",
        "INPUT_EMAIL": "Enter your Email",
        "CERTIFY": "Verify",
        "CONFIRM": "CONFIRM",
        "PASSWORD": "Password",
        "PASSWORD_CHECK": "Confirm Password",
        "PASSWORD_TXT": "8-32 characters, with uppercase, numbers, and special characters",
        "INPUT_PASSWORD": "Enter your Password",
        "CHANGE": "Change",
        "LOGIN": "LOG IN",
        "SAVE_EMAIL": "Remember Me",
        "FIND_PW": "Forgot Password",
        "LOGIN_ERROR": "Email or password doesn't match",
        "PW_RULE": "Requires 8-32 characters, with uppercase, numbers, and special characters",
        "SIGNIN": "SIGN UP",
        "SIGNIN_TXT_1": "By continuing, you agree to our",
        "SIGNIN_TXT_2": "and acknowledge that you understand ",
        "SIGNIN_TXT_3": "of this site.",
        "CONFIRM_SIGNIN": "DONE",
        "TERMS": "User Agreement",
        "PERSONAL_INFO": "Privacy Policy",
        "IMAGE_CHANGE": "Change Image",
        "REQUIRE_EMAIL": "Enter your Email.",
        "INVALID_EMAIL_RULE": "Please enter valid Email.",
        "REQUIRE_PASSWORD": "Please enter Password (8-32 characters, with uppercase, numbers, and special characters(@, $, !, %, *, ?, &, ^)).",
        "INVALID_PASSWORD": "Please enter valid Password (8-32 characters, with uppercase, numbers, and special characters(@, $, !, %, *, ?, &, ^)).",
        "REQUIRE_PASSWORD_CHECK": "Please confirm your Password (8-32 characters, with uppercase, numbers, and special characters(@, $, !, %, *, ?, &, ^)).",
        "ERROR_PASSWORD": "Password does not match."
    },
    "TOAST": {
        "NEED_LOGIN": "This service requires login.",
        "OK_LOGIN": "Logged in successfully.",
        "OK_LOGOUT": "Logged out successfully.",
        "OK_SIGNIN": "Signed up successfully.",
        "OK_SAVE": "Saved successfully.",
        "OK_UNREGISTE": "Deleted successfully.",
        "OK_RESET": "Reset successfully.",
        "OK_PW_CHANGE": "Password changed successfully.",
        "OK_OPERATE_BOT": "Bot is running.",
        "OK_SAVE_INSTANCE": "Instance saved successfully.",
        "OK_OPERATE_INSTANCE": "Instance started successfully.",
        "OK_SAVE_TELEGRAM": "Telegram information saved successfully.",
        "OK_CHANGE_LANGUAGE": "Language has changed.",
        "FAIL_SAVE": "Failed to save.",
        "FAIL_PW_CHANGE": "Failed to change password.",
        "FAIL_SIGNIN": "Failed to sign up.",
        "FAIL_SAVE_INSTANCE": "Failed to save instance.",
        "FAIL_OPERATE_INSTANCE": "Failed to start instance.",
        "FAIL_OPERATE_BOT": "Failed to start bot.",
        "FAIL_COPY_TEXT": "An error occurred during copying.",
        "OK_BOT_STOP": "Bot has been stopped.",
        "FAIL_BOT_STOP": "Failed to Stop Bot.",
        "OK_COPY_TEXT": "Copied"
    },
    "LAYOUT": {
        "AUTO": "Automated Trading",
        "DEFAULT": "Preferences",
        "USE": "User Guide",
        "TELEGRAM": "KnitBot Telegram Group",
        "NOTICE": "Announcements"
    },
    "PP": {
        "CONTEXT_0": "Privacy Policy<br>In brief: We are Knitbot org. (\"Knitbot\", \"we\", or \"us\"). We respect your privacy and work hard to protect the confidentiality of information that you give us. We will only share your personal data with third parties when it is needed for the provision of services and data you have requested (explained in detail in this privacy policy).<br><br>About Us<br>Knitbot is the data controller responsible for your personal data and is the sole owner of the knitbot.ai website (\"Website\"), Knitbot mobile and desktop applications(soon), Knitbot services (each, a \"Service\") and all of the information collected on it. Knitbot collects information from users in several ways (explained in detail in this privacy policy).This privacy policy applies to personal data that we collect from you when you visit this Website, create an account, use our applications or services (\"you\" or \"your\" being interpreted accordingly). It provides information on what personal data we collect, why we collect personal data, how it is used, the lawful basis on which your personal data is processed, how it is stored, and how we share information.As used in this privacy policy, \"personal data\" means any information that relates to you from which you can be identified.By using our Service or submitting your personal data, you are agreeing to accept the terms of this privacy policy, so please read it carefully. If you disagree with this privacy policy at any point or time, you should stop using our Services and delete your user account.<br><br>Updates<br>We may update this privacy policy at our discretion from time to time by posting a new version on our Website. You should check our Website occasionally to ensure any changes made are suitable for you. If required by applicable law, you will be informed of any significant changes made to the privacy policy.The current version of this privacy policy was modified on July 1, 2024.<br><br>Personal data that we collectThere is no need to create an account when searching and viewing information from knitbot.ai, such as announcements, guides.<br><br>Data we receive from you<br><br>User Accounts<br>If you decide to create an account, you will need to provide us with some personal data so we can provide you with access to our additional services that users benefit from. You may also elect to provide us with additional information about you, as described below.During registration you will be required to provide us with either: your username, email address; In some cases, you may need to provide and verify your phone number. You can also add additional information about yourself in the profile settings, however, this is not mandatory. The following information will be publicly displayed: nothing The following information will not be publicly displayed: your first and last name, phone number and email.<br><br>API data<br>Exchange API keys and related security keys and passwords are not stored on our server to protect sensitive information from server hacking attacks. They are only used on a one-time basis to run the instance.  During using automated trading service with API through website you will be required to provide(not stored at server) us: API keys and security keys issued by the exchange, and any other exchange-issued items that are required for automated trading;<br><br>Cookies<br>We do not collect cookies.<br><br>Log files<br>We do not collect Log files.<br><br>Device information<br>We do not collect Device information.<br><br>Telegram data<br>If you want to use the Telegram bot for automated trading, setting up notifications, etc, you will need to provide us with relevant information. During using automated trading service with website through Telegram, you will be required to provide us: your Telegram bot token, your Telegram chat ID; Even if you don't use Telegram, you can still use some of the features we offer through the website.<br><br>Data we receive from third parties<br>If you use an exchange API (Binance, Bybit, Bitget, Okx;) to register an API on the website, the service will be able to see information that the exchanges you use provide to us through their respective APIs. We use it to ensure that our terms of service agreement is being adhered to. We neither control nor take any responsibility for the way third parties provide information about you and/or process your personal data.<br><br>Contact data<br>We also process any personal data you choose to give when corresponding with us by phone, email, or otherwise visiting and interacting with this Website or any other services we operate. By providing your phone number, you agree to receive text messages from us. Message and data rates may apply. Message frequency varies. We will not share your contact phone number with any other parties unless explicitly specified by this policy.<br><br>How personal information is used<br>We use personal data in various ways that are necessary to provide the services you intend to use, certain legitimate interests, and as a necessity in order to comply with applicable law, as further described below. We do not generally rely on your consent to allow us to process your personal data if there is another lawful ground available. If we do rely on your consent, we will make this clear to you at that time.<br><br>Profile<br>A profile is a set of information for each individual user that details his/her viewing preferences. User settings are kept solely for the purpose of customizing the user's experience when using the Website, applications or user accounts. We do not share private profile settings with any third parties.<br><br>User account and profile operations<br>We use your contact details, such as username, email address, or phone number, in the following ways: to authenticate your user account, ensure its security along with the security of our services, and to prevent spam, fraud, and abuse; to acknowledge, confirm, and deal with your user account; to send all new users a welcome activation email to verify their email address;<br><br>User account deleting<br>You may refuse to use our Website and/or application and may ask us to delete your account in the profile settings. Your account will be deleted immediately. Please note that if  your account is to be deleted, we will delete the subsequent personal data you have supplied us. Some data, such as used preferences/scripts will be saved as they have already integrated into our system. This data must be stored to maintain the integrity of the platform.<br><br>Marketing<br>We may send you marketing emails about our products or services that are similar to the products or services you are subscribed to, including information about events and other promotions we feel may interest you. This is unless you have indicated to us that you do not wish to receive communications in this manner. Users can opt out of receiving marketing communications at any time by contacting us through the email<br><br>Service-Related Announcements<br>On rare occasions, it may be necessary to send out service-related announcements. For instance, if our service is interrupted for a prolonged period or a major functionality upgrade is released, we might send all users an email message.<br><br>Customer Service<br>When you contact through mail, we can service you to solve the website issue(s).<br><br>API<br>If you are using our API (Application Programming Interface) services (such as the Advanced Charts, Trading Platform, REST API), then we may process your personal data in order to be able to provide and support those services.<br><br>Legitimate interests<br>We will process your personal data as necessary for certain legitimate business interests, which include the following: where we are asked to respond to any of your inquiries, comments, or grievances; to administer our services in order to better understand how visitors interact with the Website and application, and ensure that they are presented in the most effective manner for you and your computer/device; to develop and improve our mobile applications; to share personal data among our affiliated businesses for administrative purposes, provide subscription services, and in relation to our sales and marketing activities, except where we require your consent, as described above; to send you information about our products or services that are similar to the products or services you subscribed to (unless you have refused or opted out of receiving these emails at the time you provided us with your email address or you have indicated to us that you do not wish to receive communications in this manner). Our legitimate interest is to ensure our marketing is relevant to you, so we may process your data to send you information on our products or services that is specifically tailored to your interests; we may anonymize, pseudonymize, aggregate and de-identify the data that we collect and use this data for our own internal business purposes, including sharing it with our business partners, our affiliated businesses, agents and other third parties for commercial, statistical and market research purposes. For example, to allow those parties to analyse patterns among groups of people and conducting research on demographics, interests, and behavior; for internal business/technical operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes, and as part of our efforts to keep our Website, network, and information systems secure; and to (a) comply with legal obligations, (b) respond to requests from competent authorities; (c) enforce our Terms of Use or House Rules; (d) protect our operations or those of any of our affiliated businesses; (e) protect our rights, safety or property, and/or that of our affiliated businesses, you or others; and (f) enforce or defend legal rights, or prevent damage. This means we can store and disclose your information to law enforcement authorities, state, or government agencies if we establish that such disclosure is necessary to comply with the law. This includes responses to court orders or subpoenas, as well as other judicial or regulatory processes. As used in this privacy policy, \"legitimate interests\" means the interests of Knitbot and our affiliated businesses in conducting and managing our business. When we process your personal data for our legitimate interests, we make sure to consider and balance any potential impact on you and your rights under data protection laws. Our legitimate interests do not automatically override your interests. We do not use personal data for activities where our interests override the impact they may have on our users, unless we have their explicit consent or those activities are otherwise required or permitted by law. You have the right to object to the processing of your personal data that is based on our legitimate interests at any time, on grounds relating to your particular situation (for more information on your rights, please see the User Agreement).<br><br>When would we share personal information<br>We share your personal data with third parties in the following situations:<br><br>Service providers: Knitbot, like many businesses, occasionally engages with selected third parties who act on our behalf to support our operations, such as (i) IT suppliers and contractors (i.e. data hosting providers or delivery partners) as necessary to provide IT support and enable us to provide subscription services and other goods/services available on this Website or to users, (ii) web and mobile analytics providers, (iii) providers of digital advertising services, and (iv) providers of marketing and sales software solutions. Pursuant to our instructions, these parties may access, process or store your personal data in the course of performing their duties to us and solely in order to perform the services we have hired them to provide.<br><br>Knitbot affiliated businesses: In order to provide the services you request from us, our affiliated businesses may access and process the information which we collect from you for the purposes described above, including offering products and services to you. Our affiliated businesses will only use your data for the purposes for which we originally collected said data.<br><br>Analytics providers: We may use third-party service providers to monitor and analyze the use of our services and mobile/desktop applications. We use this information to analyze and improve the work of our services and mobile applications.<br><br>We may use Google Analytics as a web analytics service on the Website, mobile apps and in conjunction with the widgets we provide. For more information on Google Analytics privacy practices, you can check here. Analytics services for mobile and desktop applications that we may use:<br><br>Firebase — a development and analytics platform provided by Google. For more information on what type of information is collected, please visit the Firebase web page. Flurry Analytics — provides us with tools and resources for understanding our mobile application users' behavior. For more information on the handling of user data on Flurry Analytics, please see their Privacy Policy. Visual Studio App Center — owned by Microsoft. Their applicable data protection provisions can be reviewed under the Microsoft Privacy Statement. AppsFlyer — analytics services to measure and analyze the effectiveness of our marketing and advertising campaigns, as well as certain events and actions in the application. For more information on how AppsFlyer works and what data it collects, please see AppsFlyer Services Privacy Policy. Sentry — is an error tracking and performance monitoring platform that helps us diagnose, fix, and optimize the performance of our platform. For more information on what data collected by Sentry, please see Sentry Privacy Policy.<br><br>Business transfers: If we sell our business or our company assets are acquired by a third party, personal data held by us about our general account users, subscription account users or customers may be one of the transferred assets.<br><br>Administrative and legal reasons: If we need to disclose your personal data (i) to comply with a legal obligation and/or judicial or regulatory proceedings, a court order or other legal process, (ii) to enforce our Terms of Use, House Rules or other applicable contract terms that you are subject to, or (iii) to protect us or our contractors against loss or damage. This may include, but is not limited to, exchanging information with the police, courts or law enforcement organisations.<br><br>Advertising: We display advertising on the Website and may use remarketing and tracking features. Remarketing features allow us to display advertising in a more targeted manner in order to present advertisements of interest to users, based on their activity on other websites. Tracking features allow us to collect information about impressions, ad clicks and certain actions that users complete through our Website. This data also helps us evaluate the performance of ad campaigns. Note that we collect pseudonymous data only. We may use the following services for advertising, remarketing, and tracking purposes:<br><br>Google Ad Manager and Google Ads — they help us serve and measure the success of ads on our site. For more information about how Google uses data, please refer to their Privacy & Terms document as well as Google's Privacy Policy. You can opt out of this by visiting the Network Advertising Initiative opt-out page or by turning off the personalization of Google ads via their Ad Settings page.<br><br>Meta pixel — allows us to measure, optimise, and build audiences for our advertising campaigns. You can learn more about Meta's data policy here. You can manage your personal settings for advertisements on Facebook at Your Ad Preferences. In case you don't have a Facebook account, you can use Your Online Choices website or DAA's WebChoices Tool to manage your ad experience.<br><br>Twitter Conversion Tracking (Twitter Pixel) — helps us to measure our return on ad expenditure. For more information about Twitter data processing, please see their Privacy policy. You can adjust the settings in your personal Twitter profile and opt to receive advertising. In case you don't have a Twitter account, you can use Your Online Choices website or DAA's WebChoices Tool to manage your ad experience.<br><br>Note that we do not share any personal information with our advertisers. They can only access general statistics that include the amount of impressions their ads have generated as well as clicks.<br><br>Google reCAPTCHA: We use reCAPTCHA to check whether data has been entered by a person or by an automated program. We use this service to protect our services from spam, fraud and abuse. reCAPTCHA analyses the behavior of the visitor using various characteristics and evaluates various information for analysis purposes (e.g. IP address, visit duration, or the user's mouse clicks). This analysis begins automatically, as soon as the website visitor accesses the website, and runs in the background. Visitors are not informed that an analysis is being performed. The data recorded during analysis is forwarded to Google. More information on Google reCAPTCHA and the Google Privacy Policy can be found under the following links: Google's Privacy Policy and What is reCAPTCHA?.<br><br>YouTube API Services: We use YouTube API to share your chosen video ideas and video streams to your YouTube account. When you use this service, you will need to sign in with your Google account and grant us permission to access your YouTube account. We will only use this access to upload videos that you choose to share with us. We will not store, modify, delete, or view any other data from your YouTube account. We will also not share your Google account information with any third parties. You can revoke our access to your YouTube account at any time by visiting Google security settings page. By using this service you are agreeing to be bound by the YouTube Terms of Service.<br><br>Public information on our site<br>Public Profile<br>There is no profile that is publicly visible to others.<br>Public content<br>There is no content that is publicly visible to others.<br><br>Security of personal data<br>We use technical and organizational safeguards to protect your personal data and require third parties with whom we work to do the same. We employ various encryption technologies to protect certain information that you submit to us. This helps protect your information from being intercepted by anyone while it is being transmitted. We work hard to ensure that our Service is secure and that we meet industry standards. We also use other safeguards, such as firewalls, authentication systems (e.g., passwords, identifications), and access control mechanisms to control unauthorized access to systems and data. If you have chosen to create an account, you are responsible for doing everything you reasonably can to keep your access details secret. You must not share these details with anyone else. We also do our best to protect user information offline. All of our users' personal information is restricted to our offices. Only employees who need to see the information to perform their jobs are allowed to access it. The servers that store personal data are located in a secure environment in a locked facility. We are constantly improving the ways we secure, store, and process the data we collect, including the addition of physical security measures that help us counter unauthorized access to our systems. However, no method of electronic transmission or storage is 100% secure. Therefore, we cannot guarantee its absolute security.<br><br>Children and sensitive personal data<br>This Website is not directed towards children who are under the age of 18. We do not knowingly contact or collect personal information from children below the age of 18 years, or sensitive personal data (\"racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or a natural person's sex life or sexual orientation,\" etc.). Please consult Art. 9 GDPR for more information. If you believe we have inadvertently collected such information, please contact us immediately so that we can either obtain special consent or delete the information.<br><br>Third Party Sites<br>Links to other sites<br>At our discretion we may add links (web links) to other websites from our Website. These websites can be run by third parties with separate and independent privacy policies. We, therefore, have no responsibility nor are we liable for any content, activities or privacy policies of these linked sites. We suggest you read the privacy policy of each and every site that you visit.<br><br>EEA and UK users' specific rights<br>Individuals subject to European and United Kingdom (\"UK\") data protection laws may have data subject rights in relation to the personal data we hold on them (described in detail below). This may, in and of itself, be subject to limitations and/or restrictions. If you are located in the EEA or UK, please contact us to exercise your rights.<br><br>Accessing data<br>If prompted, we will confirm whether or not we are processing your personal data and if so, we will provide you with a copy of that personal data along with any other pertinent details. If you require additional copies, we may need to charge a reasonable fee, but this can be discussed and depends on the situation.<br><br>Restricting the processing of personal data<br>You may ask us to restrict or 'block' the processing of your personal data in certain circumstances, for example, if you contest the accuracy of the data or object to us processing it. We will notify you before we lift any restriction on processing. If we share your personal data with others, we will notify them of the restriction wherever possible. If prompted, and if it is possible and lawful to do so, we will also notify you with whom we have shared or will share your personal data so you can contact them directly.<br><br>Objections<br>You may:<br>ask us to stop processing your personal data at any time, and we will do so. If we are relying on a legitimate interest to process your personal data, then it should not be a problem unless we demonstrate compelling legitimate grounds for processing; object to our processing of your data for the purposes of direct marketing at any time. and refuse to receive service notifications via email. This can be contact through email<br><br>Withdrawal of consent<br>If we rely on your consent to process your personal data, you have the right to withdraw that consent at any time. This will not affect the lawfulness with which we process your data before receiving notice of your wish to withdraw your consent. We emphasize that we do not generally rely on your consent to allow us to process your personal data if there is another lawful ground available. If we do rely on your consent, we will make this clear to you at that time.<br><br>Viewing and correcting data<br>You have the right to have inaccurate personal data rectified or completed if it is incomplete. In order to do so, each user can view, manage and/or update his/her personal data in the Profile settings. If we share your personal data with others, we will notify them of any corrections made whenever possible. If prompted, and where possible and lawful to do so, we will also notify you with whom we have shared your personal data so you can contact them directly if need be.<br><br>Deleting data<br>You have the right to refuse to use our Services and may ask us to delete or remove your personal data in certain circumstances. If we share your data with others, we will notify them of the edits wherever possible. If prompted, and wherever possible and lawful to do so, we will also notify you with whom we have shared your personal data so you can contact them directly if need be.<br><br>Data retention<br>We will keep your personal data (1) until you decide to delete your account (upon request), or (2) as required by law or as necessary for legitimate business purposes (i.e. for tax, legal, accounting, fraud, or abuse prevention, and/or other purposes). This data can be stored even after an account is deleted. Upon expiration of the applicable retention period, we will securely destroy your personal data in accordance with applicable laws and regulations. In some circumstances we may anonymize your personal data so that it can no longer be associated with you. In this case, such data is no longer considered personal.<br><br>Data portability<br>You have the right to obtain your personal data from us, which you consented to give us or that was provided to us as necessary in connection with our contract with you. We will give you your personal data in a structured, commonly used, and machine-readable format. You may reuse it elsewhere if you so wish.<br><br>Lodge a complaint with the data protection authority<br>If you have concerns about our privacy practices, including the way we handle or have your personal data, you can report it to any competent data protection authority of an European Union member state that is authorised to hear such concerns (you may find European Union Data Protection Authorities' contact information here) or to the Information Commissioner's Office (ICO), the UK supervisory authority for data protection issues. If you wish to exercise any of these rights, please contact us. Note that we may need to ask you for further information to verify your identity before we can respond to any request.<br><br>International data transfers<br>Information collected through Services will be stored on servers located in various locations by our service providers and affiliated businesses for the purposes described above. This is necessary to enable you to navigate and use our Services. The data may be transmitted to our service providers and affiliates supporting our business operations (described above). Note that the countries concerned may not provide the same legal standards for protection of your personal data that you have in your country. If we transfer your personal data to countries outside of your country, we will take the necessary steps to ensure your information receives an adequate level of security protection where it is processed and that your rights continue to be protected. If you would like to receive more information on the safeguards that we implement, please contact us via email at: knitbot@protonmail.com<br><br>California users' specific rights<br>If you are an eligible California resident, the California Consumer Privacy Act (\"CCPA\") provides you with specific rights with respect to our collection and use of your personal information. You have the following rights under the CCPA: Right to request that we disclose certain information to you about our collection and use of your personal information over the past 12 months. The list of categories of personal information collected and disclosed about consumers are enlisted in the section 'Personal data that we collect' and the list of categories of third parties to whom the personal information may be disclosed are enlisted in the section 'When would we share personal information'. Please contact us to exercise a data portability request. Separately, we do not sell your personal information. Right to request delete personal information we have collected from you. Please see the \"User account deleting\" section for more details. Right not to be discriminated against regarding pricing and services as you exercise any of your rights under the CCPA. We do not offer consumers financial incentives, price differentials, or services in exchange for selling a consumer's personal information.<br><br>Contact information<br>If you have any questions or suggestions regarding personal data processing, please contact us via email at: knitbot@protonmail.com<br>User Agreement<br><br>In brief: We are Knitbot Org. (\"Knitbot,\" \"we,\" or \"us\"). We respect your privacy and work hard to protect the confidentiality of information that you give us. We will only share your personal data with third parties when it is needed for the provision of services and data you have requested (explained in detail in 'privacy policy'). Our services are intended for use by individuals who are 18 years of age or older.<br><br>Introduction<br><br>Welcome to KnitBot. By using our services, you agree to the following terms and conditions (\"User Agreement\"). Please read them carefully.<br><br>Acceptance of Terms<br><br>By accessing or using our services, you agree to be bound by this User Agreement. If you do not agree to these terms, please do not use our services.<br><br>Services Provided<br><br>KnitBot offers various features, including but not limited to automated trading services, all provided free of charge. The use of these services is at your own risk. Voluntary donations and referrals are appreciated but not required for the use of our services.<br><br>User Obligations<br><br>Users agree not to misuse our services and to comply with all applicable laws and regulations. Users must not attempt to disrupt or interfere with the services.<br><br>Limitation of Liability<br><br>KnitBot provides its services \"as is\" and without any warranty or condition, express, implied, or statutory. KnitBot specifically disclaims any implied warranties of title, merchantability, fitness for a particular purpose, and non-infringement.<br><br>Disclaimer of Warranties and Risks<br><br>Trading Risks<br><br>Automated trading involves significant risk. By using our services, you acknowledge and agree that you are fully responsible for any trading decisions you make and the resulting losses or gains. KnitBot assumes no responsibility for any trading losses incurred.<br><br>Technical Issues<br><br>KnitBot is not responsible for any technical issues, including but not limited to server communication errors, system failures, or any disruptions caused by cyber-attacks, hacks, or other malicious activities. We do not guarantee that our services will be uninterrupted or error-free.<br><br>Service Discrepancies<br><br>We are not responsible for any discrepancies between your actual usage and the intended usage of our services.<br><br>Platform Functionality<br><br>KnitBot provides a platform for executing user-defined trading strategies. Users must set up their own trading strategies, and KnitBot simply transmits the user-executed scripts to the respective exchanges via API. The setup and execution of trading strategies are entirely the user's responsibility.<br><br>Indemnity<br><br>You agree to indemnify and hold KnitBot harmless from any claims, demands, or damages, including reasonable attorney's fees, arising out of your use of our services, your violation of this agreement, or your violation of any rights of another.<br><br>Privacy Policy<br><br>Our privacy policy, which sets out how we handle your personal information, can be found at Privacy Policy. By using our services, you consent to our collection and use of personal data as outlined in the privacy policy.<br><br>Termination<br><br>We reserve the right to terminate or suspend your account and access to our services at our sole discretion, without notice, for conduct that we believe violates this User Agreement or is harmful to other users of our services, us, or third parties, or for any other reason.<br><br>Governing Law and Dispute Resolution<br><br>This agreement shall be governed by and construed in accordance with the principles of fairness and without regard to conflicts of law principles. Any disputes arising out of or relating to this agreement shall be resolved through binding arbitration in accordance with the rules of a mutually agreed-upon arbitration organization.<br><br>Donations and Referrals<br><br>All donations to KnitBot are voluntary and are not required to access or use our services. Additionally, users may choose to sign up for exchanges using our referral links, which may benefit KnitBot, but this is also entirely voluntary.<br><br>Changes to the User Agreement<br><br>We may update this User Agreement from time to time by posting a new version on our website. You should check our website occasionally to ensure any changes made are suitable for you. If required by applicable law, you will be informed of any significant changes made to the User Agreement.<br><br>Contact information<br><br>If you have any questions or suggestions regarding this User Agreement, please contact us at: <br>knitbot@protonmail.com",
        "CONTEXT_1": "Privacy Policy<br>In brief: We are Knitbot org. (\"Knitbot\", \"we\", or \"us\"). We respect your privacy and work hard to protect the confidentiality of information that you give us. We will only share your personal data with third parties when it is needed for the provision of services and data you have requested (explained in detail in this privacy policy).",
        "CONTEXT_2": "About Us<br>Knitbot is the data controller responsible for your personal data and is the sole owner of the knitbot.ai website (\"Website\"), Knitbot mobile and desktop applications(soon), Knitbot services (each, a \"Service\") and all of the information collected on it. Knitbot collects information from users in several ways (explained in detail in this privacy policy).This privacy policy applies to personal data that we collect from you when you visit this Website, create an account, use our applications or services (\"you\" or \"your\" being interpreted accordingly). It provides information on what personal data we collect, why we collect personal data, how it is used, the lawful basis on which your personal data is processed, how it is stored, and how we share information.As used in this privacy policy, \"personal data\" means any information that relates to you from which you can be identified.By using our Service or submitting your personal data, you are agreeing to accept the terms of this privacy policy, so please read it carefully. If you disagree with this privacy policy at any point or time, you should stop using our Services and delete your user account.",
        "CONTEXT_3": "Updates<br>We may update this privacy policy at our discretion from time to time by posting a new version on our Website. You should check our Website occasionally to ensure any changes made are suitable for you. If required by applicable law, you will be informed of any significant changes made to the privacy policy.The current version of this privacy policy was modified on July 1, 2024.",
        "CONTEXT_4": "Personal data that we collectThere is no need to create an account when searching and viewing information from knitbot.ai, such as announcements, guides.",
        "CONTEXT_5": "Data we receive from you",
        "CONTEXT_6": "User Accounts<br>If you decide to create an account, you will need to provide us with some personal data so we can provide you with access to our additional services that users benefit from. You may also elect to provide us with additional information about you, as described below.During registration you will be required to provide us with either: your username, email address; In some cases, you may need to provide and verify your phone number. You can also add additional information about yourself in the profile settings, however, this is not mandatory. The following information will be publicly displayed: nothing The following information will not be publicly displayed: your first and last name, phone number and email.",
        "CONTEXT_7": "API data<br>Exchange API keys and related security keys and passwords are not stored on our server to protect sensitive information from server hacking attacks. They are only used on a one-time basis to run the instance.  During using automated trading service with API through website you will be required to provide(not stored at server) us: API keys and security keys issued by the exchange, and any other exchange-issued items that are required for automated trading;",
        "CONTEXT_8": "Cookies<br>We do not collect cookies.",
        "CONTEXT_9": "Log files<br>We do not collect Log files.",
        "CONTEXT_10": "Device information<br>We do not collect Device information.",
        "CONTEXT_11": "Telegram data<br>If you want to use the Telegram bot for automated trading, setting up notifications, etc, you will need to provide us with relevant information. During using automated trading service with website through Telegram, you will be required to provide us: your Telegram bot token, your Telegram chat ID; Even if you don't use Telegram, you can still use some of the features we offer through the website.",
        "CONTEXT_12": "Data we receive from third parties<br>If you use an exchange API (Binance, Bybit, Bitget, Okx;) to register an API on the website, the service will be able to see information that the exchanges you use provide to us through their respective APIs. We use it to ensure that our terms of service agreement is being adhered to. We neither control nor take any responsibility for the way third parties provide information about you and/or process your personal data.",
        "CONTEXT_13": "Contact data<br>We also process any personal data you choose to give when corresponding with us by phone, email, or otherwise visiting and interacting with this Website or any other services we operate. By providing your phone number, you agree to receive text messages from us. Message and data rates may apply. Message frequency varies. We will not share your contact phone number with any other parties unless explicitly specified by this policy.",
        "CONTEXT_14": "How personal information is used<br>We use personal data in various ways that are necessary to provide the services you intend to use, certain legitimate interests, and as a necessity in order to comply with applicable law, as further described below. We do not generally rely on your consent to allow us to process your personal data if there is another lawful ground available. If we do rely on your consent, we will make this clear to you at that time.",
        "CONTEXT_15": "Profile<br>A profile is a set of information for each individual user that details his/her viewing preferences. User settings are kept solely for the purpose of customizing the user’s experience when using the Website, applications or user accounts. We do not share private profile settings with any third parties.",
        "CONTEXT_16": "User account and profile operations<br>We use your contact details, such as username, email address, or phone number, in the following ways: to authenticate your user account, ensure its security along with the security of our services, and to prevent spam, fraud, and abuse; to acknowledge, confirm, and deal with your user account; to send all new users a welcome activation email to verify their email address;",
        "CONTEXT_17": "User account deleting<br>You may refuse to use our Website and/or application and may ask us to delete your account in the profile settings. Your account will be deleted immediately. Please note that if  your account is to be deleted, we will delete the subsequent personal data you have supplied us. Some data, such as used preferences/scripts will be saved as they have already integrated into our system. This data must be stored to maintain the integrity of the platform.",
        "CONTEXT_18": "Marketing<br>We may send you marketing emails about our products or services that are similar to the products or services you are subscribed to, including information about events and other promotions we feel may interest you. This is unless you have indicated to us that you do not wish to receive communications in this manner. Users can opt out of receiving marketing communications at any time by contacting us through the email",
        "CONTEXT_19": "Service-Related Announcements<br>On rare occasions, it may be necessary to send out service-related announcements. For instance, if our service is interrupted for a prolonged period or a major functionality upgrade is released, we might send all users an email message.",
        "CONTEXT_20": "Customer Service<br>When you contact through mail, we can service you to solve the website issue(s).",
        "CONTEXT_21": "API<br>If you are using our API (Application Programming Interface) services (such as the Advanced Charts, Trading Platform, REST API), then we may process your personal data in order to be able to provide and support those services.",
        "CONTEXT_22": "Legitimate interests<br>We will process your personal data as necessary for certain legitimate business interests, which include the following: where we are asked to respond to any of your inquiries, comments, or grievances; to administer our services in order to better understand how visitors interact with the Website and application, and ensure that they are presented in the most effective manner for you and your computer/device; to develop and improve our mobile applications; to share personal data among our affiliated businesses for administrative purposes, provide subscription services, and in relation to our sales and marketing activities, except where we require your consent, as described above; to send you information about our products or services that are similar to the products or services you subscribed to (unless you have refused or opted out of receiving these emails at the time you provided us with your email address or you have indicated to us that you do not wish to receive communications in this manner). Our legitimate interest is to ensure our marketing is relevant to you, so we may process your data to send you information on our products or services that is specifically tailored to your interests; we may anonymize, pseudonymize, aggregate and de-identify the data that we collect and use this data for our own internal business purposes, including sharing it with our business partners, our affiliated businesses, agents and other third parties for commercial, statistical and market research purposes. For example, to allow those parties to analyse patterns among groups of people and conducting research on demographics, interests, and behavior; for internal business/technical operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes, and as part of our efforts to keep our Website, network, and information systems secure; and to (a) comply with legal obligations, (b) respond to requests from competent authorities; (c) enforce our Terms of Use or House Rules; (d) protect our operations or those of any of our affiliated businesses; (e) protect our rights, safety or property, and/or that of our affiliated businesses, you or others; and (f) enforce or defend legal rights, or prevent damage. This means we can store and disclose your information to law enforcement authorities, state, or government agencies if we establish that such disclosure is necessary to comply with the law. This includes responses to court orders or subpoenas, as well as other judicial or regulatory processes. As used in this privacy policy, “legitimate interests” means the interests of Knitbot and our affiliated businesses in conducting and managing our business. When we process your personal data for our legitimate interests, we make sure to consider and balance any potential impact on you and your rights under data protection laws. Our legitimate interests do not automatically override your interests. We do not use personal data for activities where our interests override the impact they may have on our users, unless we have their explicit consent or those activities are otherwise required or permitted by law. You have the right to object to the processing of your personal data that is based on our legitimate interests at any time, on grounds relating to your particular situation (for more information on your rights, please see the User Agreement).",
        "CONTEXT_23": "When would we share personal information<br>We share your personal data with third parties in the following situations:",
        "CONTEXT_24": "Service providers: Knitbot, like many businesses, occasionally engages with selected third parties who act on our behalf to support our operations, such as (i) IT suppliers and contractors (i.e. data hosting providers or delivery partners) as necessary to provide IT support and enable us to provide subscription services and other goods/services available on this Website or to users, (ii) web and mobile analytics providers, (iii) providers of digital advertising services, and (iv) providers of marketing and sales software solutions. Pursuant to our instructions, these parties may access, process or store your personal data in the course of performing their duties to us and solely in order to perform the services we have hired them to provide.",
        "CONTEXT_25": "Knitbot affiliated businesses: In order to provide the services you request from us, our affiliated businesses may access and process the information which we collect from you for the purposes described above, including offering products and services to you. Our affiliated businesses will only use your data for the purposes for which we originally collected said data.",
        "CONTEXT_26": "Analytics providers: We may use third-party service providers to monitor and analyze the use of our services and mobile/desktop applications. We use this information to analyze and improve the work of our services and mobile applications.",
        "CONTEXT_27": "We may use Google Analytics as a web analytics service on the Website, mobile apps and in conjunction with the widgets we provide. For more information on Google Analytics privacy practices, you can check here. Analytics services for mobile and desktop applications that we may use:",
        "CONTEXT_28": "Firebase — a development and analytics platform provided by Google. For more information on what type of information is collected, please visit the Firebase web page. Flurry Analytics — provides us with tools and resources for understanding our mobile application users’ behavior. For more information on the handling of user data on Flurry Analytics, please see their Privacy Policy. Visual Studio App Center — owned by Microsoft. Their applicable data protection provisions can be reviewed under the Microsoft Privacy Statement. AppsFlyer — analytics services to measure and analyze the effectiveness of our marketing and advertising campaigns, as well as certain events and actions in the application. For more information on how AppsFlyer works and what data it collects, please see AppsFlyer Services Privacy Policy. Sentry — is an error tracking and performance monitoring platform that helps us diagnose, fix, and optimize the performance of our platform. For more information on what data collected by Sentry, please see Sentry Privacy Policy.",
        "CONTEXT_29": "Business transfers: If we sell our business or our company assets are acquired by a third party, personal data held by us about our general account users, subscription account users or customers may be one of the transferred assets.",
        "CONTEXT_30": "Administrative and legal reasons: If we need to disclose your personal data (i) to comply with a legal obligation and/or judicial or regulatory proceedings, a court order or other legal process, (ii) to enforce our Terms of Use, House Rules or other applicable contract terms that you are subject to, or (iii) to protect us or our contractors against loss or damage. This may include, but is not limited to, exchanging information with the police, courts or law enforcement organisations.",
        "CONTEXT_31": "Advertising: We display advertising on the Website and may use remarketing and tracking features. Remarketing features allow us to display advertising in a more targeted manner in order to present advertisements of interest to users, based on their activity on other websites. Tracking features allow us to collect information about impressions, ad clicks and certain actions that users complete through our Website. This data also helps us evaluate the performance of ad campaigns. Note that we collect pseudonymous data only. We may use the following services for advertising, remarketing, and tracking purposes:",
        "CONTEXT_32": "Google Ad Manager and Google Ads — they help us serve and measure the success of ads on our site. For more information about how Google uses data, please refer to their Privacy & Terms document as well as Google’s Privacy Policy. You can opt out of this by visiting the Network Advertising Initiative opt-out page or by turning off the personalization of Google ads via their Ad Settings page.",
        "CONTEXT_33": "Meta pixel — allows us to measure, optimise, and build audiences for our advertising campaigns. You can learn more about Meta’s data policy here. You can manage your personal settings for advertisements on Facebook at Your Ad Preferences. In case you don’t have a Facebook account, you can use Your Online Choices website or DAA's WebChoices Tool to manage your ad experience.",
        "CONTEXT_34": "Twitter Conversion Tracking (Twitter Pixel) — helps us to measure our return on ad expenditure. For more information about Twitter data processing, please see their Privacy policy. You can adjust the settings in your personal Twitter profile and opt to receive advertising. In case you don’t have a Twitter account, you can use Your Online Choices website or DAA's WebChoices Tool to manage your ad experience.",
        "CONTEXT_35": "Note that we do not share any personal information with our advertisers. They can only access general statistics that include the amount of impressions their ads have generated as well as clicks.",
        "CONTEXT_36": "Google reCAPTCHA: We use reCAPTCHA to check whether data has been entered by a person or by an automated program. We use this service to protect our services from spam, fraud and abuse. reCAPTCHA analyses the behavior of the visitor using various characteristics and evaluates various information for analysis purposes (e.g. IP address, visit duration, or the user’s mouse clicks). This analysis begins automatically, as soon as the website visitor accesses the website, and runs in the background. Visitors are not informed that an analysis is being performed. The data recorded during analysis is forwarded to Google. More information on Google reCAPTCHA and the Google Privacy Policy can be found under the following links: Google’s Privacy Policy and What is reCAPTCHA?.",
        "CONTEXT_37": "YouTube API Services: We use YouTube API to share your chosen video ideas and video streams to your YouTube account. When you use this service, you will need to sign in with your Google account and grant us permission to access your YouTube account. We will only use this access to upload videos that you choose to share with us. We will not store, modify, delete, or view any other data from your YouTube account. We will also not share your Google account information with any third parties. You can revoke our access to your YouTube account at any time by visiting Google security settings page. By using this service you are agreeing to be bound by the YouTube Terms of Service.",
        "CONTEXT_38": "Public information on our site<br>Public Profile<br>There is no profile that is publicly visible to others.<br>Public content<br>There is no content that is publicly visible to others.",
        "CONTEXT_39": "Security of personal data<br>We use technical and organizational safeguards to protect your personal data and require third parties with whom we work to do the same. We employ various encryption technologies to protect certain information that you submit to us. This helps protect your information from being intercepted by anyone while it is being transmitted. We work hard to ensure that our Service is secure and that we meet industry standards. We also use other safeguards, such as firewalls, authentication systems (e.g., passwords, identifications), and access control mechanisms to control unauthorized access to systems and data. If you have chosen to create an account, you are responsible for doing everything you reasonably can to keep your access details secret. You must not share these details with anyone else. We also do our best to protect user information offline. All of our users' personal information is restricted to our offices. Only employees who need to see the information to perform their jobs are allowed to access it. The servers that store personal data are located in a secure environment in a locked facility. We are constantly improving the ways we secure, store, and process the data we collect, including the addition of physical security measures that help us counter unauthorized access to our systems. However, no method of electronic transmission or storage is 100% secure. Therefore, we cannot guarantee its absolute security.",
        "CONTEXT_40": "Children and sensitive personal data<br>This Website is not directed towards children who are under the age of 18. We do not knowingly contact or collect personal information from children below the age of 18 years, or sensitive personal data (\"racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or a natural person’s sex life or sexual orientation,\" etc.). Please consult Art. 9 GDPR for more information. If you believe we have inadvertently collected such information, please contact us immediately so that we can either obtain special consent or delete the information.",
        "CONTEXT_41": "Third Party Sites<br>Links to other sites<br>At our discretion we may add links (web links) to other websites from our Website. These websites can be run by third parties with separate and independent privacy policies. We, therefore, have no responsibility nor are we liable for any content, activities or privacy policies of these linked sites. We suggest you read the privacy policy of each and every site that you visit.",
        "CONTEXT_42": "EEA and UK users' specific rights<br>Individuals subject to European and United Kingdom (\"UK\") data protection laws may have data subject rights in relation to the personal data we hold on them (described in detail below). This may, in and of itself, be subject to limitations and/or restrictions. If you are located in the EEA or UK, please contact us to exercise your rights.",
        "CONTEXT_43": "Accessing data<br>If prompted, we will confirm whether or not we are processing your personal data and if so, we will provide you with a copy of that personal data along with any other pertinent details. If you require additional copies, we may need to charge a reasonable fee, but this can be discussed and depends on the situation.",
        "CONTEXT_44": "Restricting the processing of personal data<br>You may ask us to restrict or ‘block’ the processing of your personal data in certain circumstances, for example, if you contest the accuracy of the data or object to us processing it. We will notify you before we lift any restriction on processing. If we share your personal data with others, we will notify them of the restriction wherever possible. If prompted, and if it is possible and lawful to do so, we will also notify you with whom we have shared or will share your personal data so you can contact them directly.",
        "CONTEXT_45": "Objections<br>You may:<br>ask us to stop processing your personal data at any time, and we will do so. If we are relying on a legitimate interest to process your personal data, then it should not be a problem unless we demonstrate compelling legitimate grounds for processing; object to our processing of your data for the purposes of direct marketing at any time. and refuse to receive service notifications via email. This can be contact through email",
        "CONTEXT_46": "Withdrawal of consent<br>If we rely on your consent to process your personal data, you have the right to withdraw that consent at any time. This will not affect the lawfulness with which we process your data before receiving notice of your wish to withdraw your consent. We emphasize that we do not generally rely on your consent to allow us to process your personal data if there is another lawful ground available. If we do rely on your consent, we will make this clear to you at that time.",
        "CONTEXT_47": "Viewing and correcting data<br>You have the right to have inaccurate personal data rectified or completed if it is incomplete. In order to do so, each user can view, manage and/or update his/her personal data in the Profile settings. If we share your personal data with others, we will notify them of any corrections made whenever possible. If prompted, and where possible and lawful to do so, we will also notify you with whom we have shared your personal data so you can contact them directly if need be.",
        "CONTEXT_48": "Deleting data<br>You have the right to refuse to use our Services and may ask us to delete or remove your personal data in certain circumstances. If we share your data with others, we will notify them of the edits wherever possible. If prompted, and wherever possible and lawful to do so, we will also notify you with whom we have shared your personal data so you can contact them directly if need be.",
        "CONTEXT_49": "Data retention<br>We will keep your personal data (1) until you decide to delete your account (upon request), or (2) as required by law or as necessary for legitimate business purposes (i.e. for tax, legal, accounting, fraud, or abuse prevention, and/or other purposes). This data can be stored even after an account is deleted. Upon expiration of the applicable retention period, we will securely destroy your personal data in accordance with applicable laws and regulations. In some circumstances we may anonymize your personal data so that it can no longer be associated with you. In this case, such data is no longer considered personal.",
        "CONTEXT_50": "Data portability<br>You have the right to obtain your personal data from us, which you consented to give us or that was provided to us as necessary in connection with our contract with you. We will give you your personal data in a structured, commonly used, and machine-readable format. You may reuse it elsewhere if you so wish.",
        "CONTEXT_51": "Lodge a complaint with the data protection authority<br>If you have concerns about our privacy practices, including the way we handle or have your personal data, you can report it to any competent data protection authority of an European Union member state that is authorised to hear such concerns (you may find European Union Data Protection Authorities’ contact information here) or to the Information Commissioner's Office (ICO), the UK supervisory authority for data protection issues. If you wish to exercise any of these rights, please contact us. Note that we may need to ask you for further information to verify your identity before we can respond to any request.",
        "CONTEXT_52": "International data transfers<br>Information collected through Services will be stored on servers located in various locations by our service providers and affiliated businesses for the purposes described above. This is necessary to enable you to navigate and use our Services. The data may be transmitted to our service providers and affiliates supporting our business operations (described above). Note that the countries concerned may not provide the same legal standards for protection of your personal data that you have in your country. If we transfer your personal data to countries outside of your country, we will take the necessary steps to ensure your information receives an adequate level of security protection where it is processed and that your rights continue to be protected. If you would like to receive more information on the safeguards that we implement, please contact us via email at: knitbot@protonmail.com",
        "CONTEXT_53": "California users' specific rights<br>If you are an eligible California resident, the California Consumer Privacy Act (\"CCPA\") provides you with specific rights with respect to our collection and use of your personal information. You have the following rights under the CCPA: Right to request that we disclose certain information to you about our collection and use of your personal information over the past 12 months. The list of categories of personal information collected and disclosed about consumers are enlisted in the section 'Personal data that we collect' and the list of categories of third parties to whom the personal information may be disclosed are enlisted in the section 'When would we share personal information'. Please contact us to exercise a data portability request. Separately, we do not sell your personal information. Right to request delete personal information we have collected from you. Please see the “User account deleting” section for more details. Right not to be discriminated against regarding pricing and services as you exercise any of your rights under the CCPA. We do not offer consumers financial incentives, price differentials, or services in exchange for selling a consumer's personal information.",
        "CONTEXT_54": "Contact information<br>If you have any questions or suggestions regarding personal data processing, please contact us via email at: knitbot@protonmail.com"
    },
    "UA": {
        "CONTEXT_1": "User Agreement",
        "CONTEXT_2": "In brief: We are Knitbot Org. (\"Knitbot,\" \"we,\" or \"us\"). We respect your privacy and work hard to protect the confidentiality of information that you give us. We will only share your personal data with third parties when it is needed for the provision of services and data you have requested (explained in detail in ‘privacy policy’). Our services are intended for use by individuals who are 18 years of age or older.",
        "CONTEXT_3": "Introduction",
        "CONTEXT_4": "Welcome to KnitBot. By using our services, you agree to the following terms and conditions (\"User Agreement\"). Please read them carefully.",
        "CONTEXT_5": "Acceptance of Terms",
        "CONTEXT_6": "By accessing or using our services, you agree to be bound by this User Agreement. If you do not agree to these terms, please do not use our services.",
        "CONTEXT_7": "Services Provided",
        "CONTEXT_8": "KnitBot offers various features, including but not limited to automated trading services, all provided free of charge. The use of these services is at your own risk. Voluntary donations and referrals are appreciated but not required for the use of our services.",
        "CONTEXT_9": "User Obligations",
        "CONTEXT_10": "Users agree not to misuse our services and to comply with all applicable laws and regulations. Users must not attempt to disrupt or interfere with the services.",
        "CONTEXT_11": "Limitation of Liability",
        "CONTEXT_12": "KnitBot provides its services \"as is\" and without any warranty or condition, express, implied, or statutory. KnitBot specifically disclaims any implied warranties of title, merchantability, fitness for a particular purpose, and non-infringement.",
        "CONTEXT_13": "Disclaimer of Warranties and Risks",
        "CONTEXT_14": "Trading Risks",
        "CONTEXT_15": "Automated trading involves significant risk. By using our services, you acknowledge and agree that you are fully responsible for any trading decisions you make and the resulting losses or gains. KnitBot assumes no responsibility for any trading losses incurred.",
        "CONTEXT_16": "Technical Issues",
        "CONTEXT_17": "KnitBot is not responsible for any technical issues, including but not limited to server communication errors, system failures, or any disruptions caused by cyber-attacks, hacks, or other malicious activities. We do not guarantee that our services will be uninterrupted or error-free.",
        "CONTEXT_18": "Service Discrepancies",
        "CONTEXT_19": "We are not responsible for any discrepancies between your actual usage and the intended usage of our services.",
        "CONTEXT_20": "Platform Functionality",
        "CONTEXT_21": "KnitBot provides a platform for executing user-defined trading strategies. Users must set up their own trading strategies, and KnitBot simply transmits the user-executed scripts to the respective exchanges via API. The setup and execution of trading strategies are entirely the user's responsibility.",
        "CONTEXT_22": "Indemnity",
        "CONTEXT_23": "You agree to indemnify and hold KnitBot harmless from any claims, demands, or damages, including reasonable attorney's fees, arising out of your use of our services, your violation of this agreement, or your violation of any rights of another.",
        "CONTEXT_24": "Privacy Policy",
        "CONTEXT_25": "Our privacy policy, which sets out how we handle your personal information, can be found at Privacy Policy. By using our services, you consent to our collection and use of personal data as outlined in the privacy policy.",
        "CONTEXT_26": "Termination",
        "CONTEXT_27": "We reserve the right to terminate or suspend your account and access to our services at our sole discretion, without notice, for conduct that we believe violates this User Agreement or is harmful to other users of our services, us, or third parties, or for any other reason.",
        "CONTEXT_28": "Governing Law and Dispute Resolution",
        "CONTEXT_29": "This agreement shall be governed by and construed in accordance with the principles of fairness and without regard to conflicts of law principles. Any disputes arising out of or relating to this agreement shall be resolved through binding arbitration in accordance with the rules of a mutually agreed-upon arbitration organization.",
        "CONTEXT_30": "Donations and Referrals",
        "CONTEXT_31": "All donations to KnitBot are voluntary and are not required to access or use our services. Additionally, users may choose to sign up for exchanges using our referral links, which may benefit KnitBot, but this is also entirely voluntary.",
        "CONTEXT_32": "Changes to the User Agreement",
        "CONTEXT_33": "We may update this User Agreement from time to time by posting a new version on our website. You should check our website occasionally to ensure any changes made are suitable for you. If required by applicable law, you will be informed of any significant changes made to the User Agreement.",
        "CONTEXT_34": "Contact information",
        "CONTEXT_35": "If you have any questions or suggestions regarding this User Agreement, please contact us at: <br>knitbot@protonmail.com"
    }
}