{
    "HELLO": "こんにちは",
    "KNIT_BOT": "knitbot.ai",

    "COM": {
        "SET_API": "API設定",
        "SET_TELE": "テレグラム設定",
        "CHG_LAN": "言語変更",
        "CHG_DARK_MODE": "ダークモードに切り替え",
        "CHG_LIGHT_MODE": "ライトモードに切り替え",
        "LOGOUT": "ログアウト",
        "BOT_STATUS": "現在のボットの状態",
        "STOP": "停止",
        "OPERATING": "作動中",
        "EXIT": "非常口",
        "NOTICE": "お知らせ",
        "HOW_TO_USE": "Guide",
        "OFFICIAL_TELEGRAM": "KnitBot公式テレグラム",
        "CHEER_TO_OFFICIAL": "取引所の登録でサポート",
        "DONATE_CREATOR": "開発者に寄付する",
        "ADDRESS": "住所",
        "BANNER": "Banner",
        "HOME_NOTICE": "KnitBotは無料で提供されており、リファラル登録は必要ありません。<br>現在、サーバー費用は広告と寄付で維持されています。温かいご支援で開発者の空腹を満たしてください。AdBlockをオフにしていただければ、開発者にとって大きな力になります。"
    },
    "AUTO": {
        "SET_AUTO_SALE": "自動取引設定",
        "SELECT_INDICATOR1": "指標選択1",
        "SELECT_INDICATOR2": "指標選択2",
        "PERIOD": "期間",
        "STANDARD_DEVIATION": "標準偏差",
        "RETRACEMENT": "標準偏差",
        "ATR_LENGTH": "ATRの期間",
        "INITIAL_ACCELERATION": "初期加速要素",
        "INCREMENT": "加速増加量",
        "MAXIMUM": "最大加速要素",
        "SMOOTHING": "スムージング",
        "RSI_LENGTH": "RSI期間",
        "STOCHASTIC_PERIOD": "ストキャスティクス期間",
        "MOVE_AVERAGE": "移動平均線",
        "FIBONACCI_RETRACEMENT": "フィボナッチリトレースメント",
        "SURPASSED_UPPER_LINE": "上部ライン突破",
        "DROPPED_BELOW_UPPER_LINE": "上部ライン下回る",
        "SURPASSED_LOWER_LINE": "下部ライン突破",
        "DROPPED_BELOW_LOWER_LINE": "下部ライン下回る",
        "HIGH_CURRENT_PRICE": "現在価格が高い場合",
        "LOW_CURRENT_PRICE": "現在価格が低い場合",
        "SURPASSED_RATIO": "比率を上回る",
        "DROPPED_BELOW_RATIO": "比率を下回る",
        "SURPASSED_SIGNAL": "シグナル上回る",
        "DROPPED_BELOW_SIGNAL": "シグナル下回る",
        "HIGH_CONSTANT": "定数より大きい場合",
        "LOW_CONSTANT": "定数より小さい場合",
        "HIGHER_K": "%Kが定数より大きい場合",
        "LOWER_K": "%Kが定数より小さい場合",
        "CROSS_K_DOWN": "%Kが下にクロスする場合",
        "CROSS_K_UP": "%Kが上にクロスする場合",
        "LONG_SIGNAL": "ロングシグナル",
        "SHORT_SIGNAL": "ショートシグナル",
        "NONE": "該当なし",
        "CANDLE": "キャンドル",
        "THAN_INDICATOR_1": "指標1に対して",
        "THAN_INDICATOR_2": "指標2に対して",
        "CONSTANT": "定数",
        "BOT_ACTION": "ボットの動作",
        "OPEN": "エントリー",
        "CLOSE": "終了",
        "ADD_LONG_SETTING": "ロング設定追加",
        "ADD_SHORT_SETTING": "ショート設定追加",
        "REMOVE_LONG_SETTING": "ロング設定を削除",
        "REMOVE_SHORT_SETTING": "ショート設定を削除",
        "REVERSE_POSITION_EXIT": "逆ポジションにエントリー時、前のポジションを終了",
        "SHORT_SETTINGS": "ショート設定",
        "LONG_SETTINGS": "ロング設定",
        "TRADE_LAST": "終値",
        "TRADE_OPEN": "始値",
        "TRADE_HIGH": "高値",
        "TRADE_LOW": "安値",
        "SHORT_TERM": "短期移動平均",
        "LONG_TERM": "長期移動平均",
        "MAXIMUM_ACCEL_ELEMENT": "最大加速要素",
        "SIGNAL": "シグナル",
        "RSI_PERIOD": "RSI期間"
    },
    "DEFAULT" : {
        "DEFAULT_SETTING": "基本設定",
        "RESET": "初期化",
        "MODES": "取引種類",
        "FUTURES": "先物",
        "SYMBOLS": "取引シンボル選択",
        "CANDLE_SETTING": "キャンドル設定",
        "1M": "1M",
        "3M": "3M",
        "5M": "5M",
        "15M": "15M",
        "30M": "30M",
        "1H": "1H",
        "4H": "4H",
        "1D": "1D",
        "QUANITITY": "数量",
        "TELEGRAM_INFO": "テレグラム情報",
        "TELEGRAM_KEY": "Bot Token",
        "CONNECT_STATUS": "連携状態",
        "CONNECTED": "連携済み",
        "DISCONNECTED": "未連携",
        "BOT_CONTROL_STATUS": "ボット制御の有無",
        "ON": "オン",
        "OFF": "オフ",
        "TRADE_TYPE": "取引タイプ",
        "ENTER_QUANTITY": "数量入力"
    },
    "USE": {
        "HOW_TO_USE": "使用方法",
        "DISCLAIMER": "免責事項",
        "DISCLAIMER_TXT": "KnitBot（「Knitbot」、「私たち」）は、すべての機能を無料で提供しています。ただし、設定した自動取引は完全にご自身の責任で行っていただきますようお願いいたします。サーバー通信やシステムエラーなど、技術的な問題が発生する可能性があり、KnitBotはその責任を負いません。また、使用方法が実際と異なる場合にも責任を負いかねます。本サイトのすべての機能に関して、KnitBotは一切の責任を負いませんので、これを理解した上で、利用するかどうかを慎重にご判断ください。",
        "SET_API": "API設定",
        "SET_API_TXT1": "「1. 取引所を選択してください。 ",
        "SET_API_TXT2": "2. 取引所から発行されたAPIキーを入力してください。取引所ごとのAPI発行方法については以下を参照してください。",
        "SET_API_TXT3": "3. 取引所から発行されたAPIパスワード（Secret Key）を入力してください。取引所によって用語が若干異なる場合があるのでご注意ください。",
        "SET_API_TXT4": "4. 取引所から発行されたAPIパスフレーズを入力してください。この入力欄はBitget取引所を選択した場合に表示され、他の取引所では必要ない場合があります。」",
        "BITGET_USE": "Bitget取引所API発行方法",
        "BITGET_USE_TXT1": "「Bitgetのホームページにログインし（1）、右上のプロフィールをクリックします（2）。API管理をクリックしてください。」",
        "BITGET_USE_TXT2": "「新しいAPIを作成をクリックしてください。」",
        "BITGET_USE_TXT3": "「1. API名を英語で自由に入力してください。",
        "BITGET_USE_TXT4": "2. 数字のパスワードを作成してください。8〜32桁が可能です。 ",
        "BITGET_USE_TXT5": "3. Read-only のみチェックしてください。",
        "BITGET_USE_TXT6": "4. 認証を行い（4〜5）、Next をクリックして表示されたすべての部分をコピーし、安全に保管してください。」",
        "TELEGRAM_SETTING": "テレグラム設定",
        "TELEGRAM_SETTING_TXT1": "「1. 作成したボットのトークンを入力してください。 例）1234567890",
        "TELEGRAM_SETTING_TXT2": "2. 自分のチャットIDを入力すると、さまざまな機能が利用できます。（オプション）",
        "TELEGRAM_SETTING_TXT3": "3. ボットがエントリーまたは終了する際に通知を受け取ることができます。",
        "TELEGRAM_SETTING_TXT4": "4. テレグラムボットを使用してテレグラム内でボットを制御する機能です。」",
        "AUTO_SALE_SETTING": "自動取引設定（インジケーター選択）",
        "AUTO_SALE_SETTING_TXT": "「自動取引に使用するインジケーターを選択します。<br><br>インジケーター1は必ず選択し、選択したインジケーターに必要なパラメーターを手動で調整できます。<br><br>インジケーター2はオプションです。インジケーター1とインジケーター2を両方使用する場合、設定したアクションはインジケーター1とインジケーター2の両方が満たされたときにのみ作動します。<br>（「AND」条件で結びつけられます。）」",
        "BOT_ACTION_SETTING": "ボットアクション設定",
        "BOT_ACTION_SETTING_TXT": "「ボットアクションを設定できます。<br><br>「キャンドル」は選択したシンボルの現在の価格を意味します。<br>終値、始値、高値、安値を選択でき、基本設定で設定されたキャンドルの時間帯に基づきます。基本的には終値を推奨します。<br><br>上記で設定したインジケーター1に対して、価格の状況や定数に対するインジケーターの状況に基づいてボットアクションを設定できます。<br><br>ボットの動作に関しては、設定した状況が発生したときに、ボットがエントリーするか、終了するかを設定できます。<br><br>ロング（ショート）設定を追加することで、ボットがエントリーする場合と終了する場合をそれぞれ設定できます。エントリーと終了のどちらか一方でも設定されていないと、自動取引はできません。<br><br><span>つまり、各設定を少なくとも2つ以上行う必要があり、条件間での衝突が発生してはいけません！</span><br><br> ロング設定とショート設定の条件が衝突した場合、ボットは作動しません！<br><br> 例えば、EMA（インジケーター1）線の下に下がったときにロングをエントリーしたい場合、インジケーター1に対して「キャンドル値が小さいとき」にボットの動作を「エントリー」と設定します。<br>逆に、EMA（インジケーター1）線の上に上がったときにショートをエントリーしたい場合、インジケーター1に対して「キャンドル値が大きいとき」にボットの動作を「エントリー」と設定します。」<br>",
        "REVERSE": "逆転",
        "REVERSE_TXT": "「ボットが逆ポジションにエントリーする際に、以前のポジションを自動的に終了する機能です。<br>たとえば、以前にボットがロングをエントリーした場合、ロング終了の条件がまだ満たされていない状態でショートエントリーの条件が満たされた場合、既存のロングポジションを終了し、ショートポジションのみをエントリーします。」",
        "DEFAULT_SETTING": "基本設定",
        "DEFAULT_SETTING_TXT": "「取引の種類を選択できます。<br>現在、取引の種類は先物取引（Futures）のみサポートしています。<br><br>取引シンボルの選択では、ボットが取引するシンボルを選択できます。<br><br>キャンドル設定では、自動取引のインジケーターやボットアクションの条件を判断する際の基準となる時間帯を設定します。<span>設定されるキャンドル時間帯によって、特定のインジケーターや条件が変化するため、注意して設定する必要があります。</span><br><br>数量は選択した取引シンボルを自動取引する際に使われる数量を意味します。<br><br><span>このときの数量は選択されたコインの数量であり、USDTではないため、数量は必ずコインの数量を基準に設定する必要があります！</span>」",
        "BOT_ACTING": "ボットの起動と停止",
        "BOT_ACTING_TXT ": "リモコンの右側のアイコンでボットをオン/オフできます。",
        "SAVE": "保存",
        "SAVE_TXT": "「すべての設定が完了したら、ボットを実行する前に保存する必要があります。<br>保存しないと、ボットが実行されなかったり、設定が反映されなかったりするなどのエラーが発生する可能性があるため、必ず保存してください。」",
        "BESIDE": "その他",
        "BESIDE_TXT": "その他の事項については、KnitBot公式テレグラムグループでお問い合わせください。"
    },
    "API": {
        "API_SETTING": "API設定",
        "SELECT_TRADE": "取引所の選択",
        "API_KEY": "API Key",
        "API_SECRET_KEY": "API Secret Key",
        "API_PASSPHRASE": "API Passphrase",
        "API_KEY_TXT": "APIキーを入力してください",
        "API_SECRET_KEY_TXT": "APIセキュリティキーを入力してください",
        "API_PASSPHRASE_TXT": "APIパスフレーズを入力してください",
        "API_SETTING_NOTICE": "この無料サービスを利用することにより、インディケーターの不正確さ、技術的な障害、サーバーのダウン、サービスの中断、または当社の管理外の外的要因によって生じた損失、損害、請求について、KnitBotが責任を負わないことを認め、同意するものとします。すべてのツールおよびデータは「現状のまま」提供され、サービス利用中に行われたすべての決定についての責任はお客様にあります。KnitBotは、本サービスの使用により生じる損失や損害に関して、その原因に関わらず一切の責任を負いません。詳しくは、利用規約をご確認ください。"
    },
    "TELEGRAM": {
        "TELEGRAM_SETTING": "テレグラム設定",
        "TELEGRAM_KEY": "Bot Token",
        "TELEGRAM_KEY_TXT": "ボットトークンを入力してください",
        "CHAT_ID": "Chat id（任意）",
        "CHAT_ID_TXT": "チャットIDを入力してください（任意）",
        "OTHER_SETTING": "その他の設定",
        "BOT_CONTROL_YN": "テレグラムでのボット制御を許可",
        "TELEGRAM_SAVE": "保存",
        "FAIL_SAVE": "テレグラム情報の保存に失敗しました。IDを再確認してください。"
    },
    "MEMBER": {
        "MEMBER_INFO": "会員情報",
        "PROFILE_IMAGE_CHANGE": "プロフィール画像の変更",
        "PW_CHANGE": "パスワードの変更",
        "MEMBER_WITHDRAWAL": "退会",
        "PW_RESETTING": "パスワードリセット",
        "EMAIL": "メールアドレス",
        "INPUT_EMAIL": "メールアドレスを入力",
        "CERTIFY": "認証する",
        "CONFIRM": "確認",
        "PASSWORD": "パスワード",
        "PASSWORD_CHECK": "パスワード再入力",
        "PASSWORD_TXT": "8～32文字、英数字および特殊文字を含む",
        "INPUT_PASSWORD": "パスワード入力",
        "CHANGE": "変更する",
        "LOGIN": "ログイン",
        "SAVE_EMAIL": "メールアドレスを保存",
        "FIND_PW": "パスワードを忘れた場合",
        "LOGIN_ERROR": "メールアドレスまたはパスワードが一致しません",
        "PW_RULE": "8～32文字、英数字・特殊文字含む 必要",
        "SIGNIN": "会員登録",
        "SIGNIN_TXT_1": "続行して会員登録を完了することで、あなたは当サイトの",
        "SIGNIN_TXT_2": "に同意し",
        "SIGNIN_TXT_3": "を理解したことを認めます。",
        "CONFIRM_SIGNIN": "会員登録完了",
        "TERMS": "利用規約",
        "PERSONAL_INFO": "プライバシーポリシー",
        "IMAGE_CHANGE": "画像を変更",
        "REQUIRE_EMAIL": "メールアドレスを入力してください。",
        "INVALID_EMAIL_RULE": "有効なメールアドレスを入力してください。",
        "REQUIRE_PASSWORD": "パスワードを入力してください。(8~32文字、英数字記号を含む)",
        "INVALID_PASSWORD": "有効なパスワード形式を入力してください。(8~32文字、英数字記号を含む)",
        "REQUIRE_PASSWORD_CHECK": "パスワードを確認してください。(8~32文字、英数字記号を含む)",
        "ERROR_PASSWORD": "パスワードが一致しません。"
    },
    "TOAST": {
        "NEED_LOGIN": "このサービスを利用するにはログインが必要です。",
        "OK_LOGIN": "ログインに成功しました。",
        "OK_LOGOUT": "ログアウトに成功しました。",
        "OK_SIGNIN": "会員登録が完了しました。",
        "OK_SAVE": "保存されました。",
        "OK_UNREGISTE": "退会が完了しました。",
        "OK_RESET": "リセットされました。",
        "OK_PW_CHANGE": "パスワードの変更に成功しました。",
        "OK_OPERATE_BOT": "ボットが実行されています。",
        "OK_SAVE_INSTANCE": "インスタンスが保存されました。",
        "OK_OPERATE_INSTANCE": "インスタンスの起動に成功しました。",
        "OK_SAVE_TELEGRAM": "テレグラム情報が保存されました。",
        "OK_CHANGE_LANGUAGE": "言語が変更されました。",
        "FAIL_SAVE": "保存に失敗しました。",
        "FAIL_PW_CHANGE": "パスワードの変更に失敗しました。",
        "FAIL_SIGNIN": "会員登録に失敗しました。",
        "FAIL_SAVE_INSTANCE": "インスタンスの保存に失敗しました。",
        "FAIL_OPERATE_INSTANCE": "インスタンスの起動に失敗しました。",
        "FAIL_OPERATE_BOT": "ボットの起動に失敗しました。",
        "FAIL_COPY_TEXT": "コピー中にエラーが発生しました。",
        "OK_BOT_STOP": "ボットの動作を停止しました。",
        "FAIL_BOT_STOP": "停止に失敗しました。"
    },
    "LAYOUT": {
        "AUTO": "自動取引",
        "DEFAULT": "基本設定",
        "USE": "使い方",
        "TELEGRAM": "公式テレグラム",
        "NOTICE": "お知らせ"
    },
    "PP": {
        "CONTEXT_0": "プライバシーポリシー 簡単に言うと: 私たちはKnitbot Org.（「Knitbot」、「私たち」）です。私たちはお客様のプライバシーを尊重し、お客様が提供する情報の機密性を保護するために最善を尽くします。お客様が依頼されたサービスおよびデータを提供するために必要な場合にのみ、第三者とお客様の個人情報を共有します（このプライバシーポリシーに詳細を記載しています）。<br>紹介<br>Knitbotは、お客様の個人情報を管理するデータ管理者として、knitbot.aiウェブサイト（「ウェブサイト」）、Knitbotモバイルおよびデスクトップアプリケーション（近日公開予定）、Knitbotサービス（各「サービス」）の唯一の所有者です。Knitbotは、ユーザーからさまざまな方法で情報を収集します（このプライバシーポリシーで詳しく説明しています）。このプライバシーポリシーは、お客様がウェブサイトを訪問する際、アカウントを作成する際、またはアプリケーションやサービスを使用する際に、お客様から収集した個人情報に適用されます（「お客様」「お客様の」は、それに応じて解釈されます）。このポリシーでは、当社がどのような個人情報を収集し、なぜ収集するのか、どのように使用するのか、お客様の個人情報が処理される法的根拠、保存方法、情報共有方法について説明します。このプライバシーポリシーで使用される「個人情報」とは、お客様を識別できる情報に関連するすべての情報を意味します。当社のサービスを使用するか、個人情報を提出することにより、お客様はこのプライバシーポリシーの条件を受け入れることに同意したことになります。したがって、これを注意深くお読みください。このプライバシーポリシーに同意しない場合は、いつでもサービスを停止し、ユーザーアカウントを削除する必要があります。<br><br>更新<br>私たちは、ウェブサイトに新しいバージョンを掲載することで、このプライバシーポリシーを随時更新することができます。変更がご自身に適しているかどうかを確認するため、時折ウェブサイトを確認することをお勧めします。適用される法律に基づき、必要に応じて、プライバシーポリシーに対する重要な変更が通知される場合があります。このプライバシーポリシーの現在のバージョンは、2024年7月1日に修正されました。<br><br>収集する個人情報<br>Knitbot.aiでお知らせやガイドなどの情報を検索または閲覧する際に、アカウントを作成する必要はありません。<br>お客様から受け取るデータ<br>ユーザーアカウント<br>アカウントを作成することを決定した場合、追加のサービスにアクセスできるようにするために、いくつかの個人情報を提供する必要があります。以下に説明するように、お客様に関する追加情報を提供することもできます。 登録中には次の情報を提供する必要があります： ユーザー名、メールアドレス；場合によっては、電話番号を提供し、確認する必要があります。 プロフィール設定で追加情報を入力することができますが、これは必須ではありません。 次の情報は公開されません：お客様の名前、姓、電話番号、メールアドレス。<br><br>APIデータ<br>交換APIキーおよび関連するセキュリティキーとパスワードは、サーバーハッキング攻撃から機密情報を保護するためにサーバーに保存されません。これらはインスタンスを実行するために一度だけ使用されます。ウェブサイトを通じた自動取引サービスを利用する際には、以下を提供する必要があります（サーバーには保存されません）：取引所が発行するAPIキー、セキュリティキー、および自動取引に必要なその他の取引所発行項目。<br><br>クッキー<br>私たちはクッキーを収集しません。<br>ログファイル<br>私たちはログファイルを収集しません。<br>デバイス情報<br>私たちはデバイス情報を収集しません。<br>テレグラムデータ<br>自動取引や通知設定などのためにテレグラムボットを使用する場合は、関連情報を提供する必要があります。テレグラムを通じてウェブサイトで自動取引サービスを利用する際には、以下を提供する必要があります：お客様のテレグラムボットトークン、テレグラムチャットID；テレグラムを使用しない場合でも、ウェブサイトを通じて提供される機能の一部を引き続き利用できます<br><br>第三者から受け取るデータ<br>お客様がウェブサイトにAPIを登録するために、交換API（Binance、Bybit、Bitget、Okxなど）を使用する場合、サービスはお客様が使用する取引所が提供する情報をそのAPIを通じて見ることができます。これは、サービス利用規約の遵守を保証するために使用されます。私たちは第三者がどのようにお客様に関する情報を提供したり、個人情報を処理したりするかを管理したり責任を負ったりすることはありません。<br><br>連絡先データ<br>電話、メール、またはこのウェブサイトや私たちが運営する他のサービスとやり取りする際に、お客様が提供することを選択したすべての個人情報も処理されます。電話番号を提供することで、お客様は私たちからのテキストメッセージの受信に同意したことになります。メッセージおよびデータ料金が発生する場合があります。メッセージの頻度はさまざまです。このプライバシーポリシーで明示的に記載されている場合を除き、お客様の電話番号を第三者と共有することはありません。<br><br>個人情報の使用方法<br>私たちは、お客様が利用しようとするサービスを提供するために必要なさまざまな方法で個人情報を使用します。また、特定の正当な利益のために使用する場合や、適用される法律を遵守するために必要な場合にも使用します。個人情報を処理するために他の合法的な根拠がある場合、私たちは通常、お客様の同意に依存しません。もし私たちが同意に依存する場合は、その時点でお客様に明確に通知します。<br><br>プロファイル<br>プロファイルは、各個別ユーザーの視聴設定を詳しく説明する情報セットです。ユーザー設定は、ウェブサイト、アプリケーション、またはユーザーアカウントを使用する際に、ユーザーの体験をカスタマイズする目的でのみ保持されます。私たちは、個人のプロファイル設定を第三者と共有しません。<br><br>ユーザーアカウントおよびプロファイル操作<br>ユーザーアカウントを認証し、サービスとアカウントのセキュリティを確保し、スパム、詐欺、および悪用を防止するために、ユーザー名、メールアドレス、または電話番号などの連絡先情報を次のように使用します: ユーザーアカウントを確認し、アカウントの問題を処理します; すべての新規ユーザーに対して、メールアドレスを確認するためのアクティベーションメールを送信します。<br><br>ユーザーアカウント削除<br>お客様は、私たちのウェブサイトおよび/またはアプリケーションの使用を拒否し、プロファイル設定でアカウント削除を要求することができます。アカウントは即座に削除されます。アカウントが削除されると、お客様が提供したその後の個人情報も削除されます。すでにシステムに統合されている一部のデータ（例：使用された好み/スクリプト）は保存されます。このデータはプラットフォームの完全性を維持するために保存する必要があります。<br><br>マーケティング<br>私たちは、お客様がサインアップした製品やサービスに類似した製品やサービスについてのマーケティングメールを送信することがあります。これには、お客様が関心を持つ可能性のあるイベントやその他のプロモーション情報が含まれます。ただし、お客様がそのような方法での通信を受け取りたくないことを私たちに知らせた場合は除きます。ユーザーは、いつでもメールでのマーケティング通信の受信を拒否することができます。<br><br>サービス関連の通知<br>まれにですが、サービス関連の通知を送信する必要がある場合があります。例えば、サービスが長期間中断される場合や主要機能のアップグレードがリリースされた場合、すべてのユーザーにメールメッセージを送信することがあります。<br><br>カスタマーサービス<br>メールで連絡することで、ウェブサイトの問題を解決するためのサービスを提供できます。<br><br>API<br>高度なチャート、トレーディングプラットフォーム、REST APIなどのAPI（アプリケーションプログラミングインターフェース）サービスを使用する場合、これらのサービスを提供し、サポートするためにお客様の個人情報を処理することがあります。<br><br>正当な利益<br>私たちは、特定の正当なビジネス利益のために必要な場合に、お客様の個人情報を処理します。これらの利益には以下が含まれます: お客様の問い合わせ、コメント、または苦情に対応することが求められた場合; ウェブサイトやアプリケーションをより効果的に表示するためにサービスを管理し、訪問者がウェブサイトやアプリケーションとどのように対話するかをよりよく理解するために; モバイルアプリケーションを開発および改善するために; 管理目的、購読サービスの提供、および販売およびマーケティング活動に関連して、お客様の同意なしに、関連する場合を除き、お客様の個人情報を当社の関連ビジネス間で共有するために; お客様が購読している製品やサービスに類似した製品やサービスについての情報を送信するために（お客様がメールアドレスを提供した際、またはそのような方法での通信を受け取りたくないことを私たちに知らせた場合を除きます）。私たちのマーケティングが関連するものであるようにするために、お客様のデータを処理して、お客様の関心に合った製品やサービスの情報を送信することができます。収集したデータを匿名化、偽名化、集計し、識別を解除して内部ビジネス目的で使用し、これをビジネスパートナー、関連ビジネス、代理店、およびその他の第三者と共有して、商業的、統計的、および市場調査の目的で使用します。たとえば、特定の人々のグループ間でパターンを分析し、人口統計、興味、および行動に関する研究を実施するために; 内部ビジネス/技術運営のために、トラブルシューティング、データ分析、テスト、調査、統計、および調査目的を含む、ウェブサイト、ネットワーク、および情報システムを安全に保つための取り組みの一環として含まれます; (a) 法的義務を遵守するために、(b) 関係当局の要求に対応するために; (c) 利用規約またはハウスルールを施行するために; (d) 私たちの運営または関連ビジネスの運営を保護するために; (e) 私たちの権利、安全、または財産を保護するために; または (f) 法的権利を保護または執行したり、損害を防止したりするために。これは、法律を遵守することが必要であると判断した場合に、お客様の情報を法執行機関、国家、または政府機関に保存および開示することができることを意味します。これには、裁判所命令や召喚状への対応、およびその他の司法的または規制的手続きが含まれます。このプライバシーポリシーで使用される「正当な利益」とは、Knitbotおよび関連ビジネスの利益を指し、ビジネスを運営し、管理する際の利益を意味します。正当な利益のためにお客様の個人情報を処理する場合、お客様およびお客様のデータ保護法に基づく権利に対する潜在的な影響を考慮し、バランスを取るよう努めます。私たちの正当な利益が自動的にお客様の利益を無視するわけではありません。ユーザーの明示的な同意なしに、または法律によって要求または許可されていない限り、ユーザーに影響を及ぼす可能性のある活動に個人情報を使用することはありません。お客様は、ご自身の特定の状況に関連して、正当な利益に基づく個人情報の処理にいつでも反対する権利があります（お客様の権利に関する詳細は利用規約をご参照ください）。<br><br>個人情報を共有する場合<br>以下のような状況で、お客様の個人情報を第三者と共有することがあります:<br>サービス提供者: Knitbotは多くのビジネスと同様に、時折ITサポートを提供し、サブスクリプションサービスおよびその他の商品/サービスを提供するために、(i) ITサプライヤーおよび契約者（例: データホスティングプロバイダーまたは配送パートナー）、(ii) ウェブおよびモバイル分析プロバイダー、(iii) デジタル広告サービスプロバイダー、(iv) マーケティングおよび営業ソフトウェアソリューションプロバイダーと提携します。これらの企業は、私たちの指示に従って、私たちが彼らに提供するサービスを実行する過程で、お客様の個人情報にアクセスしたり、処理したり、保存したりすることがあります。<br>Knitbot関連ビジネス: お客様がリクエストしたサービスを提供するために、関連するビジネスは上記の目的のために、私たちが収集した情報にアクセスし、処理することがあります。関連ビジネスは、お客様のデータを元々収集した目的にのみ使用します。<br>分析提供者: 私たちは、サービスやモバイル/デスクトップアプリケーションの使用を監視および分析するために、第三者サービス提供者を使用することがあります。この情報を使用して、サービスおよびモバイルアプリケーションの動作を分析し、改善します。私たちは、ウェブサイト、モバイルアプリ、および提供するウィジェットと連携して、Google Analyticsをウェブ分析サービスとして使用することがあります。Google Analyticsのプライバシープラクティスに関する詳細については、こちらをご参照ください。私たちが使用する可能性のあるモバイルおよびデスクトップアプリケーションの分析サービス:<br>Firebase — Googleが提供する開発および分析プラットフォームです。収集される情報の種類に関する詳細については、Firebaseのウェブページをご参照ください。Flurry Analytics — モバイルアプリケーションユーザーの行動を理解するためのツールとリソースを提供します。<br>Flurry Analyticsがユーザーデータをどのように処理するかについての詳細は、プライバシーポリシーをご覧ください。<br>Visual Studio App Center — Microsoftが所有しています。該当するデータ保護規定は、Microsoftのプライバシーポリシーで確認できます。<br>AppsFlyer — マーケティングおよび広告キャンペーンの効果を測定および分析し、アプリケーション内の特定のイベントとアクションを分析するための分析サービスを提供します。AppsFlyerの動作方法と収集されたデータの詳細については、AppsFlyerサービスプライバシーポリシーをご参照ください。<br>Sentry — プラットフォームのエラートラッキングおよびパフォーマンスモニタリングプラットフォームであり、プラットフォームのパフォーマンスを診断、修正、および最適化するのに役立ちます。Sentryが収集したデータの詳細については、Sentryプライバシーポリシーをご参照ください。<br>事業譲渡: 私たちがビジネスを売却したり、会社の資産が第三者に買収された場合、一般アカウントユーザー、サブスクリプションアカウントユーザー、または顧客に関する個人情報が譲渡資産の1つになる可能性があります。<br>行政および法的理由: お客様の個人情報を開示する必要がある場合、(i) 法的義務および/または司法または規制手続き、裁判所の命令、またはその他の法的手続きを遵守するため、(ii) お客様が所属する利用規約、ハウスルール、またはその他の適用される契約条件を施行するため、または (iii) 私たちまたは契約者を損失や損害から保護するために、警察、裁判所、または法執行機関との情報交換を含むがこれに限定されない場合。広告: 私たちはウェブサイトで広告を表示し、リマーケティングおよびトラッキング機能を使用することがあります。リマーケティング機能は、ユーザーの他のウェブサイトでの活動に基づいて、関心のある広告をよりターゲットに合わせて表示することができます。トラッキング機能は、ウェブサイトを通じてユーザーが完了したインプレッション、広告クリック、および特定のアクションに関する情報を収集することができます。このデータは、広告キャンペーンのパフォーマンスを評価するのにも役立ちます。なお、私たちは仮名化されたデータのみを収集します。広告、リマーケティング、およびトラッキングの目的で、以下のサービスを使用することがあります。<br>Google Ad ManagerおよびGoogle Ads — これらは、私たちがサイトで広告を提供し、その成功を測定するのに役立ちます。Googleがデータを使用する方法の詳細については、Googleのプライバシーポリシーを参照してください。Google広告の個人化設定ページで設定をオフにするか、ネットワーク広告イニシアティブのオプトアウトページにアクセスしてオプトアウトできます。<br>Metaピクセル — 広キャンペーンを測定、最適化、および構築するのに役立ちます。Metaのデータポリシーについて詳しく知るには、こちらをご覧ください。Facebook広告の設定は、Facebook広告設定で管理できます。Facebookアカウントを持っていない場合は、Your Online ChoicesウェブサイトやDAAのWebChoicesツールを使用して広告の体験を管理できます。<br>Twitterコンバージョントラッキング（Twitterピクセル）— 広告費用のリターンを測定するのに役立ちます。Twitterのデータ処理に関する詳細は、Twitterのプライバシーポリシーをご覧ください。Twitterのプロフィール設定で広告の受信を選択できます。Twitterアカウントを持っていない場合は、Your Online ChoicesウェブサイトやDAAのWebChoicesツールを使用して広告体験を管理できます。<br>なお、広告主と個人情報を共有することはありません。広告主は生成されたインプレッション数やクリック数を含む一般的な統計データのみを閲覧できます。Google reCAPTCHA: 私たちは、データが人によって入力されたか、または自動プログラムによって入力されたかを確認するためにreCAPTCHAを使用します。私たちは、サービスをスパム、詐欺、および不正行為から保護するためにこのサービスを使用しています。reCAPTCHAは、訪問者の行動をさまざまな特性を用いて分析し、分析目的でIPアドレス、訪問時間、ユーザーのマウスクリックなどのさまざまな情報を評価します。この分析は、ウェブサイトの訪問者がウェブサイトにアクセスした時点で自動的に開始され、バックグラウンドで実行されます。訪問者には分析が行われていることは通知されません。分析中に記録されたデータはGoogleに転送されます。Google reCAPTCHAおよびGoogleプライバシーポリシーに関する詳細は、以下のリンクから確認できます。GoogleのプライバシーポリシーおよびreCAPTCHAとは何か。<br>YouTube APIサービス: 私たちは、YouTube APIを使用して選択したビデオアイデアやビデオストリームをあなたのYouTubeアカウントに共有します。このサービスを使用するには、Googleアカウントでログインし、あなたのYouTubeアカウントへのアクセス権を私たちに付与する必要があります。私たちはこのアクセスを使用して、あなたが私たちと共有することを選択したビデオをアップロードします。あなたのYouTubeアカウントの他のデータを保存、修正、削除、または閲覧することはありません。また、Googleアカウント情報を第三者と共有することもありません。Googleのセキュリティ設定ページにアクセスして、いつでもYouTubeアカウントへのアクセス権を解除できます。このサービスを使用することで、YouTube利用規約に同意したものとみなされます。<br><br>サイト上で公開されている情報<br>公開プロファイル<br>他の人が公開して閲覧できるプロファイルはありません。<br>公開コンテンツ<br>他の人が公開して閲覧できるコンテンツはありません。<br><br>個人情報のセキュリティ<br>私たちは、技術的および組織的な安全対策を用いて、あなたの個人情報を保護し、協力している第三者にも同じ要求をします。私たちは、あなたが提出した特定の情報を保護するために、さまざまな暗号化技術を使用しています。<br>これにより、情報が送信中に誰かによって傍受されることを防ぐことができます。私たちは、サービスが安全であり、業界標準を遵守するよう最善を尽くしています。また、ファイアウォール、認証システム（例：パスワード、識別）、アクセス制御メカニズムなどの他の安全対策を使用して、無許可のアクセスを制御しています。<br>アカウントを作成することを選択した場合、アクセス詳細を秘密に保つためにできる限りのことをする責任があります。この情報を他の人と共有してはいけません。私たちは、オフラインでもユーザー情報を保護するために最善を尽くしています。すべてのユーザーの個人情報は、オフィス内でのみ制限されます。職務を遂行するために情報を閲覧する必要がある従業員のみがこれにアクセスできます。個人情報を保存するサーバーは、安全な環境のロックされた施設にあります。私たちは、収集されたデータを保護し、保存し、処理する方法を継続的に改善しており、これにはシステムへの無許可アクセスを防ぐための物理的なセキュリティ対策が含まれます。<br>ただし、電子送信または保存方法は100％安全ではありません。したがって、その絶対的な安全性を保証することはできません。<br><br>子供および敏感な個人情報<br>このウェブサイトは、18歳未満の子供を対象としていません。私たちは、18歳未満の子供から個人情報を故意に連絡したり収集したりしません。また、敏感な個人情報（例：人種または民族の出身、政治的見解、宗教的または哲学的信念、労働組合への加入、遺伝データの処理、自然人を一意に識別するためのバイオメトリクスデータ、健康関連データ、または自然人の性生活や性的指向）は故意に収集しません。詳細については、GDPR第9条を参照してください。これらの情報を誤って収集したと思われる場合は、直ちにご連絡ください。私たちは特別な同意を得たり、情報を削除するための措置を講じます。<br>第三者サイト<br>私たちは、ウェブサイトから他のウェブサイトへのリンク（ウェブリンク）を追加することがあります。これらのウェブサイトは、別個の独立したプライバシーポリシーを持つ第三者によって運営されている場合があります。したがって、これらのリンクされたサイトの内容、活動、またはプライバシーポリシーについては、私たちは責任を負いません。訪問するすべてのサイトのプライバシーポリシーを読むことをお勧めします。<br>EEAおよび英国ユーザーの特定の権利<br>欧州および英国のデータ保護法の適用を受ける個人は、私たちが保有している個人情報に関連してデータ主体の権利を持つ場合があります（以下に詳述）。これ自体が制限および/または制約の対象となることがあります。EEAまたは英国に居住している場合は、権利を行使するために私たちに連絡してください。<br><br>データアクセス<br>リクエストに応じて、私たちがあなたの個人情報を処理しているかどうかを確認し、そうである場合はその個人情報のコピーとその他の関連する詳細を提供します。追加のコピーが必要な場合、状況に応じて合理的な手数料を請求することがありますが、これは状況によって異なります。<br><br>個人情報処理の制限<br>データの正確性に異議を唱えたり、処理に反対したりする場合など、特定の状況下であなたの個人情報の処理を制限または「ブロック」するよう依頼することができます。処理の制限が解除される前に、これを通知します。<br>私たちがあなたの個人情報を他の人と共有している場合、可能な限り、これらの制限を通知します。リクエストがあった場合、可能であり法的に許可されている場合は、あなたの個人情報を共有した相手や共有しようとしている相手に通知し、直接連絡を取ることができるようにします。<br>拒否<br><br>次のことを要求することができます:<br>あなたの個人情報の処理をいつでも停止するよう要求することができ、それを行います。私たちが正当な利益に基づいてあなたの個人情報を処理している場合、その処理が正当な理由を持たない限り、問題にはなりません。<br>直接マーケティングの目的でのデータ処理に異議を唱え、メールによるサービス通知の受信を拒否することができます。これはメールを通じて連絡できます。<br><br>同意の撤回<br>私たちがあなたの同意に基づいて個人情報を処理している場合、いつでもその同意を撤回する権利があります。これは、同意を撤回する前にあなたのデータを処理した合法性には影響を与えません。私たちは通常、他の合法的な根拠がある場合、あなたの同意に依存しないことを強調します。私たちがあなたの同意に依存する場合、その時点でこれを明確にします。<br><br>データの閲覧および修正<br>不正確な個人情報を修正したり、不完全な場合は補完したりする権利があります。そのため、各ユーザーはプロフィール設定で自分の個人情報を閲覧、管理、更新できます。私たちがあなたの個人情報を他の人と共有している場合、可能な限り修正を通知します。リクエストがあった場合、可能であり法的に許可されている場合は、あなたが直接連絡を取れるように、個人情報を共有した相手に通知します。<br><br>データの削除<br>サービスの使用を拒否する権利があり、特定の状況では個人情報の削除または除去を要求することができます。私たちがあなたのデータを他の人と共有している場合、可能な限り修正を通知します。リクエストがあった場合、可能であり法的に許可されている場合は、あなたが直接連絡を取れるように、個人情報を共有した相手に通知します。<br><br>データの保存<br>私たちは、（1）あなたがアカウントを削除することを決定するまで、または（2）法的要件や正当なビジネス目的（例：税務、法律、会計、詐欺や悪用の防止および/またはその他の目的）のために必要な期間、あなたの個人情報を保持します。このデータは、アカウント削除後も保存されることがあります。適用される保存期間が満了した場合、適用される法律および規制に従って個人情報を安全に破棄します。一部のケースでは、個人情報を匿名化して、あなたと関連付けられなくすることができます。この場合、そのデータはもはや個人情報とは見なされません。<br><br>データの移動<br>私たちが保有している個人情報を取得する権利があります。私たちは、あなたに一般的に使用される構造化された機械で読み取れる形式で個人情報を提供します。希望する場合は、他の場所で再利用することができます。<br><br>データ保護当局への苦情の提出<br>私たちのプライバシー慣行について懸念がある場合、またはあなたの個人情報の処理方法について懸念がある場合は、欧州連合加盟国のデータ保護当局、または英国の監督機関である情報コミッショナー事務局（ICO）に報告することができます。これらの権利を行使したい場合は、私たちに連絡してください。リクエストに応じる前に、あなたの身元を確認するための追加情報を求める場合があります。<br><br>国際データ転送<br>サービスを通じて収集された情報は、上記目的のために、複数の場所にあるサーバーに、私たちのサービスプロバイダーおよび関連するビジネスによって保存されます。これは、あなたがサービスをナビゲートして使用できるようにするために必要です。データは、ビジネス運営を支援するサービスプロバイダーおよび関連業者に転送される可能性があります（上記説明済み）。<br>これらの国々では、あなたの国で提供される個人情報保護の法的基準と同等の基準を提供しない場合があります。個人情報をあなたの国以外に転送する場合、処理中に十分なレベルのセキュリティ保護を受けることができるように、必要な措置を講じます。<br>導入されたセーフガードの詳細情報を入手したい場合は、次のメールアドレスでお問い合わせください：knitbot@protonmail.com。<br><br>カリフォルニア州のユーザー固有の権利<br>カリフォルニア州の適格な居住者である場合、カリフォルニア州消費者プライバシー法（CCPA）は、個人情報の収集と使用に関する特定の権利を提供します。CCPAに基づき、次の権利があります：<br>過去12か月間に収集および使用された個人情報に関する特定の情報を公開するよう要求する権利。収集された消費者個人情報のカテゴリのリストは「収集する個人情報」セクションに記載されており、個人情報が公開される可能性がある第三者のカテゴリのリストは「個人情報をいつ共有するのか」セクションに記載されています。データ移行要求を行使するには、私たちに連絡してください。別途、私たちはあなたの個人情報を販売しません。<br>収集された個人情報の削除を要求する権利。詳細については、「ユーザーアカウントの削除」セクションを参照してください。<br>CCPAに基づく権利を行使する際に、価格およびサービスに関して差別を受けない権利。私たちは、消費者に対して個人情報を販売する見返りとして金銭的なインセンティブ、価格差別、またはサービスを提供することはありません。<br><br>連絡先情報<br>個人情報の処理に関して質問や提案がある場合は、次のメールアドレスでお問い合わせください: knitbot@protonmail.com<br>利用規約<br>簡単に言えば、私たちはKnitbot Org.（Knitbot、私たち）です。私たちはあなたの個人情報を尊重し、提供された情報の機密性を保護するために最善を尽くしています。リクエストされたサービスおよびデータを提供するために必要な場合にのみ、第三者と個人情報を共有します（詳細はプライバシーポリシーで説明）。私たちのサービスは18歳以上の個人を対象としています。<br><br>紹介<br>KnitBotへようこそ。私たちのサービスを利用することにより、次の利用規約（ユーザー契約）に同意することになります。これを注意深くお読みください。<br>規約の同意<br>サービスにアクセスまたは使用することにより、これらの利用規約に拘束されることに同意するものとします。この規約に同意しない場合は、サービスを使用しないでください。提供されるサービス<br>KnitBotは、自動取引サービスを含むさまざまな機能を無料で提供しています。これらのサービスの使用は、自己責任で行われます。自発的な寄付や紹介登録は感謝されますが、サービスの利用には必須ではありません。<br><br>利用者の義務<br>利用者は、サービスを悪用せず、適用されるすべての法律および規制を遵守することに同意します。サービスの中断や妨害を試みてはなりません。<br>責任の制限<br>KnitBotは、サービスを「現状のまま」提供し、明示的、黙示的、または法的な保証や条件なしで提供します。KnitBotは、特に所有権、商品性、特定の目的への適合性、および非侵害についての黙示的保証を明示的に否認します。<br>保証およびリスクの免責取引リスク<br>自動取引はかなりのリスクを伴います。私たちのサービスを利用することで、すべての取引決定およびそれに伴う損益に対して完全に責任を負うことを認め、同意するものとします。KnitBotは発生した取引損失について責任を負いません。<br><br>技術的問題<br>KnitBotは、サーバー通信エラー、システム障害、またはサイバー攻撃、ハッキング、その他の悪意ある活動による中断を含む、内外の原因に関するあらゆる種類の技術的問題について責任を負いません。私たちのサービスが中断なくエラーなく提供されることを保証しません。<br>サービス不一致<br>実際の使用と意図された使用との間の不一致について責任を負いません。<br>プラットフォーム機能<br>KnitBotは、ユーザーが定義した取引戦略を実行するためのプラットフォームを提供します。ユーザーは自身の取引戦略を設定する必要があり、KnitBotは単にユーザーが実行したスクリプトをAPIを通じて対応する取引所に送信します。取引戦略の設定および実行は、完全にユーザーの責任です。<br><br>賠償責任<br>サービスの利用に起因するすべての請求、要求、または損害について、KnitBotを免責し保護することに同意するものとします。これには、合理的な弁護士費用が含まれます。サービスの利用、この規約の違反、または他人の権利の侵害が含まれます。<br>プライバシーポリシー<br>プライバシーポリシーには、個人情報の取り扱い方法が記載されており、プライバシーポリシーで確認できます。私たちのサービスを利用することにより、プライバシーポリシーに記載されている個人情報の収集および使用に同意するものとします。<br><br>アカウントの解約<br>私たちは独自の裁量で、アカウントおよびサービスへのアクセスを解約または一時停止する権利を保有しており、このユーザー契約に違反する場合、またはサービスの使用が私たちまたは他のユーザーに有害であると判断した場合、またはその他の理由で解約できることがあります。<br>br>準拠法および紛争解決<br>この契約は、公平の原則に従って解釈および適用され、法的紛争の原則は考慮されません。この契約から生じる、または関連するすべての紛争は、相互に合意された仲裁機関の規則に従って、拘束力のある仲裁を通じて解決されます。<br><br>寄付および紹介登録<br>KnitBotへのすべての寄付は自発的であり、サービスへのアクセスや使用のために必要なものではありません。また、ユーザーは紹介リンクを介して取引所に登録することができ、これによりKnitBotに利益がもたらされる可能性がありますが、これもまた自発的なものです。<br><br>利用規約の変更<br>私たちは、ウェブサイトに新しいバージョンを掲載することで、利用規約を随時更新することがあります。変更が適しているかどうかを確認するために、定期的にウェブサイトを確認してください。適用される法律に基づいて必要な場合、利用規約の重要な変更が通知されることがあります。<br><br>連絡先情報<br>この利用規約に関する質問や提案がある場合は、次のメールアドレスでお問い合わせください: <br>knitbot@protonmail.com",
        "CONTEXT_1": "Privacy Policy<br>In brief: We are Knitbot org. (\"Knitbot\", \"we\", or \"us\"). We respect your privacy and work hard to protect the confidentiality of information that you give us. We will only share your personal data with third parties when it is needed for the provision of services and data you have requested (explained in detail in this privacy policy).",
        "CONTEXT_2": "About Us<br>Knitbot is the data controller responsible for your personal data and is the sole owner of the knitbot.ai website (\"Website\"), Knitbot mobile and desktop applications(soon), Knitbot services (each, a \"Service\") and all of the information collected on it. Knitbot collects information from users in several ways (explained in detail in this privacy policy).This privacy policy applies to personal data that we collect from you when you visit this Website, create an account, use our applications or services (\"you\" or \"your\" being interpreted accordingly). It provides information on what personal data we collect, why we collect personal data, how it is used, the lawful basis on which your personal data is processed, how it is stored, and how we share information.As used in this privacy policy, \"personal data\" means any information that relates to you from which you can be identified.By using our Service or submitting your personal data, you are agreeing to accept the terms of this privacy policy, so please read it carefully. If you disagree with this privacy policy at any point or time, you should stop using our Services and delete your user account.",
        "CONTEXT_3": "Updates<br>We may update this privacy policy at our discretion from time to time by posting a new version on our Website. You should check our Website occasionally to ensure any changes made are suitable for you. If required by applicable law, you will be informed of any significant changes made to the privacy policy.The current version of this privacy policy was modified on July 1, 2024.",
        "CONTEXT_4": "Personal data that we collectThere is no need to create an account when searching and viewing information from knitbot.ai, such as announcements, guides.",
        "CONTEXT_5": "Data we receive from you",
        "CONTEXT_6": "User Accounts<br>If you decide to create an account, you will need to provide us with some personal data so we can provide you with access to our additional services that users benefit from. You may also elect to provide us with additional information about you, as described below.During registration you will be required to provide us with either: your username, email address; In some cases, you may need to provide and verify your phone number. You can also add additional information about yourself in the profile settings, however, this is not mandatory. The following information will be publicly displayed: nothing The following information will not be publicly displayed: your first and last name, phone number and email.",
        "CONTEXT_7": "API data<br>Exchange API keys and related security keys and passwords are not stored on our server to protect sensitive information from server hacking attacks. They are only used on a one-time basis to run the instance.  During using automated trading service with API through website you will be required to provide(not stored at server) us: API keys and security keys issued by the exchange, and any other exchange-issued items that are required for automated trading;",
        "CONTEXT_8": "Cookies<br>We do not collect cookies.",
        "CONTEXT_9": "Log files<br>We do not collect Log files.",
        "CONTEXT_10": "Device information<br>We do not collect Device information.",
        "CONTEXT_11": "Telegram data<br>If you want to use the Telegram bot for automated trading, setting up notifications, etc, you will need to provide us with relevant information. During using automated trading service with website through Telegram, you will be required to provide us: your Telegram bot token, your Telegram chat ID; Even if you don't use Telegram, you can still use some of the features we offer through the website.",
        "CONTEXT_12": "Data we receive from third parties<br>If you use an exchange API (Binance, Bybit, Bitget, Okx;) to register an API on the website, the service will be able to see information that the exchanges you use provide to us through their respective APIs. We use it to ensure that our terms of service agreement is being adhered to. We neither control nor take any responsibility for the way third parties provide information about you and/or process your personal data.",
        "CONTEXT_13": "Contact data<br>We also process any personal data you choose to give when corresponding with us by phone, email, or otherwise visiting and interacting with this Website or any other services we operate. By providing your phone number, you agree to receive text messages from us. Message and data rates may apply. Message frequency varies. We will not share your contact phone number with any other parties unless explicitly specified by this policy.",
        "CONTEXT_14": "How personal information is used<br>We use personal data in various ways that are necessary to provide the services you intend to use, certain legitimate interests, and as a necessity in order to comply with applicable law, as further described below. We do not generally rely on your consent to allow us to process your personal data if there is another lawful ground available. If we do rely on your consent, we will make this clear to you at that time.",
        "CONTEXT_15": "Profile<br>A profile is a set of information for each individual user that details his/her viewing preferences. User settings are kept solely for the purpose of customizing the user’s experience when using the Website, applications or user accounts. We do not share private profile settings with any third parties.",
        "CONTEXT_16": "User account and profile operations<br>We use your contact details, such as username, email address, or phone number, in the following ways: to authenticate your user account, ensure its security along with the security of our services, and to prevent spam, fraud, and abuse; to acknowledge, confirm, and deal with your user account; to send all new users a welcome activation email to verify their email address;",
        "CONTEXT_17": "User account deleting<br>You may refuse to use our Website and/or application and may ask us to delete your account in the profile settings. Your account will be deleted immediately. Please note that if  your account is to be deleted, we will delete the subsequent personal data you have supplied us. Some data, such as used preferences/scripts will be saved as they have already integrated into our system. This data must be stored to maintain the integrity of the platform.",
        "CONTEXT_18": "Marketing<br>We may send you marketing emails about our products or services that are similar to the products or services you are subscribed to, including information about events and other promotions we feel may interest you. This is unless you have indicated to us that you do not wish to receive communications in this manner. Users can opt out of receiving marketing communications at any time by contacting us through the email",
        "CONTEXT_19": "Service-Related Announcements<br>On rare occasions, it may be necessary to send out service-related announcements. For instance, if our service is interrupted for a prolonged period or a major functionality upgrade is released, we might send all users an email message.",
        "CONTEXT_20": "Customer Service<br>When you contact through mail, we can service you to solve the website issue(s).",
        "CONTEXT_21": "API<br>If you are using our API (Application Programming Interface) services (such as the Advanced Charts, Trading Platform, REST API), then we may process your personal data in order to be able to provide and support those services.",
        "CONTEXT_22": "Legitimate interests<br>We will process your personal data as necessary for certain legitimate business interests, which include the following: where we are asked to respond to any of your inquiries, comments, or grievances; to administer our services in order to better understand how visitors interact with the Website and application, and ensure that they are presented in the most effective manner for you and your computer/device; to develop and improve our mobile applications; to share personal data among our affiliated businesses for administrative purposes, provide subscription services, and in relation to our sales and marketing activities, except where we require your consent, as described above; to send you information about our products or services that are similar to the products or services you subscribed to (unless you have refused or opted out of receiving these emails at the time you provided us with your email address or you have indicated to us that you do not wish to receive communications in this manner). Our legitimate interest is to ensure our marketing is relevant to you, so we may process your data to send you information on our products or services that is specifically tailored to your interests; we may anonymize, pseudonymize, aggregate and de-identify the data that we collect and use this data for our own internal business purposes, including sharing it with our business partners, our affiliated businesses, agents and other third parties for commercial, statistical and market research purposes. For example, to allow those parties to analyse patterns among groups of people and conducting research on demographics, interests, and behavior; for internal business/technical operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes, and as part of our efforts to keep our Website, network, and information systems secure; and to (a) comply with legal obligations, (b) respond to requests from competent authorities; (c) enforce our Terms of Use or House Rules; (d) protect our operations or those of any of our affiliated businesses; (e) protect our rights, safety or property, and/or that of our affiliated businesses, you or others; and (f) enforce or defend legal rights, or prevent damage. This means we can store and disclose your information to law enforcement authorities, state, or government agencies if we establish that such disclosure is necessary to comply with the law. This includes responses to court orders or subpoenas, as well as other judicial or regulatory processes. As used in this privacy policy, “legitimate interests” means the interests of Knitbot and our affiliated businesses in conducting and managing our business. When we process your personal data for our legitimate interests, we make sure to consider and balance any potential impact on you and your rights under data protection laws. Our legitimate interests do not automatically override your interests. We do not use personal data for activities where our interests override the impact they may have on our users, unless we have their explicit consent or those activities are otherwise required or permitted by law. You have the right to object to the processing of your personal data that is based on our legitimate interests at any time, on grounds relating to your particular situation (for more information on your rights, please see the User Agreement).",
        "CONTEXT_23": "When would we share personal information<br>We share your personal data with third parties in the following situations:",
        "CONTEXT_24": "Service providers: Knitbot, like many businesses, occasionally engages with selected third parties who act on our behalf to support our operations, such as (i) IT suppliers and contractors (i.e. data hosting providers or delivery partners) as necessary to provide IT support and enable us to provide subscription services and other goods/services available on this Website or to users, (ii) web and mobile analytics providers, (iii) providers of digital advertising services, and (iv) providers of marketing and sales software solutions. Pursuant to our instructions, these parties may access, process or store your personal data in the course of performing their duties to us and solely in order to perform the services we have hired them to provide.",
        "CONTEXT_25": "Knitbot affiliated businesses: In order to provide the services you request from us, our affiliated businesses may access and process the information which we collect from you for the purposes described above, including offering products and services to you. Our affiliated businesses will only use your data for the purposes for which we originally collected said data.",
        "CONTEXT_26": "Analytics providers: We may use third-party service providers to monitor and analyze the use of our services and mobile/desktop applications. We use this information to analyze and improve the work of our services and mobile applications.",
        "CONTEXT_27": "We may use Google Analytics as a web analytics service on the Website, mobile apps and in conjunction with the widgets we provide. For more information on Google Analytics privacy practices, you can check here. Analytics services for mobile and desktop applications that we may use:",
        "CONTEXT_28": "Firebase — a development and analytics platform provided by Google. For more information on what type of information is collected, please visit the Firebase web page. Flurry Analytics — provides us with tools and resources for understanding our mobile application users’ behavior. For more information on the handling of user data on Flurry Analytics, please see their Privacy Policy. Visual Studio App Center — owned by Microsoft. Their applicable data protection provisions can be reviewed under the Microsoft Privacy Statement. AppsFlyer — analytics services to measure and analyze the effectiveness of our marketing and advertising campaigns, as well as certain events and actions in the application. For more information on how AppsFlyer works and what data it collects, please see AppsFlyer Services Privacy Policy. Sentry — is an error tracking and performance monitoring platform that helps us diagnose, fix, and optimize the performance of our platform. For more information on what data collected by Sentry, please see Sentry Privacy Policy.",
        "CONTEXT_29": "Business transfers: If we sell our business or our company assets are acquired by a third party, personal data held by us about our general account users, subscription account users or customers may be one of the transferred assets.",
        "CONTEXT_30": "Administrative and legal reasons: If we need to disclose your personal data (i) to comply with a legal obligation and/or judicial or regulatory proceedings, a court order or other legal process, (ii) to enforce our Terms of Use, House Rules or other applicable contract terms that you are subject to, or (iii) to protect us or our contractors against loss or damage. This may include, but is not limited to, exchanging information with the police, courts or law enforcement organisations.",
        "CONTEXT_31": "Advertising: We display advertising on the Website and may use remarketing and tracking features. Remarketing features allow us to display advertising in a more targeted manner in order to present advertisements of interest to users, based on their activity on other websites. Tracking features allow us to collect information about impressions, ad clicks and certain actions that users complete through our Website. This data also helps us evaluate the performance of ad campaigns. Note that we collect pseudonymous data only. We may use the following services for advertising, remarketing, and tracking purposes:",
        "CONTEXT_32": "Google Ad Manager and Google Ads — they help us serve and measure the success of ads on our site. For more information about how Google uses data, please refer to their Privacy & Terms document as well as Google’s Privacy Policy. You can opt out of this by visiting the Network Advertising Initiative opt-out page or by turning off the personalization of Google ads via their Ad Settings page.",
        "CONTEXT_33": "Meta pixel — allows us to measure, optimise, and build audiences for our advertising campaigns. You can learn more about Meta’s data policy here. You can manage your personal settings for advertisements on Facebook at Your Ad Preferences. In case you don’t have a Facebook account, you can use Your Online Choices website or DAA's WebChoices Tool to manage your ad experience.",
        "CONTEXT_34": "Twitter Conversion Tracking (Twitter Pixel) — helps us to measure our return on ad expenditure. For more information about Twitter data processing, please see their Privacy policy. You can adjust the settings in your personal Twitter profile and opt to receive advertising. In case you don’t have a Twitter account, you can use Your Online Choices website or DAA's WebChoices Tool to manage your ad experience.",
        "CONTEXT_35": "Note that we do not share any personal information with our advertisers. They can only access general statistics that include the amount of impressions their ads have generated as well as clicks.",
        "CONTEXT_36": "Google reCAPTCHA: We use reCAPTCHA to check whether data has been entered by a person or by an automated program. We use this service to protect our services from spam, fraud and abuse. reCAPTCHA analyses the behavior of the visitor using various characteristics and evaluates various information for analysis purposes (e.g. IP address, visit duration, or the user’s mouse clicks). This analysis begins automatically, as soon as the website visitor accesses the website, and runs in the background. Visitors are not informed that an analysis is being performed. The data recorded during analysis is forwarded to Google. More information on Google reCAPTCHA and the Google Privacy Policy can be found under the following links: Google’s Privacy Policy and What is reCAPTCHA?.",
        "CONTEXT_37": "YouTube API Services: We use YouTube API to share your chosen video ideas and video streams to your YouTube account. When you use this service, you will need to sign in with your Google account and grant us permission to access your YouTube account. We will only use this access to upload videos that you choose to share with us. We will not store, modify, delete, or view any other data from your YouTube account. We will also not share your Google account information with any third parties. You can revoke our access to your YouTube account at any time by visiting Google security settings page. By using this service you are agreeing to be bound by the YouTube Terms of Service.",
        "CONTEXT_38": "Public information on our site<br>Public Profile<br>There is no profile that is publicly visible to others.<br>Public content<br>There is no content that is publicly visible to others.",
        "CONTEXT_39": "Security of personal data<br>We use technical and organizational safeguards to protect your personal data and require third parties with whom we work to do the same. We employ various encryption technologies to protect certain information that you submit to us. This helps protect your information from being intercepted by anyone while it is being transmitted. We work hard to ensure that our Service is secure and that we meet industry standards. We also use other safeguards, such as firewalls, authentication systems (e.g., passwords, identifications), and access control mechanisms to control unauthorized access to systems and data. If you have chosen to create an account, you are responsible for doing everything you reasonably can to keep your access details secret. You must not share these details with anyone else. We also do our best to protect user information offline. All of our users' personal information is restricted to our offices. Only employees who need to see the information to perform their jobs are allowed to access it. The servers that store personal data are located in a secure environment in a locked facility. We are constantly improving the ways we secure, store, and process the data we collect, including the addition of physical security measures that help us counter unauthorized access to our systems. However, no method of electronic transmission or storage is 100% secure. Therefore, we cannot guarantee its absolute security.",
        "CONTEXT_40": "Children and sensitive personal data<br>This Website is not directed towards children who are under the age of 18. We do not knowingly contact or collect personal information from children below the age of 18 years, or sensitive personal data (\"racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or a natural person’s sex life or sexual orientation,\" etc.). Please consult Art. 9 GDPR for more information. If you believe we have inadvertently collected such information, please contact us immediately so that we can either obtain special consent or delete the information.",
        "CONTEXT_41": "Third Party Sites<br>Links to other sites<br>At our discretion we may add links (web links) to other websites from our Website. These websites can be run by third parties with separate and independent privacy policies. We, therefore, have no responsibility nor are we liable for any content, activities or privacy policies of these linked sites. We suggest you read the privacy policy of each and every site that you visit.",
        "CONTEXT_42": "EEA and UK users' specific rights<br>Individuals subject to European and United Kingdom (\"UK\") data protection laws may have data subject rights in relation to the personal data we hold on them (described in detail below). This may, in and of itself, be subject to limitations and/or restrictions. If you are located in the EEA or UK, please contact us to exercise your rights.",
        "CONTEXT_43": "Accessing data<br>If prompted, we will confirm whether or not we are processing your personal data and if so, we will provide you with a copy of that personal data along with any other pertinent details. If you require additional copies, we may need to charge a reasonable fee, but this can be discussed and depends on the situation.",
        "CONTEXT_44": "Restricting the processing of personal data<br>You may ask us to restrict or ‘block’ the processing of your personal data in certain circumstances, for example, if you contest the accuracy of the data or object to us processing it. We will notify you before we lift any restriction on processing. If we share your personal data with others, we will notify them of the restriction wherever possible. If prompted, and if it is possible and lawful to do so, we will also notify you with whom we have shared or will share your personal data so you can contact them directly.",
        "CONTEXT_45": "Objections<br>You may:<br>ask us to stop processing your personal data at any time, and we will do so. If we are relying on a legitimate interest to process your personal data, then it should not be a problem unless we demonstrate compelling legitimate grounds for processing; object to our processing of your data for the purposes of direct marketing at any time. and refuse to receive service notifications via email. This can be contact through email",
        "CONTEXT_46": "Withdrawal of consent<br>If we rely on your consent to process your personal data, you have the right to withdraw that consent at any time. This will not affect the lawfulness with which we process your data before receiving notice of your wish to withdraw your consent. We emphasize that we do not generally rely on your consent to allow us to process your personal data if there is another lawful ground available. If we do rely on your consent, we will make this clear to you at that time.",
        "CONTEXT_47": "Viewing and correcting data<br>You have the right to have inaccurate personal data rectified or completed if it is incomplete. In order to do so, each user can view, manage and/or update his/her personal data in the Profile settings. If we share your personal data with others, we will notify them of any corrections made whenever possible. If prompted, and where possible and lawful to do so, we will also notify you with whom we have shared your personal data so you can contact them directly if need be.",
        "CONTEXT_48": "Deleting data<br>You have the right to refuse to use our Services and may ask us to delete or remove your personal data in certain circumstances. If we share your data with others, we will notify them of the edits wherever possible. If prompted, and wherever possible and lawful to do so, we will also notify you with whom we have shared your personal data so you can contact them directly if need be.",
        "CONTEXT_49": "Data retention<br>We will keep your personal data (1) until you decide to delete your account (upon request), or (2) as required by law or as necessary for legitimate business purposes (i.e. for tax, legal, accounting, fraud, or abuse prevention, and/or other purposes). This data can be stored even after an account is deleted. Upon expiration of the applicable retention period, we will securely destroy your personal data in accordance with applicable laws and regulations. In some circumstances we may anonymize your personal data so that it can no longer be associated with you. In this case, such data is no longer considered personal.",
        "CONTEXT_50": "Data portability<br>You have the right to obtain your personal data from us, which you consented to give us or that was provided to us as necessary in connection with our contract with you. We will give you your personal data in a structured, commonly used, and machine-readable format. You may reuse it elsewhere if you so wish.",
        "CONTEXT_51": "Lodge a complaint with the data protection authority<br>If you have concerns about our privacy practices, including the way we handle or have your personal data, you can report it to any competent data protection authority of an European Union member state that is authorised to hear such concerns (you may find European Union Data Protection Authorities’ contact information here) or to the Information Commissioner's Office (ICO), the UK supervisory authority for data protection issues. If you wish to exercise any of these rights, please contact us. Note that we may need to ask you for further information to verify your identity before we can respond to any request.",
        "CONTEXT_52": "International data transfers<br>Information collected through Services will be stored on servers located in various locations by our service providers and affiliated businesses for the purposes described above. This is necessary to enable you to navigate and use our Services. The data may be transmitted to our service providers and affiliates supporting our business operations (described above). Note that the countries concerned may not provide the same legal standards for protection of your personal data that you have in your country. If we transfer your personal data to countries outside of your country, we will take the necessary steps to ensure your information receives an adequate level of security protection where it is processed and that your rights continue to be protected. If you would like to receive more information on the safeguards that we implement, please contact us via email at: knitbot@protonmail.com",
        "CONTEXT_53": "California users' specific rights<br>If you are an eligible California resident, the California Consumer Privacy Act (\"CCPA\") provides you with specific rights with respect to our collection and use of your personal information. You have the following rights under the CCPA: Right to request that we disclose certain information to you about our collection and use of your personal information over the past 12 months. The list of categories of personal information collected and disclosed about consumers are enlisted in the section 'Personal data that we collect' and the list of categories of third parties to whom the personal information may be disclosed are enlisted in the section 'When would we share personal information'. Please contact us to exercise a data portability request. Separately, we do not sell your personal information. Right to request delete personal information we have collected from you. Please see the “User account deleting” section for more details. Right not to be discriminated against regarding pricing and services as you exercise any of your rights under the CCPA. We do not offer consumers financial incentives, price differentials, or services in exchange for selling a consumer's personal information.",
        "CONTEXT_54": "Contact information<br>If you have any questions or suggestions regarding personal data processing, please contact us via email at: knitbot@protonmail.com"
    },
    "UA": {
        "CONTEXT_1": "User Agreement",
        "CONTEXT_2": "In brief: We are Knitbot Org. (\"Knitbot,\" \"we,\" or \"us\"). We respect your privacy and work hard to protect the confidentiality of information that you give us. We will only share your personal data with third parties when it is needed for the provision of services and data you have requested (explained in detail in ‘privacy policy’). Our services are intended for use by individuals who are 18 years of age or older.",
        "CONTEXT_3": "Introduction",
        "CONTEXT_4": "Welcome to KnitBot. By using our services, you agree to the following terms and conditions (\"User Agreement\"). Please read them carefully.",
        "CONTEXT_5": "Acceptance of Terms",
        "CONTEXT_6": "By accessing or using our services, you agree to be bound by this User Agreement. If you do not agree to these terms, please do not use our services.",
        "CONTEXT_7": "Services Provided",
        "CONTEXT_8": "KnitBot offers various features, including but not limited to automated trading services, all provided free of charge. The use of these services is at your own risk. Voluntary donations and referrals are appreciated but not required for the use of our services.",
        "CONTEXT_9": "User Obligations",
        "CONTEXT_10": "Users agree not to misuse our services and to comply with all applicable laws and regulations. Users must not attempt to disrupt or interfere with the services.",
        "CONTEXT_11": "Limitation of Liability",
        "CONTEXT_12": "KnitBot provides its services \"as is\" and without any warranty or condition, express, implied, or statutory. KnitBot specifically disclaims any implied warranties of title, merchantability, fitness for a particular purpose, and non-infringement.",
        "CONTEXT_13": "Disclaimer of Warranties and Risks",
        "CONTEXT_14": "Trading Risks",
        "CONTEXT_15": "Automated trading involves significant risk. By using our services, you acknowledge and agree that you are fully responsible for any trading decisions you make and the resulting losses or gains. KnitBot assumes no responsibility for any trading losses incurred.",
        "CONTEXT_16": "Technical Issues",
        "CONTEXT_17": "KnitBot is not responsible for any technical issues, including but not limited to server communication errors, system failures, or any disruptions caused by cyber-attacks, hacks, or other malicious activities. We do not guarantee that our services will be uninterrupted or error-free.",
        "CONTEXT_18": "Service Discrepancies",
        "CONTEXT_19": "We are not responsible for any discrepancies between your actual usage and the intended usage of our services.",
        "CONTEXT_20": "Platform Functionality",
        "CONTEXT_21": "KnitBot provides a platform for executing user-defined trading strategies. Users must set up their own trading strategies, and KnitBot simply transmits the user-executed scripts to the respective exchanges via API. The setup and execution of trading strategies are entirely the user's responsibility.",
        "CONTEXT_22": "Indemnity",
        "CONTEXT_23": "You agree to indemnify and hold KnitBot harmless from any claims, demands, or damages, including reasonable attorney's fees, arising out of your use of our services, your violation of this agreement, or your violation of any rights of another.",
        "CONTEXT_24": "Privacy Policy",
        "CONTEXT_25": "Our privacy policy, which sets out how we handle your personal information, can be found at Privacy Policy. By using our services, you consent to our collection and use of personal data as outlined in the privacy policy.",
        "CONTEXT_26": "Termination",
        "CONTEXT_27": "We reserve the right to terminate or suspend your account and access to our services at our sole discretion, without notice, for conduct that we believe violates this User Agreement or is harmful to other users of our services, us, or third parties, or for any other reason.",
        "CONTEXT_28": "Governing Law and Dispute Resolution",
        "CONTEXT_29": "This agreement shall be governed by and construed in accordance with the principles of fairness and without regard to conflicts of law principles. Any disputes arising out of or relating to this agreement shall be resolved through binding arbitration in accordance with the rules of a mutually agreed-upon arbitration organization.",
        "CONTEXT_30": "Donations and Referrals",
        "CONTEXT_31": "All donations to KnitBot are voluntary and are not required to access or use our services. Additionally, users may choose to sign up for exchanges using our referral links, which may benefit KnitBot, but this is also entirely voluntary.",
        "CONTEXT_32": "Changes to the User Agreement",
        "CONTEXT_33": "We may update this User Agreement from time to time by posting a new version on our website. You should check our website occasionally to ensure any changes made are suitable for you. If required by applicable law, you will be informed of any significant changes made to the User Agreement.",
        "CONTEXT_34": "Contact information",
        "CONTEXT_35": "If you have any questions or suggestions regarding this User Agreement, please contact us at: knitbot@protonmail.com"
    }
}