{
    "HELLO": "こんにちは",
    "KNIT_BOT": "knitbot.ai",

    "COM": {
        "SET_API": "API設定",
        "SET_TELE": "テレグラム設定",
        "CHG_LAN": "言語変更",
        "CHG_DARK_MODE": "ダークモードに切り替え",
        "CHG_LIGHT_MODE": "ライトモードに切り替え",
        "LOGOUT": "ログアウト",
        "BOT_STATUS": "現在のボットの状態",
        "STOP": "停止",
        "OPERATING": "作動中",
        "EXIT": "非常口",
        "NOTICE": "お知らせ",
        "HOW_TO_USE": "Guide",
        "OFFICIAL_TELEGRAM": "KnitBot公式テレグラム",
        "CHEER_TO_OFFICIAL": "取引所の登録でサポート",
        "DONATE_CREATOR": "開発者に寄付する",
        "ADDRESS": "住所",
        "BANNER": "Banner",
        "HOME_NOTICE": "KnitBotは無料で提供されており、リファラル登録は必要ありません。<br>現在、サーバー費用は広告と寄付で維持されています。温かいご支援で開発者の空腹を満たしてください。AdBlockをオフにしていただければ、開発者にとって大きな力になります。"
    },
    "AUTO": {
        "SETTING_INDICATOR": "Setting Indicator",
        "SET_AUTO_SALE": "自動取引設定",
        "SELECT_INDICATOR1": "指標選択1",
        "SELECT_INDICATOR2": "指標選択2",
        "PERIOD": "期間",
        "STANDARD_DEVIATION": "標準偏差",
        "RETRACEMENT": "標準偏差",
        "ATR_LENGTH": "ATRの期間",
        "INITIAL_ACCELERATION": "初期加速要素",
        "INCREMENT": "加速増加量",
        "MAXIMUM": "最大加速要素",
        "SMOOTHING": "スムージング",
        "RSI_LENGTH": "RSI期間",
        "STOCHASTIC_PERIOD": "ストキャスティクス期間",
        "MOVE_AVERAGE": "移動平均線",
        "FIBONACCI_RETRACEMENT": "フィボナッチリトレースメント",
        "SURPASSED_UPPER_LINE": "上部ライン突破",
        "DROPPED_BELOW_UPPER_LINE": "上部ライン下回る",
        "SURPASSED_LOWER_LINE": "下部ライン突破",
        "DROPPED_BELOW_LOWER_LINE": "下部ライン下回る",
        "HIGH_CURRENT_PRICE": "現在価格が高い場合",
        "LOW_CURRENT_PRICE": "現在価格が低い場合",
        "SURPASSED_RATIO": "比率を上回る",
        "DROPPED_BELOW_RATIO": "比率を下回る",
        "SURPASSED_SIGNAL": "シグナル上回る",
        "DROPPED_BELOW_SIGNAL": "シグナル下回る",
        "HIGH_CONSTANT": "定数より大きい場合",
        "LOW_CONSTANT": "定数より小さい場合",
        "HIGHER_K": "%Kが定数より大きい場合",
        "LOWER_K": "%Kが定数より小さい場合",
        "CROSS_K_DOWN": "%Kが下にクロスする場合",
        "CROSS_K_UP": "%Kが上にクロスする場合",
        "LONG_SIGNAL": "ロングシグナル",
        "SHORT_SIGNAL": "ショートシグナル",
        "NONE": "該当なし",
        "CANDLE": "キャンドル",
        "THAN_INDICATOR_1": "指標1に対して",
        "THAN_INDICATOR_2": "指標2に対して",
        "CONSTANT": "定数",
        "BOT_ACTION": "ボットの動作",
        "OPEN": "エントリー",
        "CLOSE": "終了",
        "ADD_LONG_SETTING": "ロング設定追加",
        "ADD_SHORT_SETTING": "ショート設定追加",
        "REMOVE_LONG_SETTING": "ロング設定を削除",
        "REMOVE_SHORT_SETTING": "ショート設定を削除",
        "REVERSE_POSITION_EXIT": "逆ポジションにエントリー時、前のポジションを終了",
        "SHORT_SETTINGS": "ショート設定",
        "LONG_SETTINGS": "ロング設定",
        "TRADE_LAST": "終値",
        "TRADE_OPEN": "始値",
        "TRADE_HIGH": "高値",
        "TRADE_LOW": "安値",
        "SHORT_TERM": "短期移動平均",
        "LONG_TERM": "長期移動平均",
        "MAXIMUM_ACCEL_ELEMENT": "最大加速要素",
        "SIGNAL": "シグナル",
        "RSI_PERIOD": "RSI期間"
    },
    "DEFAULT" : {
        "DEFAULT_SETTING": "基本設定",
        "RESET": "初期化",
        "MODES": "取引種類",
        "FUTURES": "先物 (Futures)",
        "SYMBOLS": "取引シンボル選択",
        "CANDLE_SETTING": "キャンドル設定",
        "1M": "1M",
        "3M": "3M",
        "5M": "5M",
        "15M": "15M",
        "30M": "30M",
        "1H": "1H",
        "4H": "4H",
        "1D": "1D",
        "QUANITITY": "数量",
        "TELEGRAM_INFO": "テレグラム情報",
        "TELEGRAM_KEY": "Bot Token",
        "CONNECT_STATUS": "連携状態",
        "CONNECTED": "連携済み",
        "DISCONNECTED": "未連携",
        "BOT_CONTROL_STATUS": "ボット制御の有無",
        "ON": "オン",
        "OFF": "オフ",
        "TRADE_TYPE": "取引タイプ",
        "ENTER_QUANTITY": "数量入力"
    },
    "USE": {
        "HOW_TO_USE": "使用方法",
        "DISCLAIMER": "免責事項",
        "DISCLAIMER_TXT": "KnitBot（「Knitbot」、「私たち」）は、すべての機能を無料で提供しています。ただし、設定した自動取引は完全にご自身の責任で行っていただきますようお願いいたします。サーバー通信やシステムエラーなど、技術的な問題が発生する可能性があり、KnitBotはその責任を負いません。また、使用方法が実際と異なる場合にも責任を負いかねます。本サイトのすべての機能に関して、KnitBotは一切の責任を負いませんので、これを理解した上で、利用するかどうかを慎重にご判断ください。",
        "SET_API": "API設定",
        "SET_API_TXT1": "「1. 取引所を選択してください。 ",
        "SET_API_TXT2": "2. 取引所から発行されたAPIキーを入力してください。取引所ごとのAPI発行方法については以下を参照してください。",
        "SET_API_TXT3": "3. 取引所から発行されたAPIパスワード（Secret Key）を入力してください。取引所によって用語が若干異なる場合があるのでご注意ください。",
        "SET_API_TXT4": "4. 取引所から発行されたAPIパスフレーズを入力してください。この入力欄はBitget取引所を選択した場合に表示され、他の取引所では必要ない場合があります。」",
        "BITGET_USE": "Bitget取引所API発行方法",
        "BITGET_USE_TXT1": "「Bitgetのホームページにログインし（1）、右上のプロフィールをクリックします（2）。API管理をクリックしてください。」",
        "BITGET_USE_TXT2": "「新しいAPIを作成をクリックしてください。」",
        "BITGET_USE_TXT3": "「1. API名を英語で自由に入力してください。",
        "BITGET_USE_TXT4": "2. 数字のパスワードを作成してください。8〜32桁が可能です。 ",
        "BITGET_USE_TXT5": "3. Read-only のみチェックしてください。",
        "BITGET_USE_TXT6": "4. 認証を行い（4〜5）、Next をクリックして表示されたすべての部分をコピーし、安全に保管してください。」",
        "TELEGRAM_SETTING": "テレグラム設定",
        "TELEGRAM_SETTING_TXT1": "「1. 作成したボットのトークンを入力してください。 例）1234567890",
        "TELEGRAM_SETTING_TXT2": "2. 自分のチャットIDを入力すると、さまざまな機能が利用できます。（オプション）",
        "TELEGRAM_SETTING_TXT3": "3. ボットがエントリーまたは終了する際に通知を受け取ることができます。",
        "TELEGRAM_SETTING_TXT4": "4. テレグラムボットを使用してテレグラム内でボットを制御する機能です。」",
        "AUTO_SALE_SETTING": "自動取引設定（インジケーター選択）",
        "AUTO_SALE_SETTING_TXT": "「自動取引に使用するインジケーターを選択します。<br><br>インジケーター1は必ず選択し、選択したインジケーターに必要なパラメーターを手動で調整できます。<br><br>インジケーター2はオプションです。インジケーター1とインジケーター2を両方使用する場合、設定したアクションはインジケーター1とインジケーター2の両方が満たされたときにのみ作動します。<br>（「AND」条件で結びつけられます。）」",
        "BOT_ACTION_SETTING": "ボットアクション設定",
        "BOT_ACTION_SETTING_TXT": "「ボットアクションを設定できます。<br><br>「キャンドル」は選択したシンボルの現在の価格を意味します。<br>終値、始値、高値、安値を選択でき、基本設定で設定されたキャンドルの時間帯に基づきます。基本的には終値を推奨します。<br><br>上記で設定したインジケーター1に対して、価格の状況や定数に対するインジケーターの状況に基づいてボットアクションを設定できます。<br><br>ボットの動作に関しては、設定した状況が発生したときに、ボットがエントリーするか、終了するかを設定できます。<br><br>ロング（ショート）設定を追加することで、ボットがエントリーする場合と終了する場合をそれぞれ設定できます。エントリーと終了のどちらか一方でも設定されていないと、自動取引はできません。<br><br><span>つまり、各設定を少なくとも2つ以上行う必要があり、条件間での衝突が発生してはいけません！</span><br><br> ロング設定とショート設定の条件が衝突した場合、ボットは作動しません！<br><br> 例えば、EMA（インジケーター1）線の下に下がったときにロングをエントリーしたい場合、インジケーター1に対して「キャンドル値が小さいとき」にボットの動作を「エントリー」と設定します。<br>逆に、EMA（インジケーター1）線の上に上がったときにショートをエントリーしたい場合、インジケーター1に対して「キャンドル値が大きいとき」にボットの動作を「エントリー」と設定します。」<br>",
        "REVERSE": "逆転",
        "REVERSE_TXT": "「ボットが逆ポジションにエントリーする際に、以前のポジションを自動的に終了する機能です。<br>たとえば、以前にボットがロングをエントリーした場合、ロング終了の条件がまだ満たされていない状態でショートエントリーの条件が満たされた場合、既存のロングポジションを終了し、ショートポジションのみをエントリーします。」",
        "DEFAULT_SETTING": "基本設定",
        "DEFAULT_SETTING_TXT": "「取引の種類を選択できます。<br>現在、取引の種類は先物取引（Futures）のみサポートしています。<br><br>取引シンボルの選択では、ボットが取引するシンボルを選択できます。<br><br>キャンドル設定では、自動取引のインジケーターやボットアクションの条件を判断する際の基準となる時間帯を設定します。<span>設定されるキャンドル時間帯によって、特定のインジケーターや条件が変化するため、注意して設定する必要があります。</span><br><br>数量は選択した取引シンボルを自動取引する際に使われる数量を意味します。<br><br><span>このときの数量は選択されたコインの数量であり、USDTではないため、数量は必ずコインの数量を基準に設定する必要があります！</span>」",
        "BOT_ACTING": "ボットの起動と停止",
        "BOT_ACTING_TXT ": "リモコンの右側のアイコンでボットをオン/オフできます。",
        "SAVE": "実行",
        "SAVE_TXT": "「すべての設定が完了したら、ボットを実行する前に保存する必要があります。<br>保存しないと、ボットが実行されなかったり、設定が反映されなかったりするなどのエラーが発生する可能性があるため、必ず保存してください。」",
        "BESIDE": "その他",
        "BESIDE_TXT": "その他の事項については、KnitBot公式テレグラムグループでお問い合わせください。"
    },
    "API": {
        "API_SETTING": "API設定",
        "SELECT_TRADE": "取引所の選択",
        "API_KEY": "API Key",
        "API_SECRET_KEY": "API Secret Key",
        "API_PASSPHRASE": "API Passphrase",
        "API_KEY_TXT": "APIキーを入力してください",
        "API_SECRET_KEY_TXT": "APIセキュリティキーを入力してください",
        "API_PASSPHRASE_TXT": "APIパスフレーズを入力してください",
        "API_SETTING_NOTICE": "この無料サービスを利用することにより、インディケーターの不正確さ、技術的な障害、サーバーのダウン、サービスの中断、または当社の管理外の外的要因によって生じた損失、損害、請求について、KnitBotが責任を負わないことを認め、同意するものとします。すべてのツールおよびデータは「現状のまま」提供され、サービス利用中に行われたすべての決定についての責任はお客様にあります。KnitBotは、本サービスの使用により生じる損失や損害に関して、その原因に関わらず一切の責任を負いません。詳しくは、利用規約をご確認ください。",
        "API_NOTICE_TXT": "APIを忘れないでください！KnitBotはあなたのAPIデータを保存しません！"
    },
    "TELEGRAM": {
        "TELEGRAM_SETTING": "テレグラム設定",
        "TELEGRAM_KEY": "Bot Token",
        "TELEGRAM_KEY_TXT": "ボットトークンを入力してください",
        "CHAT_ID": "Chat id（任意）",
        "CHAT_ID_TXT": "チャットIDを入力してください（任意）",
        "OTHER_SETTING": "その他の設定",
        "BOT_CONTROL_YN": "テレグラムでのボット制御を許可",
        "TELEGRAM_SAVE": "保存",
        "FAIL_SAVE": "テレグラム情報の保存に失敗しました。IDを再確認してください。"
    },
    "MEMBER": {
        "MEMBER_INFO": "会員情報",
        "PROFILE_IMAGE_CHANGE": "プロフィール画像の変更",
        "PW_CHANGE": "パスワードの変更",
        "MEMBER_WITHDRAWAL": "退会",
        "PW_RESETTING": "パスワードリセット",
        "EMAIL": "メールアドレス",
        "INPUT_EMAIL": "メールアドレスを入力",
        "CERTIFY": "認証する",
        "CONFIRM": "確認",
        "PASSWORD": "パスワード",
        "PASSWORD_CHECK": "パスワード再入力",
        "PASSWORD_TXT": "8-32文字、大文字・数字・特殊文字を含む",
        "INPUT_PASSWORD": "パスワード入力",
        "CHANGE": "変更する",
        "LOGIN": "ログイン",
        "SAVE_EMAIL": "メールアドレスを保存",
        "FIND_PW": "パスワードを忘れた場合",
        "LOGIN_ERROR": "メールアドレスまたはパスワードが一致しません",
        "PW_RULE": "8-32文字、大文字・数字・特殊文字を含む 必要",
        "SIGNIN": "会員登録",
        "SIGNIN_TXT_1": "続行して会員登録を完了することで、あなたは当サイトの",
        "SIGNIN_TXT_2": "に同意し",
        "SIGNIN_TXT_3": "を理解したことを認めます。",
        "CONFIRM_SIGNIN": "会員登録完了",
        "TERMS": "利用規約",
        "PERSONAL_INFO": "プライバシーポリシー",
        "IMAGE_CHANGE": "画像を変更",
        "REQUIRE_EMAIL": "メールアドレスを入力してください。",
        "INVALID_EMAIL_RULE": "有効なメールアドレスを入力してください。",
        "REQUIRE_PASSWORD": "パスワードを入力してください。(8~32文字、大文字・数字・特殊文字を含む(@, $, !, %, *, ?, &, ^))",
        "INVALID_PASSWORD": "有効なパスワード形式を入力してください。(8~32文字、大文字・数字・特殊文字を含む(@, $, !, %, *, ?, &, ^))",
        "REQUIRE_PASSWORD_CHECK": "パスワードを確認してください。(8~32文字、大文字・数字・特殊文字を含む(@, $, !, %, *, ?, &, ^))",
        "ERROR_PASSWORD": "パスワードが一致しません。",
        "CAPTCHA_INPUT": "Captchaを入力してください。",
        "CAPTCHA_HOLDER": "認証メールを確認し、Captcha入力"
    },
    "TOAST": {
        "NEED_LOGIN": "このサービスを利用するにはログインが必要です。",
        "OK_LOGIN": "ログインに成功しました。",
        "OK_LOGOUT": "ログアウトに成功しました。",
        "OK_SIGNIN": "会員登録が完了しました。",
        "OK_SAVE": "保存されました。",
        "OK_UNREGISTE": "退会が完了しました。",
        "OK_RESET": "リセットされました。",
        "OK_PW_CHANGE": "パスワードの変更に成功しました。",
        "OK_OPERATE_BOT": "ボットが実行されています。",
        "OK_SAVE_INSTANCE": "インスタンスが保存されました。",
        "OK_OPERATE_INSTANCE": "インスタンスの起動に成功しました。",
        "OK_SAVE_TELEGRAM": "テレグラム情報が保存されました。",
        "OK_CHANGE_LANGUAGE": "言語が変更されました。",
        "FAIL_SAVE": "保存に失敗しました。",
        "FAIL_PW_CHANGE": "パスワードの変更に失敗しました。",
        "FAIL_SIGNIN": "会員登録に失敗しました。",
        "FAIL_SAVE_INSTANCE": "インスタンスの保存に失敗しました。",
        "FAIL_OPERATE_INSTANCE": "インスタンスの起動に失敗しました。",
        "FAIL_OPERATE_BOT": "ボットの起動に失敗しました。",
        "FAIL_COPY_TEXT": "コピー中にエラーが発生しました。",
        "OK_BOT_STOP": "ボットの動作を停止しました。",
        "FAIL_BOT_STOP": "停止に失敗しました。",
        "OK_COPY_TEXT": "コピー完了",
        "FAIL_UNREGISTE": "탈퇴에 실패했습니다."
    },
    "LAYOUT": {
        "AUTO": "取引",
        "DEFAULT": "設定",
        "USE": "ヘルプ",
        "TELEGRAM": "Telegram",
        "NOTICE": "通知"
    },
    "PP": {
        "CONTEXT": "プライバシーポリシー<br>簡単に言うと: 私たちはKnitbot Org.(「Knitbot」、「我々」)です。私たちはお客様のプライバシーを尊重し、お客様が提供する情報の機密性を保護するために最善を尽くします。お客様が依頼されたサービスおよびデータを提供するために必要な場合にのみ、第三者とお客様の個人情報を共有します(このプライバシーポリシーに詳細を記載しています)。<br>紹介<br>Knitbotは、お客様の個人情報を管理するデータコントローラーとして、knitbot.aiウェブサイト(「ウェブサイト」)、Knitbotモバイルおよびデスクトップアプリケーション(近日公開予定)、Knitbotサービス(各「サービス」)の唯一の所有者です。Knitbotは、ユーザーからさまざまな方法で情報を収集します(このプライバシーポリシーで詳しく説明しています)。このプライバシーポリシーは、お客様がウェブサイトを訪問する際、アカウントを作成する際、またはアプリケーションやサービスを使用する際に、お客様から収集した個人情報に適用されます(「お客様」「お客様の」は、それに応じて解釈されます)。このポリシーでは、当社がどのような個人情報を収集し、なぜ収集するのか、どのように使用するのか、お客様の個人情報が処理される法的根拠、保存方法、情報共有方法について説明します。このプライバシーポリシーで使用される「個人情報」とは、お客様を識別できる情報に関連するすべての情報を意味します。当社のサービスを使用するか、個人情報を提出することにより、お客様はこのプライバシーポリシーの条件を受け入れることに同意したことになります。したがって、これを注意深くお読みください。このプライバシーポリシーに同意しない場合は、いつでもサービスを停止し、ユーザーアカウントを削除する必要があります。<br>更新<br>私たちは、ウェブサイトに新しいバージョンを掲載することで、このプライバシーポリシーを随時更新することができます。変更がご自身に適しているかどうかを確認するため、時折ウェブサイトを確認することをお勧めします。適用される法律に基づき、必要に応じて、プライバシーポリシーに対する重要な変更が通知される場合があります。このプライバシーポリシーの現在のバージョンは、2024年10月31日に修正されました。<br>収集する個人情報<br>Knitbot.aiでお知らせやガイドなどの情報を検索または閲覧する際に、アカウントを作成する必要はありません。<br>お客様から受け取るデータ<br>ユーザーアカウント<br>アカウントを作成することを決定した場合、追加のサービスにアクセスできるようにするために、いくつかの個人情報を提供する必要があります。以下に説明するように、お客様に関する追加情報を提供することもできます。 <br>登録中には次の情報を提供する必要があります:<br>ユーザー名、メールアドレス;<br>場合によっては、電話番号を提供し、確認する必要があります。 プロフィール設定で追加情報を入力することができますが、これは必須ではありません。<br>以下の情報が公開されます:<br>なし;<br>次の情報は公開されません:<br>お客様の名前、姓、電話番号、メールアドレス;<br>APIデータ<br>交換APIキーおよび関連するセキュリティキーとパスワードは、サーバーハッキング攻撃から機密情報を保護するためにサーバーに保存されません。これらはインスタンスを実行するために一度だけ使用されます。<br>ウェブサイトを通じた自動取引サービスを利用する際には、以下を提供する必要があります(サーバーには保存されません):<br>取引所が発行するAPIキー、セキュリティキー、および自動取引に必要なその他の取引所発行項目;<br>クッキー<br>私たちはクッキーを収集しません。<br>ログファイル<br>私たちはログファイルを収集しません。<br>デバイス情報<br>私たちはデバイス情報を収集しません。<br>テレグラムデータ<br>自動取引や通知設定などのためにテレグラムボットを使用する場合は、関連情報を提供する必要があります。<br>テレグラムを通じてウェブサイトで自動取引サービスを利用する際には、以下を提供する必要があります:<br>テレグラムボットトークン、テレグラムチャットID;<br>テレグラムを使用しない場合でも、ウェブサイトを通じて提供される機能の一部を引き続き利用できます。<br>第三者から受け取るデータ<br>お客様がウェブサイトにAPIを登録するために、交換API(Binance、Bybit、Bitget、Okxなど)を使用する場合、サービスはお客様が使用する取引所が提供する情報をそのAPIを通じて見ることができます。これは、サービス利用規約の遵守を保証するために使用されます。私たちは第三者がどのようにお客様に関する情報を提供したり、個人情報を処理したりするかを管理したり責任を負ったりすることはありません。<br>連絡先データ<br>電話、メール、またはこのウェブサイトや私たちが運営する他のサービスとやり取りする際に、お客様が提供することを選択したすべての個人情報も処理されます。電話番号を提供することで、お客様は私たちからのテキストメッセージの受信に同意したことになります。メッセージおよびデータ料金が発生する場合があります。メッセージの頻度はさまざまです。このプライバシーポリシーで明示的に記載されている場合を除き、お客様の電話番号を第三者と共有することはありません。<br>個人情報の使用方法<br>私たちは、お客様が利用しようとするサービスを提供するために必要なさまざまな方法で個人情報を使用します。また、特定の正当な利益のために使用する場合や、適用される法律を遵守するために必要な場合にも使用します。個人情報を処理するために他の合法的な根拠がある場合、私たちは通常、お客様の同意に依存しません。もし私たちが同意に依存する場合は、その時点でお客様に明確に通知します。<br>プロファイル<br>プロファイルは、各個別ユーザーの視聴設定を詳しく説明する情報セットです。ユーザー設定は、ウェブサイト、アプリケーション、またはユーザーアカウントを使用する際に、ユーザーの体験をカスタマイズする目的でのみ保持されます。私たちは、個人のプロファイル設定を第三者と共有しません。<br>ユーザーアカウントおよびプロファイル操作<br>ユーザーアカウントを認証し、サービスとアカウントのセキュリティを確保し、スパム、詐欺、および悪用を防止するために、ユーザー名、メールアドレス、または電話番号などの連絡先情報を次のように使用します:<br>ユーザーアカウントを確認し、アカウントの問題を処理します;<br>すべての新規ユーザーに対して、メールアドレスを確認するためのアクティベーションメールを送信します;<br>ユーザーアカウント削除<br>お客様は、私たちのウェブサイトおよび/またはアプリケーションの使用を拒否し、プロファイル設定でアカウント削除を要求することができます。アカウントは即座に削除されます。アカウントが削除されると、お客様が提供したその後の個人情報も削除されます。すでにシステムに統合されている一部のデータ(例：使用された好み/スクリプト)は保存されます。このデータはプラットフォームの完全性を維持するために保存する必要があります。<br>マーケティング<br>私たちは、お客様がサインアップした製品やサービスに類似した製品やサービスについてのマーケティングメールを送信することがあります。これには、お客様が関心を持つ可能性のあるイベントやその他のプロモーション情報が含まれます。ただし、お客様がそのような方法での通信を受け取りたくないことを私たちに知らせた場合は除きます。ユーザーは、いつでもメールでのマーケティング通信の受信を拒否することができます。<br>サービス関連の通知<br>まれにですが、サービス関連の通知を送信する必要がある場合があります。例えば、サービスが長期間中断される場合や主要機能のアップグレードがリリースされた場合、すべてのユーザーにメールメッセージを送信することがあります。<br>カスタマーサービス<br>メールで連絡することで、ウェブサイトの問題を解決するためのサービスを提供できます。<br>API<br>高度なチャート、トレーディングプラットフォーム、REST APIなどのAPI(アプリケーションプログラミングインターフェース)サービスを使用する場合、これらのサービスを提供し、サポートするためにお客様の個人情報を処理することがあります。<br>正当な利益<br>私たちは、特定の正当なビジネス利益のために必要な場合に、お客様の個人情報を処理します。これらの利益には以下が含まれます:<br>お客様の問い合わせ、コメント、または苦情に対応することが求められた場合;<br>ウェブサイトやアプリケーションをより効果的に表示するためにサービスを管理し、訪問者がウェブサイトやアプリケーションとどのように対話するかをよりよく理解するために;<br>モバイルアプリケーションを開発および改善するために;<br>管理目的、購読サービスの提供、および販売およびマーケティング活動に関連して、お客様の同意なしに、関連する場合を除き、お客様の個人情報を当社の関連ビジネス間で共有するために;<br>お客様が購読している製品やサービスに類似した製品やサービスについての情報を送信するために(お客様がメールアドレスを提供した際、またはそのような方法での通信を受け取りたくないことを私たちに知らせた場合を除きます);<br>ユーザーにとって関連性のあるマーケティングが行われするために、お客様のデータを処理して、お客様の関心に合った製品やサービスの情報を送信することができます。<br>収集したデータを匿名化、偽名化、集計し、識別を解除して内部ビジネス目的で使用し、これをビジネスパートナー、関連ビジネス、代理店、およびその他の第三者と共有して、商業的、統計的、および市場調査の目的で使用します。たとえば、特定の人々のグループ間でパターンを分析し、人口統計、興味、および行動に関する研究を実施するために;<br>内部ビジネス/技術運営のために、トラブルシューティング、データ分析、テスト、調査、統計、および調査目的を含む、ウェブサイト、ネットワーク、および情報システムを安全に保つための取り組みの一環として含まれます;<br>(a) 法的義務を遵守するために、(b) 関係当局の要求に対応するために; (c) 利用規約またはハウスルールを施行するために; (d) 私たちの運営または関連ビジネスの運営を保護するために; (e) 私たちの権利、安全、または財産を保護するために; または (f) 法的権利を保護または執行したり、損害を防止したりするために;<br>これは、法律を遵守することが必要であると判断した場合に、お客様の情報を法執行機関、国家、または政府機関に保存および開示することができることを意味します。これには、裁判所命令や召喚状への対応、およびその他の司法的または規制的手続きが含まれます。<br>このプライバシーポリシーで使用される「正当な利益」とは、Knitbotおよび関連ビジネスの利益を指し、ビジネスを運営し、管理する際の利益を意味します。正当な利益のためにお客様の個人情報を処理する場合、お客様およびお客様のデータ保護法に基づく権利に対する潜在的な影響を考慮し、バランスを取るよう努めます。私たちの正当な利益が自動的にお客様の利益を無視するわけではありません。ユーザーの明示的な同意なしに、または法律によって要求または許可されていない限り、ユーザーに影響を及ぼす可能性のある活動に個人情報を使用することはありません。お客様は、ご自身の特定の状況に関連して、正当な利益に基づく個人情報の処理にいつでも反対する権利があります(お客様の権利に関する詳細は利用規約をご参照ください)。<br>個人情報を共有する場合<br>以下のような状況で、お客様の個人情報を第三者と共有することがあります:<br>サービス提供者:  Knitbotは多くのビジネスと同様に、時折ITサポートを提供し、サブスクリプションサービスおよびその他の商品/サービスを提供するために、(i) ITサプライヤーおよび契約者(例: データホスティングプロバイダーまたは配送パートナー)、(ii) ウェブおよびモバイル分析プロバイダー、(iii) デジタル広告サービスプロバイダー、(iv) マーケティングおよび営業ソフトウェアソリューションプロバイダーと提携します。これらの企業は、私たちの指示に従って、私たちが彼らに提供するサービスを実行する過程で、お客様の個人情報にアクセスしたり、処理したり、保存したりすることがあります。<br>Knitbot関連ビジネス: お客様がリクエストしたサービスを提供するために、関連するビジネスは上記の目的のために、私たちが収集した情報にアクセスし、処理することがあります。関連ビジネスは、お客様のデータを元々収集した目的にのみ使用します。<br>分析提供者: 私たちは、サービスやモバイル/デスクトップアプリケーションの使用を監視および分析するために、第三者サービス提供者を使用することがあります。この情報を使用して、サービスおよびモバイルアプリケーションの動作を分析し、改善します。<br>私たちは、ウェブサイト、モバイルアプリ、および提供するウィジェットと連携して、Google Analyticsをウェブ分析サービスとして使用することがあります。Google Analyticsのプライバシープラクティスに関する詳細については、こちらをご参照ください。私たちが使用する可能性のあるモバイルおよびデスクトップアプリケーションの分析サービス:<br>Firebase — Googleが提供する開発および分析プラットフォームです。収集される情報の種類に関する詳細については、Firebaseのウェブページをご参照ください。<br>Flurry Analytics — モバイルアプリケーションユーザーの行動を理解するためのツールとリソースを提供します。Flurry Analyticsがユーザーデータをどのように処理するかについての詳細は、プライバシーポリシーをご覧ください。<br>Visual Studio App Center — Microsoftが所有しています。該当するデータ保護規定は、Microsoftのプライバシーポリシーで確認できます。<br>AppsFlyer — マーケティングおよび広告キャンペーンの効果を測定および分析し、アプリケーション内の特定のイベントとアクションを分析するための分析サービスを提供します。AppsFlyerの動作方法と収集されたデータの詳細については、AppsFlyerサービスプライバシーポリシーをご参照ください。<br>Sentry — プラットフォームのエラートラッキングおよびパフォーマンスモニタリングプラットフォームであり、プラットフォームのパフォーマンスを診断、修正、および最適化するのに役立ちます。Sentryが収集したデータの詳細については、Sentryプライバシーポリシーをご参照ください。<br>事業譲渡: 私たちがビジネスを売却したり、会社の資産が第三者に買収された場合、一般アカウントユーザー、サブスクリプションアカウントユーザー、または顧客に関する個人情報が譲渡資産の1つになる可能性があります。<br>行政および法的理由: お客様の個人情報を開示する必要がある場合、(i) 法的義務および/または司法または規制手続き、裁判所の命令、またはその他の法的手続きを遵守するため、(ii) お客様が所属する利用規約、ハウスルール、またはその他の適用される契約条件を施行するため、または (iii) 私たちまたは契約者を損失や損害から保護するために、警察、裁判所、または法執行機関との情報交換を含むがこれに限定されない場合。<br>広告: 私たちはウェブサイトで広告を表示し、リマーケティングおよびトラッキング機能を使用することがあります。リマーケティング機能は、ユーザーの他のウェブサイトでの活動に基づいて、関心のある広告をよりターゲットに合わせて表示することができます。トラッキング機能は、ウェブサイトを通じてユーザーが完了したインプレッション、広告クリック、および特定のアクションに関する情報を収集することができます。このデータは、広告キャンペーンのパフォーマンスを評価するのにも役立ちます。<br>なお、私たちは仮名化されたデータのみを収集します。広告、リマーケティング、およびトラッキングの目的で、以下のサービスを使用することがあります:<br>Google Ad Manager and Google Ads — これらは、私たちがサイトで広告を提供し、その成功を測定するのに役立ちます。Googleがデータを使用する方法の詳細については、Googleのプライバシーポリシーを参照してください。Google広告の個人化設定ページで設定をオフにするか、ネットワーク広告イニシアティブのオプトアウトページにアクセスしてオプトアウトできます。<br>Meta pixel — 広告キャンペーンの測定、最適化、構築を支援します。<br>Metaのデータポリシーについて詳しくはこちらをご覧ください。Facebookの広告設定で個人的な広告設定を管理することができます。Facebookアカウントをお持ちでない場合は、オンライン広告選択ウェブサイトまたはDAAのWebChoicesツールを使用して広告環境を管理することができます。<br>Twitter Conversion Tracking (Twitter Pixel) — 広告費に対する収益を測定するのに役立ちます。<br>Twitterのデータ処理の詳細については、Twitterのプライバシーポリシーをご覧ください。Twitterプロフィールの個人設定で広告の受信を選択することができます。Twitterアカウントをお持ちでない場合は、オンライン広告選択ウェブサイトまたはDAAのWebChoicesツールを使用して、広告体験を管理することができます。<br>なお、広告主と個人情報を共有することはありません。広告主は生成されたインプレッション数やクリック数を含む一般的な統計データのみを閲覧できます。<br>Google reCAPTCHA: reCAPTCHAを使用して、データが人間によって入力されたものか、自動化されたプログラムによって入力されたものかを確認します。 reCAPTCHAを使用して、スパム、詐欺、不正使用からサービスを保護します。当社は、スパム、詐欺、および不正使用からサービスを保護するためにこのサービスを使用しています。 reCAPTCHAは、訪問者のさまざまな特性を使用して、訪問者の行動を分析し、分析目的でさまざまな情報(IPアドレス、訪問時間、またはユーザーのマウスクリックなど)を評価します。<br>この分析は、ウェブサイト訪問者がウェブサイトにアクセスすると同時に自動的に開始され、バックグラウンドで実行されます。訪問者に分析が行われていることは通知されません。<br>分析中に記録されたデータはGoogleに渡されます。Google reCAPTCHAとGoogleのプライバシーポリシーの詳細については、以下のリンクをご覧ください： GoogleのプライバシーポリシーとreCAPTCHAとは？<br>YouTube API Services: 私たちは、YouTube APIを使用して選択したビデオアイデアやビデオストリームをあなたのYouTubeアカウントに共有します。このサービスを使用するには、Googleアカウントでログインし、あなたのYouTubeアカウントへのアクセス権を私たちに付与する必要があります。私たちはこのアクセスを使用して、あなたが私たちと共有することを選択したビデオをアップロードします。あなたのYouTubeアカウントの他のデータを保存、修正、削除、または閲覧することはありません。また、Googleアカウント情報を第三者と共有することもありません。Googleのセキュリティ設定ページにアクセスして、いつでもYouTubeアカウントへのアクセス権を解除できます。このサービスを使用することで、YouTube利用規約に同意したものとみなされます。<br>サイト上で公開されている情報<br>公開プロファイル<br>他の人が公開して閲覧できるプロファイルはありません。<br>公開コンテンツ<br>他の人が公開して閲覧できるコンテンツはありません。<br>個人情報のセキュリティ<br>私たちは、技術的および組織的な安全対策を用いて、あなたの個人情報を保護し、協力している第三者にも同じ要求をします。私たちは、あなたが提出した特定の情報を保護するために、さまざまな暗号化技術を使用しています。<br>これにより、情報が送信中に誰かによって傍受されることを防ぐことができます。私たちは、サービスが安全であり、業界標準を遵守するよう最善を尽くしています。<br>また、ファイアウォール、認証システム(例：パスワード、識別)、アクセス制御メカニズムなどの他の安全対策を使用して、無許可のアクセスを制御しています。<br>アカウントを作成することを選択した場合、アクセス詳細を秘密に保つためにできる限りのことをする責任があります。この情報を他の人と共有してはいけません。<br>私たちは、オフラインでもユーザー情報を保護するために最善を尽くしています。すべてのユーザーの個人情報は、オフィス内でのみ制限されます。職務を遂行するために情報を閲覧する必要がある従業員のみがこれにアクセスできます。個人情報を保存するサーバーは、安全な環境のロックされた施設にあります。私たちは、収集されたデータを保護し、保存し、処理する方法を継続的に改善しており、これにはシステムへの無許可アクセスを防ぐための物理的なセキュリティ対策が含まれます。<br>ただし、電子送信または保存方法は100％安全ではありません。したがって、その絶対的な安全性を保証することはできません。<br>子供および敏感な個人情報<br>このウェブサイトは、18歳未満の子供を対象としていません。私たちは、18歳未満の子供から個人情報を故意に連絡したり収集したりしません。また、敏感な個人情報(例：人種または民族の出身、政治的見解、宗教的または哲学的信念、労働組合への加入、遺伝データの処理、自然人を一意に識別するためのバイオメトリクスデータ、健康関連データ、または自然人の性生活や性的指向)は故意に収集しません。詳細については、GDPR第9条を参照してください。これらの情報を誤って収集したと思われる場合は、直ちにご連絡ください。私たちは特別な同意を得たり、情報を削除するための措置を講じます。<br>第三者サイト<br>他のサイトへのリンク<br>当社は、ウェブサイトから他のウェブサイトへのリンク(ウェブリンク)を追加することがあります。これらのウェブサイトは、個別の独立したプライバシーポリシーを持つ第三者が運営する場合があります。<br>したがって、当社はこれらのリンク先のサイトの内容、活動、またはプライバシーポリシーについて責任を負いません。 訪問するすべてのサイトのプライバシーポリシーを読むことをお勧めします。<br>EEAおよび英国ユーザーの特定の権利<br>欧州および英国のデータ保護法の適用を受ける個人は、私たちが保有している個人情報に関連してデータ主体の権利を持つ場合があります(以下に詳述)。これ自体が制限および/または制約の対象となることがあります。EEAまたは英国に居住している場合は、権利を行使するために私たちに連絡してください。<br>データアクセス<br>リクエストに応じて、私たちがあなたの個人情報を処理しているかどうかを確認し、そうである場合はその個人情報のコピーとその他の関連する詳細を提供します。追加のコピーが必要な場合、状況に応じて合理的な手数料を請求することがありますが、これは状況によって異なります。<br>個人情報処理の制限<br>データの正確性に異議を唱えたり、処理に反対したりする場合など、特定の状況下であなたの個人情報の処理を制限するよう依頼できます。処理の制限が解除される前に、これを通知します。<br>私たちがあなたの個人情報を他の人と共有している場合、可能な限り、これらの制限を通知します。リクエストがあった場合、可能であり法的に許可されている場合は、あなたの個人情報を共有した相手や共有しようとしている相手に通知し、直接連絡を取ることができるようにします。<br>拒否<br>次のことを要求することができます:<br>あなたの個人情報の処理をいつでも停止するよう要求することができ、それを行います。私たちが正当な利益に基づいてあなたの個人情報を処理している場合、その処理が正当な理由を持たない限り、問題にはなりません。<br>直接マーケティングの目的でのデータ処理に異議を唱え、メールによるサービス通知の受信を拒否することができます。これはメールを通じて連絡できます。<br>同意の撤回<br>私たちがあなたの同意に基づいて個人情報を処理している場合、いつでもその同意を撤回する権利があります。これは、同意を撤回する前にあなたのデータを処理した合法性には影響を与えません。私たちは通常、他の合法的な根拠がある場合、あなたの同意に依存しないことを強調します。私たちがあなたの同意に依存する場合、その時点でこれを明確にします。<br>データの閲覧および修正<br>不正確な個人情報を修正したり、不完全な場合は補完したりする権利があります。そのため、各ユーザーはプロフィール設定で自分の個人情報を閲覧、管理、更新できます。私たちがあなたの個人情報を他の人と共有している場合、可能な限り修正を通知します。リクエストがあった場合、可能であり法的に許可されている場合は、あなたが直接連絡を取れるように、個人情報を共有した相手に通知します。<br>データの削除<br>サービスの使用を拒否する権利があり、特定の状況では個人情報の削除または除去を要求することができます。私たちがあなたのデータを他の人と共有している場合、可能な限り修正を通知します。リクエストがあった場合、可能であり法的に許可されている場合は、あなたが直接連絡を取れるように、個人情報を共有した相手に通知します。<br>データの保存<br>私たちは、(1)あなたがアカウントを削除することを決定するまで、または(2)法的要件や正当なビジネス目的(例：税務、法律、会計、詐欺や悪用の防止および/またはその他の目的)のために必要な期間、あなたの個人情報を保持します。このデータは、アカウント削除後も保存されることがあります。適用される保存期間が満了した場合、適用される法律および規制に従って個人情報を安全に破棄します。一部のケースでは、個人情報を匿名化して、あなたと関連付けられなくすることができます。この場合、そのデータはもはや個人情報とは見なされません。<br>データの移動<br>私たちが保有している個人情報を取得する権利があります。私たちは、あなたに一般的に使用される構造化された機械で読み取れる形式で個人情報を提供します。希望する場合は、他の場所で再利用することができます。<br>データ保護当局への苦情の提出<br>私たちのプライバシー慣行について懸念がある場合、またはあなたの個人情報の処理方法について懸念がある場合は、欧州連合加盟国のデータ保護当局、または英国の監督機関である情報コミッショナー事務局(ICO)に報告することができます。これらの権利を行使したい場合は、私たちに連絡してください。リクエストに応じる前に、あなたの身元を確認するための追加情報を求める場合があります。<br>国際データ転送<br>サービスを通じて収集された情報は、上記目的のために、複数の場所にあるサーバーに、私たちのサービスプロバイダーおよび関連するビジネスによって保存されます。これは、あなたがサービスをナビゲートして使用できるようにするために必要です。データは、ビジネス運営を支援するサービスプロバイダーおよび関連業者に転送される可能性があります(上記説明済み)。<br>これらの国々では、あなたの国で提供される個人情報保護の法的基準と同等の基準を提供しない場合があります。個人情報をあなたの国以外に転送する場合、処理中に十分なレベルのセキュリティ保護を受けることができるように、必要な措置を講じます。<br>導入されたセーフガードの詳細情報を入手したい場合は、次のメールアドレスでお問い合わせください: knitbot@protonmail.com<br><br><br>カリフォルニア州のユーザー固有の権利<br>カリフォルニア州の適格な居住者である場合、カリフォルニア州消費者プライバシー法(CCPA)は、個人情報の収集と使用に関する特定の権利を提供します。CCPAに基づき、次の権利があります:<br>過去12か月間に収集および使用された個人情報に関する特定の情報を公開するよう要求する権利。収集された消費者個人情報のカテゴリのリストは「収集する個人情報」セクションに記載されており、個人情報が公開される可能性がある第三者のカテゴリのリストは「個人情報をいつ共有するのか」セクションに記載されています。データ移行要求を行使するには、私たちに連絡してください。別途、私たちはあなたの個人情報を販売しません。<br>収集された個人情報の削除を要求する権利。詳細については、「ユーザーアカウントの削除」セクションを参照してください。<br>CCPAに基づく権利を行使する際に、価格およびサービスに関して差別を受けない権利。私たちは、消費者に対して個人情報を販売する見返りとして金銭的なインセンティブ、価格差別、またはサービスを提供することはありません。<br>連絡先情報<br>個人情報の処理に関して質問や提案がある場合は、次のメールアドレスでお問い合わせください:<br>knitbot@protonmail.com<br>"
    },
    "UA": {
        "CONTEXT": "利用規約<br>簡単に言えば: 私たちはKnitbot Org.(Knitbot、私たち)です。私たちはあなたの個人情報を尊重し、提供された情報の機密性を保護するために最善を尽くしています。リクエストされたサービスおよびデータを提供するために必要な場合にのみ、第三者と個人情報を共有します(詳細はプライバシーポリシーで説明)。私たちのサービスは18歳以上の個人を対象としています。<br>紹介<br>KnitBotへようこそ。私たちのサービスを利用することにより、次の利用規約(ユーザー契約)に同意することになります。これを注意深くお読みください。<br>規約の同意<br>サービスにアクセスまたは使用することにより、これらの利用規約に拘束されることに同意するものとします。この規約に同意しない場合は、サービスを使用しないでください。<br>提供されるサービス<br>KnitBotは、自動取引サービスを含むさまざまな機能を無料で提供しています。これらのサービスの使用は、自己責任で行われます。自発的な寄付や紹介登録は感謝されますが、サービスの利用には必須ではありません。<br>利用者の義務<br>利用者は、サービスを悪用せず、適用されるすべての法律および規制を遵守することに同意します。サービスの中断や妨害を試みてはなりません。<br>責任の制限<br>KnitBotは、サービスを「現状のまま」提供し、明示的、黙示的、または法的な保証や条件なしで提供します。KnitBotは、特に所有権、商品性、特定の目的への適合性、および非侵害についての黙示的保証を明示的に否認します。<br>保証およびリスクの免責<br>取引リスク<br>自動取引はかなりのリスクを伴います。私たちのサービスを利用することで、すべての取引決定およびそれに伴う損益に対して完全に責任を負うことを認め、同意するものとします。KnitBotは発生した取引損失について責任を負いません。<br>技術的問題<br>KnitBotは、サーバー通信エラー、システム障害、サイバー攻撃、ハッキング、その他の悪意ある活動による中断を含む、内外の原因に関するあらゆる技術的問題について責任を負いません。サービスが中断なく、またエラーなく提供されることは保証されません。<br>サービス不一致<br>実際の使用と意図された使用との間の不一致について責任を負いません。<br>プラットフォーム機能<br>KnitBotは、ユーザーが定義した取引戦略を実行するためのプラットフォームを提供します。ユーザーは自身の取引戦略を設定する必要があり、KnitBotは単にユーザーが実行したスクリプトをAPIを通じて取引所に送信します。取引戦略の設定および実行は、完全にユーザーの責任です。<br>賠償責任<br>サービスの利用に起因するすべての請求、要求、または損害について、KnitBotを免責し保護することに同意するものとします。これには、合理的な弁護士費用が含まれます。サービスの利用、この規約の違反、または他人の権利の侵害が含まれます。<br>プライバシーポリシー<br>プライバシーポリシーには、個人情報の取り扱い方法が記載されており、プライバシーポリシーで確認できます。私たちのサービスを利用することにより、プライバシーポリシーに記載されている個人情報の収集および使用に同意するものとします。<br>アカウントの解約<br>私たちは独自の裁量で、アカウントおよびサービスへのアクセスを解約または一時停止する権利を保有しており、このユーザー契約に違反する場合、またはサービスの使用が私たちまたは他のユーザーに有害であると判断した場合、またはその他の理由で解約できることがあります。<br>準拠法および紛争解決<br>この契約は、公平の原則に従って解釈および適用され、法的紛争の原則は考慮されません。この契約から生じる、または関連するすべての紛争は、相互に合意された仲裁機関の規則に従って、拘束力のある仲裁を通じて解決されます。<br>寄付および紹介登録<br>KnitBotへのすべての寄付は自発的であり、サービスへのアクセスや使用のために必要なものではありません。また、ユーザーは紹介リンクを介して取引所に登録することができ、これによりKnitBotに利益がもたらされる可能性がありますが、これもまた自発的なものです。<br>利用規約の変更<br>私たちは、ウェブサイトに新しいバージョンを掲載することで、利用規約を随時更新することがあります。変更が適しているかどうかを確認するために、定期的にウェブサイトを確認してください。適用される法律に基づいて必要な場合、利用規約の重要な変更が通知されることがあります。<br>連絡先情報<br>この利用規約に関する質問や提案がある場合は、次のメールアドレスでお問い合わせください:<br>knitbot@protonmail.com<br>"
    }
}