{
    "HELLO": "안녕하세요",
    "KNIT_BOT": "니트봇.ai",

    "COM": {
        "SET_API": "API 설정",
        "SET_TELE": "텔레그램 설정",
        "CHG_LAN": "언어 변경",
        "CHG_DARK_MODE": "다크 모드로 전환",
        "CHG_LIGHT_MODE": "라이트 모드로 전환",
        "LOGOUT": "로그아웃",
        "BOT_STATUS": "현재 봇 상태",
        "STOP": "정지",
        "OPERATING": "작동중",
        "EXIT": "비상구",
        "NOTICE": "공지사항 바로가기",
        "HOW_TO_USE": "사용 방법",
        "OFFICIAL_TELEGRAM": "니트봇 공식 텔레그램",
        "CHEER_TO_OFFICIAL": "거래소 회원가입으로 응원하기",
        "DONATE_CREATOR": "제작자에게 후원하기",
        "ADDRESS": "주소",
        "BANNER": "배너",
        "HOME_NOTICE": "니트봇은 <span>무료로 제공</span>되며, 레퍼럴 가입이 <span>필요하지 않습니다.</span> <br>현재 서버비는 광고와 후원으로 유지되고 있습니다. 따뜻한 후원으로 제작자의 허기진 배를 채워주세요.<br>애드블록을 꺼주신다면 제작자에게 큰 힘이 됩니다."
    },
    "AUTO": {
        "SETTING_INDICATOR": "지표 설정",
        "SET_AUTO_SALE": "자동매매 설정",
        "SELECT_INDICATOR1": "지표1 선택",
        "SELECT_INDICATOR2": "지표2 선택",
        "PERIOD": "기간",
        "STANDARD_DEVIATION": "표준 편차",
        "RETRACEMENT": "되돌림 비율",
        "ATR_LENGTH": "ATR 길이",
        "INITIAL_ACCELERATION": "초기 가속요소",
        "INCREMENT": "가속 증가량",
        "MAXIMUM": "초대 가속요소",
        "SMOOTHING": "스무딩",
        "RSI_LENGTH": "RSI 길이",
        "STOCHASTIC_PERIOD": "스토캐스틱 기간",
        "MOVE_AVERAGE": "이동 평균선",
        "FIBONACCI_RETRACEMENT": "피보나치 되돌림",
        "SURPASSED_UPPER_LINE": "상단 상향 돌파",
        "DROPPED_BELOW_UPPER_LINE": "상단 하향 돌파",
        "SURPASSED_LOWER_LINE": "하단 상향 돌파",
        "DROPPED_BELOW_LOWER_LINE": "하단 하향 돌파",
        "HIGH_CURRENT_PRICE": "현재가가 높을 때",
        "LOW_CURRENT_PRICE": "현재가가 낮을 때",
        "SURPASSED_RATIO": "해당 비율 상향 돌파",
        "DROPPED_BELOW_RATIO": "해당 비율 하향 돌파",
        "SURPASSED_SIGNAL": "시그널 상향 돌파",
        "DROPPED_BELOW_SIGNAL": "시그널 하향 돌파",
        "HIGH_CONSTANT": "상수보다 클 때",
        "LOW_CONSTANT": "상수보다 작을 때",
        "HIGHER_K": "%K가 상수보다 클 때",
        "LOWER_K": "%K가 상수보다 작을 때",
        "CROSS_K_DOWN": "%K 하향 교차",
        "CROSS_K_UP": "%K 상향 교차",
        "LONG_SIGNAL": "롱 시그널",
        "SHORT_SIGNAL": "숏 시그널",
        "NONE": "해당 없음",
        "CANDLE": "캔들",
        "THAN_INDICATOR_1": "지표 1에 대하여 (than indicator 1)",
        "THAN_INDICATOR_2": "지표 2에 대하여 (than indicator 2)",
        "CONSTANT": "상수",
        "BOT_ACTION": "봇의 행동",
        "OPEN": "진입",
        "CLOSE": "종료",
        "ADD_LONG_SETTING": "롱 설정 추가",
        "ADD_SHORT_SETTING": "숏 설정 추가",
        "REMOVE_LONG_SETTING": "롱 설정 삭제",
        "REMOVE_SHORT_SETTING": "숏 설정 삭제",
        "REVERSE_POSITION_EXIT": "반대 포지션 진입시, 이전 포지션 종료",
        "SHORT_SETTINGS": "숏 설정",
        "LONG_SETTINGS": "롱 설정",
        "TRADE_LAST": "종가",
        "TRADE_OPEN": "시가",
        "TRADE_HIGH": "고가",
        "TRADE_LOW": "저가",
        "SHORT_TERM": "단기 이평",
        "LONG_TERM": "장기 이평",
        "MAXIMUM_ACCEL_ELEMENT": "최대 가속요소",
        "SIGNAL": "시그널",
        "RSI_PERIOD": "RSI 기간"
    },
    "DEFAULT" : {
        "DEFAULT_SETTING": "기본 설정",
        "RESET": "초기화",
        "MODES": "거래 유형",
        "FUTURES": "선물 (Futures)",
        "SYMBOLS": "거래 심볼 선택",
        "CANDLE_SETTING": "캔들 설정",
        "1M": "1분 봉",
        "3M": "3분 봉",
        "5M": "5분 봉",
        "15M": "15분 봉",
        "30M": "30분 봉",
        "1H": "1시간 봉",
        "4H": "4시간 봉",
        "1D": "일봉",
        "QUANITITY": "수량",
        "TELEGRAM_INFO": "텔레그램 정보",
        "TELEGRAM_KEY": "텔레그램 Key",
        "CONNECT_STATUS": "연동 상태",
        "CONNECTED": "연동됨",
        "DISCONNECTED": "연동 안 됨",
        "BOT_CONTROL_STATUS": "봇 제어 여부",
        "ON": "켜짐",
        "OFF": "꺼짐",
        "TRADE_TYPE": "거래유형",
        "ENTER_QUANTITY": "수량 입력"
    },
    "USE": {
        "HOW_TO_USE": "사용 방법",
        "DISCLAIMER": "면책사항",
        "DISCLAIMER_TXT": "KnitBot 은 모든 기능을 무료로 제공하고 있습니다.<br>자동매매를 설정하여 매매하는 것은 오로지 사용자 본인의 책임입니다.<br>서버 통신 또는 시스템 오류 등 기술적인 문제가 발생할 수 있으며, KnitBot은 이에 대해 책임지지 않습니다.<br>또한 해당 사용 방법이 실제와 다를 경우에도 책임지지 않습니다.<br>본 사이트의 모든 기능과 관련하여 KnitBot은 일체의 책임을 지지 않으므로, 이 점을 반드시 숙지하시고 본인의 의사에 따라 사이트 이용 여부를 선택해주시기 바랍니다.",
        "SET_API": "API 설정하기",
        "SET_API_TXT1": "1. 거래소를 선택해주세요.",
        "SET_API_TXT2": "2. 거래소에서 발급받은 API 키를 입력해주세요. 거래소별로 API를 발급받는 방법은 아래를 참고해주세요.",
        "SET_API_TXT3": "3. 거래소에서 발급받은 API 비밀번호(Secret Key)를 입력해주세요. 거래소별로 단어가 약간씩 다를 수 있으니 주의해주세요.",
        "SET_API_TXT4": "4. 거래소에서 발급받은 API Passphrase를 입력해주세요. 해당 입력란은 비트겟(Bitget) 거래소를 선택하였을 경우 나오며, 거래소 별로 없는 경우도 있습니다.",
        "BITGET_USE": "비트겟 거래소 API 발급방법",
        "BITGET_USE_TXT1": "비트겟 홈페이지에 로그인하여(1번) 우측 상단의 프로필을 클릭합니다(2번).<br>API Management 를 클릭해주세요.",
        "BITGET_USE_TXT2": "Create new API 를 클릭해주세요.",
        "BITGET_USE_TXT3": "1. API 이름을 영어로 자유롭게 적어주세요.",
        "BITGET_USE_TXT4": "2. 숫자 비밀번호를 만들어주세요. 8~32자리까지 가능합니다.",
        "BITGET_USE_TXT5": "3. Read-only 만 체크해주세요.",
        "BITGET_USE_TXT6": "4. 인증을 진행 (4~5번) 한 후, Next를 눌러 (6번) 나온 모든 부분을 전부 복사하여 안전하게 보관해야 합니다.",
        "TELEGRAM_SETTING": "텔레그램 설정",
        "TELEGRAM_SETTING_TXT1": "1. 생성한 봇의 Token을 입력해주세요. ex) 1234567890:GGA-to_LirpSuGnbdaEw_KnITbOtTOkEn",
        "TELEGRAM_SETTING_TXT2": "2. 본인의 chat id를 입력할 경우 다양한 기능을 사용할 수 있습니다. 선택사항.",
        "TELEGRAM_SETTING_TXT3": "3. 봇이 진입시 또는 종료시, 알림을 받을 수 있는 기능입니다.",
        "TELEGRAM_SETTING_TXT4": "4. 텔레그램 봇을 통하여 텔레그램 안에서 봇을 제어할 수 있는 기능입니다.",
        "AUTO_SALE_SETTING": "자동매매 설정 (지표 선택)",
        "AUTO_SALE_SETTING_TXT": "자동매매에 활용할 지표를 선택합니다.<br><br>지표 1은 반드시 선택해야 하며, 선택한 지표에 필요한 파라미터를 직접 조절할 수 있습니다.<br><br>지표 2는 선택 사항입니다. 지표 1과 지표 2를 모두 사용할 경우, 설정한 액션은 지표 1과 지표 2가 모두 충족되어야만 작동합니다.<br>(‘AND’ 조건으로 묶입니다.)",
        "BOT_ACTION_SETTING": "봇 액션 설정",
        "BOT_ACTION_SETTING_TXT": "봇 액션을 설정할 수 있습니다.<br><br>‘캔들’ 은 선택한 심볼의 현재 가격을 의미합니다.<br>종가, 시가, 고가, 저가를 선택할 수 있으며, 기본 설정에서 세팅된 캔들 시간대를 기준으로 합니다. 기본적으로 종가를 추천드립니다.<br><br>위에서 설정한 지표 1에 대하여 가격의 상황, 상수에 대한 지표의 상황에 따른 봇의 액션을 설정할 수 있습니다.<br><br>봇의 행동의 경우, 위에 설정한 상황이 발생하였을 때, 봇이 진입을 할 것인지, 종료를 할 것 인지를 설정할 수 있습니다.<br><br>롱(숏) 설정 추가를 통해, 봇이 진입을 하는 경우와 종료를 하는 경우를 각각 설정할 수 있습니다. 진입과 종료 둘 중 하나라도 설정되지 않으면 자동매매가 불가합니다.<br><br><span>즉, 각각 최소 2가지 이상의 설정을 하여야 하며, 조건간 충돌이 발생해서는 안 됩니다 !</span><br><br>만약 롱 설정과 숏 설정의 조건이 충돌한다면 봇은 작동하지 않습니다 !<br><br>예를 들어, EMA(지표 1) 선 아래로 내려갔을 때 롱을 진입하고 싶다면, 지표 1 에 대하여 ‘캔들값이 작을 때’  봇의 행동을 ‘진입’ 으로 설정합니다.<br>반대로, EMA(지표 1) 선 위로 올라갔을 때 숏을 진입하고 싶다면, 지표 1에 대하여 ‘캔들값이 클 때’ 봇의 행동을 ‘진입’으로 설정합니다.<br>",
        "REVERSE": "리버스",
        "REVERSE_TXT": "봇이 반대 포지션을 진입하게 되면, 이전 포지션을 자동으로 종료하는 기능입니다.<br>만약 이전에 봇이 롱을 진입한 경우, 아직 롱 종료 조건이 완성되지 않은 상태에서 숏의 진입 조건이 완성된다면 기존의 롱 포지션을 종료하고 숏 포지션만 진입합니다.",
        "DEFAULT_SETTING": "기본 설정",
        "DEFAULT_SETTING_TXT": "거래 유형을 선택할 수 있습니다. <br>현재 거래유형은 선물 거래(Futures) 만 지원합니다.<br><br>거래 심볼 선택에서 봇이 거래할 심볼을 선택할 수 있습니다.<br><br>캔들 설정에서는 자동매매 지표나 봇 액션 조건을 판단할 때 기준이 되는 시간대를 설정합니다. <span>설정되는 캔들 시간대에 따라 특정 지표들이나 조건들이 변화하므로 주의해서 설정해야 합니다.</span><br><br>수량은 선택한 거래 심볼을 자동 매매할 때 들어갈 수량을 의미 합니다.<br><br><span>이 때 수량은 선택된 코인의 수량이며 USDT가 아니므로, 수량은 반드시 코인의 수량을 기준으로 설정하여야 합니다 !</span>",
        "BOT_ACTING": "봇 가동 및 중지",
        "BOT_ACTING_TXT ": "리모컨의 우측 아이콘을 통해 봇을 켜고 끌 수 있습니다.",
        "SAVE": "저장",
        "SAVE_TXT": "모든 세팅을 완료하였다면 봇을 실행하기 전 저장해야 합니다.<br>저장을 하지 않는다면 봇이 실행되지 않거나 세팅이 반영되지 않는 등 오류가 발생할 수 있으니 반드시 저장하여야 합니다.",
        "BESIDE": "기타",
        "BESIDE_TXT": "이외의 사항은 KnitBot 공식 텔레그램 채널을 이용하여 문의바랍니다."
    },
    "API": {
        "API_SETTING": "API 설정",
        "SELECT_TRADE": "거래소 선택",
        "API_KEY": "API 키",
        "API_SECRET_KEY": "API 비밀번호",
        "API_PASSPHRASE": "API 패스페이즈",
        "API_KEY_TXT": "API 키를 입력하세요",
        "API_SECRET_KEY_TXT": "API 보안 키를 입력하세요",
        "API_PASSPHRASE_TXT": "API Passphrase 를 입력하세요",
        "API_SETTING_NOTICE": "본 무료 서비스를 이용함으로써 귀하는 인디케이터의 부정확성, 기술적 결함, 서버 중단, 장애 또는 당사의 통제를 벗어난 외부 요인을 포함한 본 서비스 이용 중 발생하는 모든 손실, 손해, 청구에 대해 KnitBot이 책임을 지지 않음을 인정하고 동의하는 것입니다. 모든 도구 및 데이터는 \"있는 그대로\" 제공되며, 귀하는 본 서비스를 이용하는 동안 이루어진 모든 결정에 대해 전적으로 책임을 집니다. KnitBot은 본 서비스를 이용함으로써 발생하는 손실이나 손해에 대해 그 원인에 상관없이 모든 책임을 부인합니다. 자세한 사항은 이용약관을 참조하시기 바랍니다."
    },
    "TELEGRAM": {
        "TELEGRAM_SETTING": "텔레그램 설정",
        "TELEGRAM_KEY": "텔레그램 키 (Bot Token)",
        "TELEGRAM_KEY_TXT": "텔레그램 키 (Bot Token)를 입력하세요",
        "CHAT_ID": "chat id (선택)",
        "CHAT_ID_TXT": "Chat id 를 입력하세요 (선택사항)",
        "OTHER_SETTING": "기타 설정",
        "BOT_CONTROL_YN": "텔레그램으로 봇 제어 허용",
        "TELEGRAM_SAVE": "저장",
        "FAIL_SAVE": "텔레그램 저장에 실패했습니다. id 를 다시 확인해주세요."
    },
    "MEMBER": {
        "MEMBER_INFO": "회원정보",
        "PROFILE_IMAGE_CHANGE": "프로필 이미지 변경",
        "PW_CHANGE": "비밀번호 변경",
        "MEMBER_WITHDRAWAL": "회원 탈퇴",
        "PW_RESETTING": "비밀번호 재설정",
        "EMAIL": "이메일",
        "INPUT_EMAIL": "이메일 입력",
        "CERTIFY": "인증하기",
        "CONFIRM": "확인",
        "PASSWORD": "비밀번호",
        "PASSWORD_CHECK": "비밀번호 확인",
        "PASSWORD_TXT": "8-32자, 대문자·숫자·특수문자 포함",
        "INPUT_PASSWORD": "비밀번호 입력",
        "CHANGE": "변경하기",
        "LOGIN": "로그인",
        "SAVE_EMAIL": "이메일 저장",
        "FIND_PW": "비밀번호 찾기",
        "LOGIN_ERROR": "이메일 또는 비밀번호가 일치하지 않습니다.",
        "PW_RULE": "8-32자, 대문자·숫자·특수문자를 포함해주세요",
        "SIGNIN": "회원가입",
        "SIGNIN_TXT_1": "계속 진행하여 회원가입을 완료함으로써 귀하는 본 사이트의",
        "SIGNIN_TXT_2": "에 동의하고 ",
        "SIGNIN_TXT_3": "을 이해했음을 인정하는 것입니다.",
        "CONFIRM_SIGNIN": "회원가입 완료",
        "TERMS": "이용약관",
        "PERSONAL_INFO": "개인정보 보호정책",
        "IMAGE_CHANGE": "이미지 변경",
        "REQUIRE_EMAIL": "이메일을 입력해주세요.",
        "INVALID_EMAIL_RULE": "유효한 이메일 형식을 입력해주세요.",
        "REQUIRE_PASSWORD": "비밀번호를 입력해주세요.(8~32자, 대문자, 숫자, 특수문자(@, $, !, %, *, ?, &, ^) 포함)",
        "INVALID_PASSWORD": "유효한 비밀번호 형식을 입력해주세요.(8~32자, 대문자, 숫자, 특수문자(@, $, !, %, *, ?, &, ^) 포함)",
        "REQUIRE_PASSWORD_CHECK": "비밀번호 확인을 입력해주세요.(8~32자, 대문자, 숫자, 특수문자(@, $, !, %, *, ?, &, ^) 포함)",
        "ERROR_PASSWORD": "비밀번호가 일치하지 않습니다.",
        "CAPTCHA_INPUT": "Captcha를 입력해주세요.",
        "CAPTCHA_HOLDER": "인증 메일 확인 및 Captcha 입력"
    },
    "TOAST": {
        "NEED_LOGIN": "로그인이 필요한 서비스입니다.",
        "OK_LOGIN": "로그인되었습니다.",
        "OK_LOGOUT": "로그아웃되었습니다.",
        "OK_SIGNIN": "회원가입되었습니다.",
        "OK_SAVE": "저장되었습니다.",
        "OK_UNREGISTE": "탈퇴되었습니다.",
        "OK_RESET": "초기화되었습니다.",
        "OK_PW_CHANGE": "비밀번호 변경에 성공했습니다.",
        "OK_OPERATE_BOT": "봇이 실행됩니다.",
        "OK_SAVE_INSTANCE": "인스턴스 저장되었습니다.",
        "OK_OPERATE_INSTANCE": "인스턴스 실행에 성공했습니다.",
        "OK_SAVE_TELEGRAM": "텔레그램 정보가 저장되었습니다.",
        "OK_CHANGE_LANGUAGE": "언어가 변경되었습니다.",
        "FAIL_SAVE": "저장에 실패했습니다.",
        "FAIL_PW_CHANGE": "비밀번호 변경에 실패했습니다.",
        "FAIL_SIGNIN": "회원가입에 실패했습니다.",
        "FAIL_SAVE_INSTANCE": "인스턴스 저장에 실패했습니다.",
        "FAIL_OPERATE_INSTANCE": "인스턴스 실행에 실패했습니다.",
        "FAIL_OPERATE_BOT": "봇 실행에 실패했습니다.",
        "FAIL_COPY_TEXT": "복사 중 오류가 발생했습니다.",
        "OK_BOT_STOP": "봇 동작을 정지했습니다.",
        "FAIL_BOT_STOP": "정지에 실패했습니다.",
        "OK_COPY_TEXT": "복사 되었습니다.",
        "FAIL_UNREGISTE": "탈퇴에 실패했습니다."
    },
    "LAYOUT": {
        "AUTO": "자동매매",
        "DEFAULT": "설정",
        "USE": "도움",
        "TELEGRAM": "Telegram",
        "NOTICE": "공지"
    },
    "PP": {
        "CONTEXT": "개인정보 보호정책<br>간단히 말해서: 우리는 Knitbot Org. (\"Knitbot\", \"우리\", \"저희\")입니다. 귀하의 개인정보를 존중하며, 제공하신 정보의 기밀성을 보호하기 위해 최선을 다하고 있습니다. 우리는 귀하가 요청한 서비스 및 데이터 제공을 위해 필요한 경우에만 제3자와 귀하의 개인정보를 공유할 것입니다 (이 개인정보 보호정책에서 자세히 설명).<br>소개<br>Knitbot은 귀하의 개인정보를 관리하는 데이터 관리자로서, knitbot.ai 웹사이트(\"웹사이트\"), Knitbot 모바일 및 데스크탑 애플리케이션(곧 제공 예정), Knitbot 서비스(각각 \"서비스\")의 유일한 소유자입니다. Knitbot은 여러 방법으로 사용자로부터 정보를 수집합니다 (이 개인정보 보호정책에서 자세히 설명).<br>이 개인정보 보호정책은 귀하가 웹사이트를 방문하거나 계정을 생성하거나 애플리케이션이나 서비스를 사용할 때 귀하로부터 수집한 개인정보에 적용됩니다 (\"귀하\", \"귀하의\"는 이에 따라 해석). 이 정책은 우리가 어떤 개인정보를 수집하는지, 왜 개인정보를 수집하는지, 어떻게 사용하는지, 귀하의 개인정보가 처리되는 법적 근거, 저장 방법, 정보 공유 방법에 대해 설명합니다.<br>이 개인정보 보호정책에서 사용되는 \"개인정보\"는 귀하를 식별할 수 있는 정보와 관련된 모든 정보를 의미합니다.<br>우리의 서비스를 사용하거나 개인정보를 제출함으로써, 귀하는 이 개인정보 보호정책의 조건을 수락하는 데 동의하는 것입니다. 따라서 이를 주의 깊게 읽어 주십시오. 이 개인정보 보호정책에 동의하지 않으면 언제든지 서비스를 중단하고 사용자 계정을 삭제해야 합니다.<br>업데이트<br>우리는 웹사이트에 새로운 버전을 게시하여 수시로 이 개인정보 보호정책을 업데이트할 수 있습니다. 변경 사항이 귀하에게 적합한지 확인하기 위해 가끔 웹사이트를 확인하시기 바랍니다. 적용 가능한 법률에 따라 필요한 경우, 개인정보 보호정책에 대한 중요한 변경 사항이 귀하에게 통보될 것입니다.<br>이 개인정보 보호정책의 현재 버전은 2024년 10월 31일에 수정되었습니다.<br>우리가 수집하는 개인정보<br>Knitbot.ai에서 공지 사항, 가이드와 같은 정보를 검색하거나 볼 때 계정을 생성할 필요가 없습니다.<br>귀하로부터 받는 데이터<br>사용자 계정<br>계정을 생성하기로 결정한 경우, 추가적인 서비스에 접근할 수 있도록 일부 개인정보를 제공해야 합니다. 아래에 설명된 것처럼, 귀하에 대한 추가 정보를 제공할 수도 있습니다.<br>등록 중에는 다음을 제공해야 합니다:<br>사용자 이름, 이메일 주소;<br>경우에 따라 휴대폰 번호를 제공하고 인증해야 할 수도 있습니다. 프로필 설정에서 자신에 대한 추가 정보를 추가할 수도 있지만, 이는 필수는 아닙니다.<br>다음 정보가 공개적으로 표시됩니다:<br>없음;<br>다음 정보는 공개적으로 표시되지 않습니다:<br>이름과 성, 휴대폰 번호, 이메일;<br>API 데이터<br>거래소 API 키와 관련된 보안 키 및 비밀번호는 서버 해킹 공격으로부터 민감한 정보를 보호하기 위해 서버에 저장되지 않습니다. 이들은 인스턴스를 실행하기 위해 한 번만 사용됩니다.<br>웹사이트를 통한 자동매매 서비스 이용 시 다음을 제공해야 합니다(서버에 저장되지 않음):<br>거래소에서 발행한 API 키와 보안 키 및 자동매매에 필요한 기타 교환 발행 항목들;<br>쿠키<br>우리는 쿠키를 수집하지 않습니다.<br>로그 파일<br>우리는 로그 파일을 수집하지 않습니다.<br>장치 정보<br>우리는 장치 정보를 수집하지 않습니다.<br>텔레그램 데이터<br>자동매매, 알림 설정 등을 위해 텔레그램 봇을 사용하려면 관련 정보를 제공해야 합니다.<br>텔레그램을 통한 웹사이트에서 자동매매 서비스를 사용할 때, 다음을 제공해야 합니다:<br>귀하의 텔레그램 봇 토큰, 텔레그램 채팅 ID;<br>텔레그램을 사용하지 않더라도, 웹사이트를 통해 제공되는 기능의 일부를 여전히 사용할 수 있습니다.<br>제3자로부터 받는 데이터<br>귀하가 웹사이트에 API를 등록하기 위해 거래소 API(Binance, Bybit, Bitget, Okx 등)를 사용하는 경우, 서비스는 귀하가 사용하는 거래소가 해당 API를 통해 제공하는 정보를 볼 수 있습니다. 우리는 서비스 약관 준수를 보장하기 위해 이를 사용합니다. 제3자가 귀하에 대한 정보를 제공하거나 귀하의 개인정보를 처리하는 방식에 대해 우리는 통제하거나 책임지지 않습니다.<br>연락처 데이터<br>전화, 이메일 또는 이 웹사이트나 우리가 운영하는 기타 서비스와 상호작용할 때 귀하가 제공하기로 선택한 모든 개인정보도 처리합니다.<br>전화번호를 제공함으로써, 귀하는 우리로부터 문자 메시지를 받을 것에 동의하는 것입니다. 메시지 및 데이터 요금이 부과될 수 있습니다. 메시지 빈도는 다양할 수 있습니다. 이 개인정보 보호정책에서 명시된 경우를 제외하고, 귀하의 전화번호를 제3자와 공유하지 않습니다.<br>개인정보 사용 방법<br>우리는 귀하가 사용하려는 서비스를 제공하기 위해 필요한 다양한 방식으로 개인정보를 사용합니다. 또한 특정 합법적 이익을 위해 사용하며, 적용 가능한 법률을 준수하기 위해 필요한 경우에도 사용합니다.<br>개인정보를 처리하기 위해 다른 합법적 근거가 있는 경우, 우리는 일반적으로 귀하의 동의에 의존하지 않습니다. 만약 우리가 귀하의 동의에 의존한다면, 그 시점에 귀하에게 명확하게 알릴 것입니다.<br>프로필<br>프로필은 각 개별 사용자의 시청 선호도를 자세히 설명하는 정보 세트입니다. 사용자 설정은 웹사이트, 애플리케이션 또는 사용자 계정을 사용할 때 사용자 경험을 맞춤화하기 위한 목적으로만 보관됩니다. 우리는 개인 프로필 설정을 제3자와 공유하지 않습니다.<br>사용자 계정 및 프로필 작업<br>사용자 계정을 인증하고, 서비스와 계정의 보안을 보장하며, 스팸, 사기 및 남용을 방지하기 위해 사용자 이름, 이메일 주소 또는 전화번호와 같은 연락처 정보를 다음과 같은 방식으로 사용합니다:<br>사용자 계정을 확인하고, 계정 문제를 처리합니다;<br>모든 신규 사용자에게 이메일 주소를 확인하기 위한 활성화 이메일을 발송합니다;<br>사용자 계정 삭제<br>귀하는 우리의 웹사이트 및/또는 애플리케이션 사용을 거부할 수 있으며, 프로필 설정에서 계정 삭제를 요청할 수 있습니다. 계정은 즉시 삭제됩니다.<br>계정이 삭제되면 귀하가 제공한 후속 개인정보도 삭제될 것입니다. 이미 시스템에 통합된 일부 데이터(예: 사용된 선호도/스크립트)는 저장됩니다. 이 데이터는 플랫폼의 무결성을 유지하기 위해 저장해야 합니다.<br>마케팅<br>우리는 귀하가 가입한 제품이나 서비스와 유사한 제품 또는 서비스에 대한 마케팅 이메일을 발송할 수 있습니다. 여기에는 귀하가 관심을 가질만한 이벤트 및 기타 프로모션 정보가 포함됩니다. 귀하가 이러한 방식으로의 통신을 받고 싶지 않다고 우리에게 알린 경우를 제외하고는 말입니다.<br>사용자는 언제든지 이메일을 통해 마케팅 커뮤니케이션을 받지 않도록 선택할 수 있습니다.<br>서비스 관련 공지<br>드물지만, 서비스 관련 공지를 보내야 하는 경우가 있습니다. 예를 들어, 서비스가 오랫동안 중단되거나 주요 기능 업그레이드가 출시된 경우, 모든 사용자에게 이메일 메시지를 보낼 수 있습니다.<br>고객 서비스<br>이메일을 통해 연락할 경우, 웹사이트 문제를 해결해 드릴 수 있습니다.<br>API<br>고급 차트, 거래 플랫폼, REST API와 같은 API(애플리케이션 프로그래밍 인터페이스) 서비스를 사용하는 경우, 해당 서비스를 제공하고 지원하기 위해 귀하의 개인정보를 처리할 수 있습니다.<br>정당한 이익<br>우리는 특정 합법적 비즈니스 이익을 위해 필요한 경우 귀하의 개인정보를 처리합니다. 이러한 이익에는 다음이 포함됩니다:<br>귀하의 문의, 의견 또는 불만에 응답하도록 요청받은 경우;<br>웹사이트 및 애플리케이션을 보다 효과적으로 표시하기 위해 서비스를 관리하고, 방문자가 웹사이트 및 애플리케이션과 상호작용하는 방식을 더 잘 이해하기 위해;<br>모바일 애플리케이션을 개발 및 개선하기 위해;<br>관리 목적, 구독 서비스 제공 및 판매 및 마케팅 활동과 관련하여, 관련이 있는 경우를 제외하고는 귀하의 동의 없이, 귀하의 개인정보를 우리와 제휴된 비즈니스 간에 공유하기 위해;<br>귀하가 구독한 제품이나 서비스와 유사한 제품이나 서비스에 대한 정보를 보내기 위해 (귀하가 이메일 주소를 제공할 때 또는 귀하가 그러한 방식으로 통신을 받고 싶지 않다고 우리에게 알린 경우를 제외하고는);<br>우리의 마케팅이 귀하에게 관련이 있도록 하기 위해, 우리는 귀하의 데이터를 처리하여, 귀하의 관심사에 맞는 제품 또는 서비스에 대한 정보를 발송할 수 있습니다.<br>우리가 수집한 데이터를 익명화, 가명화, 집계 및 식별 해제하여 내부 비즈니스 목적으로 사용하고, 이를 비즈니스 파트너, 제휴된 비즈니스, 대리인 및 기타 제3자와 공유하여 상업적, 통계적 및 시장 조사 목적으로 사용하기 위해. 예를 들어, 특정 그룹의 사람들 간의 패턴을 분석하고, 인구 통계, 관심사 및 행동에 대한 연구를 수행할 수 있도록 하기 위해;<br>내부 비즈니스/기술 운영을 위해, 여기에는 문제 해결, 데이터 분석, 테스트, 연구, 통계 및 설문 조사 목적이 포함되며, 웹사이트, 네트워크 및 정보 시스템을 안전하게 유지하려는 노력의 일환으로 포함됩니다;<br>(a) 법적 의무를 준수하기 위해, (b) 관련 당국의 요청에 응답하기 위해; (c) 이용 약관 또는 하우스 규칙을 시행하기 위해; (d) 우리의 운영 또는 우리와 제휴된 비즈니스의 운영을 보호하기 위해; (e) 우리의 권리, 안전 또는 재산을 보호하기 위해; 또는 (f) 법적 권리를 보호하거나 집행하거나 손상을 방지하기 위해;<br>이는 법률을 준수하는 것이 필요하다고 판단될 경우, 귀하의 정보를 법 집행 당국, 국가 또는 정부 기관에 저장하고 공개할 수 있음을 의미합니다. 여기에는 법원 명령이나 소환장에 대한 응답뿐만 아니라 기타 사법적 또는 규제적 절차가 포함됩니다.<br>이 개인정보 보호정책에서 사용된 \"정당한 이익\"은 비즈니스를 수행하고 관리하는 데 있어 Knitbot과 제휴된 비즈니스의 이익을 의미합니다. 우리가 합법적인 이익을 위해 귀하의 개인정보를 처리할 때, 귀하와 귀하의 데이터 보호법에 따른 권리에 미칠 수 있는 잠재적인 영향을 고려하고 균형을 유지하려고 노력합니다. 우리의 합법적인 이익이 자동으로 귀하의 이익을 무시하는 것은 아닙니다. 사용자의 명시적인 동의 없이, 또는 법률에 의해 요구되거나 허용되지 않는 한, 우리의 이익이 사용자에게 미칠 수 있는 영향을 초과하는 활동에 개인정보를 사용하지 않습니다. 귀하는 귀하의 특정 상황과 관련하여 합법적인 이익에 근거한 귀하의 개인정보 처리를 언제든지 반대할 권리가 있습니다(귀하의 권리에 대한 자세한 정보는 이용용약관을 참조하십시오).<br>개인정보를 공유하는 경우<br>다음과 같은 상황에서 귀하의 개인정보를 제3자와 공유할 수 있습니다:<br>서비스 제공업체: Knitbot은 많은 비즈니스와 마찬가지로, 때때로 IT 지원을 제공하고, 구독 서비스 및 기타 상품/서비스를 제공할 수 있도록 하기 위해 (i) IT 공급업체 및 계약자(즉, 데이터 호스팅 제공자 또는 배송 파트너), (ii) 웹 및 모바일 분석 제공업체, (iii) 디지털 광고 서비스 제공업체 및 (iv) 마케팅 및 영업 소프트웨어 솔루션 제공업체와 협력합니다. 이들은 우리의 지침에 따라, 우리의 지시를 수행하는 과정에서 귀하의 개인정보에 접근하거나 이를 처리하거나 저장할 수 있으며, 오직 우리가 그들에게 제공하도록 고용한 서비스를 수행하기 위해서만 그렇게 할 수 있습니다.<br>Knitbot 제휴 비즈니스: 귀하가 요청한 서비스를 제공하기 위해, 제휴된 비즈니스는 위에 설명된 목적을 위해 우리가 귀하로부터 수집한 정보를 접근하고 처리할 수 있습니다. 제휴된 비즈니스는 귀하의 데이터를 우리가 원래 수집한 목적을 위해서만 사용할 것입니다.<br>분석 제공업체: 우리는 서비스 및 모바일/데스크탑 애플리케이션 사용을 모니터링하고 분석하기 위해 제3자 서비스 제공업체를 사용할 수 있습니다. 이 정보를 사용하여 서비스 및 모바일 애플리케이션의 작업을 분석하고 개선합니다.<br>우리는 웹사이트, 모바일 앱 및 우리가 제공하는 위젯과 함께 웹 분석 서비스로 Google Analytics를 사용할 수 있습니다. Google Analytics의 개인정보 보호 실습에 대한 자세한 정보는 여기를 참조하십시오.<br>우리가 사용할 수 있는 모바일 및 데스크탑 애플리케이션의 분석 서비스:<br>Firebase — Google이 제공하는 개발 및 분석 플랫폼입니다. 수집된 정보 유형에 대한 자세한 내용은 Firebase 웹 페이지를 참조하십시오.<br>Flurry Analytics — 모바일 애플리케이션 사용자의 행동을 이해하는 데 필요한 도구와 리소스를 제공합니다. Flurry Analytics에서 사용자 데이터를 처리하는 방법에 대한 자세한 내용은 개인정보 보호정책을 참조하십시오.<br>Visual Studio App Center — Microsoft가 소유하고 있습니다. 해당 데이터 보호 조항은 Microsoft 개인정보 보호정책에서 확인할 수 있습니다.<br>AppsFlyer — 마케팅 및 광고 캠페인의 효과를 측정하고 분석하며, 애플리케이션 내에서 특정 이벤트와 작업을 분석하는 분석 서비스를 제공합니다. AppsFlyer의 작동 방식과 수집된 데이터에 대한 자세한 정보는 AppsFlyer 서비스 개인정보 보호정책을 참조하십시오.<br>Sentry — 플랫폼의 오류 추적 및 성능 모니터링 플랫폼으로, 플랫폼의 성능을 진단하고 수정하며 최적화하는 데 도움을 줍니다. Sentry에서 수집한 데이터에 대한 자세한 내용은 Sentry 개인정보 보호정책을 참조하십시오.<br>비즈니스 이전: 우리가 비즈니스를 매각하거나 회사 자산이 제3자에게 인수되는 경우, 일반 계정 사용자, 구독 계정 사용자 또는 고객에 대한 개인정보가 이전 자산 중 하나가 될 수 있습니다.<br>행정 및 법적 이유: 귀하의 개인정보를 공개해야 하는 경우 (i) 법적 의무 및/또는 사법 또는 규제 절차, 법원 명령 또는 기타 법적 절차를 준수하기 위해, (ii) 귀하가 속한 이용 약관, 하우스 규칙 또는 기타 적용 가능한 계약 조건을 시행하기 위해, 또는 (iii) 귀하의 정보를 경찰, 법원 또는 법 집행 기관과 교환하는 것을 포함하되 이에 국한되지 않고, 우리 또는 계약자를 손실이나 손상으로부터 보호하기 위한 경우.<br>광고: 우리는 웹사이트에서 광고를 표시하고 리마케팅 및 추적 기능을 사용할 수 있습니다. 리마케팅 기능은 사용자의 다른 웹사이트 활동을 기반으로 관심 있는 광고를 보다 목표 지향적으로 표시할 수 있도록 해줍니다. 추적 기능은 웹사이트를 통해 사용자 완수한 인상, 광고 클릭 및 특정 작업에 대한 정보를 수집할 수 있게 합니다. 이 데이터는 광고 캠페인의 성능을 평가하는 데도 도움이 됩니다.<br>참고로, 우리는 가명화된 데이터만 수집합니다. 광고, 리마케팅 및 추적 목적을 위해 다음 서비스를 사용할 수 있습니다:<br>Google Ad Manager and Google Ads — 우리는 사이트에서 광고를 제공하고 성공 여부를 측정하는 데 도움을 줍니다.<br>Google이 데이터를 사용하는 방법에 대한 자세한 정보는 Google의 개인정보 보호정책을 참조하십시오. Google 광고 개인화 설정 페이지에서 설정을 끄거나 네트워크 광고 이니셔티브 옵트아웃 페이지를 방문하여 옵트아웃할 수 있습니다.<br>Meta pixel — 광고 캠페인을 측정, 최적화 및 구축하는 데 도움을 줍니다.<br>Meta의 데이터 정책에 대해 자세히 알아보려면 여기를 참조하십시오. Facebook 광고 환경 설정에서 개인 광고 설정을 관리할 수 있습니다. Facebook 계정이 없는 경우, 온라인 광고 선택 웹사이트나 DAA의 WebChoices 도구를 사용하여 광고 환경을 관리할 수 있습니다.<br>Twitter Conversion Tracking (Twitter Pixel) — 광고 지출에 대한 수익을 측정하는 데 도움을 줍니다.<br>Twitter 데이터 처리에 대한 자세한 정보는 Twitter 개인정보 보호정책을 참조하십시오. Twitter 프로필의 개인 설정에서 광고 수신을 선택할 수 있습니다. Twitter 계정이 없는 경우, 온라인 광고 선택 웹사이트나 DAA의 WebChoices 도구를 사용하여 광고 환경을 관리할 수 있습니다.<br>당사는 광고주와 어떠한 개인 정보도 공유하지 않습니다. 광고주는 광고 노출 수와 클릭 수를 포함한 일반 통계에만 액세스할 수 있습니다.<br>Google reCAPTCHA: 우리는 데이터가 사람에 의해 입력되었는지 자동화된 프로그램에 의해 입력되었는지를 확인하기 위해 reCAPTCHA를 사용합니다. 우리는 스팸, 사기 및 남용으로부터 서비스를 보호하기 위해 이 서비스를 사용합니다. reCAPTCHA는 방문자의 다양한 특성을 사용하여 방문자의 행동을 분석하고 분석 목적으로 다양한 정보를 평가합니다 (예: IP 주소, 방문 시간 또는 사용자의 마우스 클릭).<br>이 분석은 웹사이트 방문자가 웹사이트에 액세스하자마자 자동으로 시작되며, 백그라운드에서 실행됩니다. 방문자에게 분석이 수행되고 있다는 사실은 알리지 않습니다.<br>분석 중에 기록된 데이터는 Google에 전달됩니다. Google reCAPTCHA와 Google 개인정보 보호정책에 대한 자세한 정보는 다음 링크에서 확인할 수 있습니다: Google 개인정보 보호정책 및 reCAPTCHA란 무엇인가?<br>YouTube API Services: 우리는 YouTube API를 사용하여 선택한 비디오 아이디어와 비디오 스트림을 귀하의 YouTube 계정에 공유합니다. 이 서비스를 사용하려면 Google 계정으로 로그인하고 귀하의 YouTube 계정에 액세스할 수 있는 권한을 부여해야 합니다. 우리는 이 접근을 사용하여 귀하가 우리와 공유하기로 선택한 비디오를 업로드할 것입니다. 귀하의 YouTube 계정에서 다른 데이터를 저장, 수정, 삭제하거나 보지 않을 것입니다. 우리는 또한 귀하의 Google 계정 정보를 제3자와 공유하지 않을 것입니다. Google 보안 설정 페이지를 방문하여 언제든지 YouTube 계정에 대한 우리의 접근 권한을 해제할 수 있습니다. 이 서비스를 사용함으로써 귀하는 YouTube 이용 약관에 동의하는 것입니다.<br>웹사이트에 공개된 정보<br>공개 프로필<br>공개적으로 다른 사람이 볼 수 있는 프로필이 없습니다.<br>공개 콘텐츠<br>공개적으로 다른 사람이 볼 수 있는 콘텐츠가 없습니다.<br>개인정보 보안<br>우리는 귀하의 개인정보를 보호하기 위해 기술적 및 조직적 안전장치를 사용하며, 우리가 협력하는 제3자에게도 동일한 요구를 합니다. 우리는 귀하가 제출한 특정 정보를 보호하기 위해 다양한 암호화 기술을 사용합니다.<br>이를 통해 정보가 전송 중에 누군가에 의해 가로채는 것을 방지할 수 있습니다. 우리는 서비스가 안전하고 업계 표준을 준수하도록 최선을 다하고 있습니다.<br>또한, 우리는 허가되지 않은 접근을 통제하기 위해 방화벽, 인증 시스템(예: 비밀번호, 식별), 접근 제어 메커니즘과 같은 다른 안전장치도 사용합니다.<br>계정을 만들기로 선택한 경우, 귀하의 접근 세부 정보를 비밀로 유지하기 위해 할 수 있는 모든 일을 해야 할 책임이 있습니다. 이 정보를 다른 사람과 공유해서는 안 됩니다.<br>우리는 또한 오프라인에서도 사용자 정보를 보호하기 위해 최선을 다하고 있습니다. 모든 사용자의 개인정보는 사무실 내에서만 제한됩니다. 직무 수행을 위해 정보를 볼 필요가 있는 직원만이 이를 액세스할 수 있습니다. 개인정보를 저장하는 서버는 보안된 환경의 잠금 시설에 위치해 있습니다.<br>우리는 수집된 데이터를 보호하고, 저장하고, 처리하는 방법을 지속적으로 개선하고 있으며, 여기에 시스템에 대한 무단 접근을 방지하는 데 도움을 주는 물리적 보안 조치가 포함됩니다.<br>그러나 전자 전송 또는 저장 방법은 100% 안전하지 않습니다. 따라서 그 절대적인 안전성을 보장할 수 없습니다.<br>아동 및 민감한 개인정보<br>이 웹사이트는 18세 미만의 아동을 대상으로 하지 않습니다. 우리는 18세 미만의 아동으로부터 개인정보를 고의로 연락하거나 수집하지 않으며, 민감한 개인정보 (\"인종 또는 민족 출신, 정치적 견해, 종교적 또는 철학적 신념, 노동조합 가입, 유전자 데이터 처리, 자연인을 고유하게 식별하기 위한 생체 데이터, 건강 관련 데이터 또는 자연인의 성생활 또는 성적 지향\")를 고의로 수집하지 않습니다. 자세한 내용은 GDPR 제9조를 참조하십시오.<br>우리가 이러한 정보를 무심코 수집했다고 생각되면, 즉시 연락해 주시기 바랍니다. 우리는 특별한 동의를 얻거나 정보를 삭제할 수 있도록 조치를 취할 것입니다.<br>제3자 사이트<br>다른 사이트로의 링크<br>우리는 웹사이트에서 다른 웹사이트로의 링크(웹 링크)를 추가할 수 있습니다. 이러한 웹사이트는 별도의 독립적인 개인정보 보호정책을 가진 제3자가 운영할 수 있습니다.<br>따라서 이러한 링크된 사이트의 내용, 활동 또는 개인정보 보호정책에 대해 우리가 책임지지 않습니다. 방문하는 모든 사이트의 개인정보 보호정책을 읽을 것을 권장합니다.<br>EEA 및 영국 사용자의 특정 권리<br>유럽 및 영국 데이터 보호법의 적용을 받는 개인은 우리가 보유하고 있는 개인정보와 관련하여 데이터 주체 권리를 가질 수 있습니다(아래에 자세히 설명됨).<br>이 자체가 제한 및/또는 제약의 대상이 될 수 있습니다.<br>EEA 또는 영국에 거주하는 경우, 권리 행사를 위해 저희에게 연락해 주십시오.<br>데이터 액세스<br>요청 시, 우리가 귀하의 개인정보를 처리 중인지 여부를 확인해 드리며, 그렇다면 그 개인정보의 사본과 기타 관련 세부 정보를 제공해 드리겠습니다.<br>추가 사본이 필요한 경우, 합리적인 수수료를 청구할 수 있지만, 이는 상황에 따라 논의될 수 있습니다.<br>개인정보 처리 제한<br>데이터의 정확성에 이의를 제기하거나 처리에 반대하는 경우와 같은 특정 상황에서 귀하의 개인정보 처리를 제한하거나 '차단'하도록 요청할 수 있습니다.<br>처리 제한이 해제되기 전에 이를 귀하에게 통보할 것입니다. 우리가 귀하의 개인정보를 다른 사람과 공유하는 경우, 가능한 한 해당 제한 사항을 통보할 것입니다.<br>요청 시, 그리고 가능하고 법적으로 허용되는 경우, 우리가 귀하의 개인정보를 공유한 사람이나 공유할 사람을 귀하에게 통보하여 귀하가 직접 그들에게 연락할 수 있도록 할 것입니다.<br>거부<br>귀하는 다음을 요청할 수 있습니다:<br>귀하의 개인정보 처리를 언제든지 중지하도록 요청할 수 있으며, 그렇게 할 것입니다. 우리가 합법적인 이익에 따라 귀하의 개인정보를 처리하는 경우, 처리가 정당한 근거를 가진 경우가 아니라면 문제가 되지 않아야 합니다.<br>직접 마케팅 목적으로 데이터 처리를 거부하고, 이메일을 통한 서비스 알림 수신을 거부합니다. 이는 이메일을 통해 연락할 수 있습니다.<br>동의 철회<br>우리가 귀하의 동의에 의존하여 개인정보를 처리하는 경우, 이 권리는 언제든지 행사할 수 있으며, 철회 전에 처리된 데이터의 적법성에는 영향을 미치지 않습니다.<br>이는 동의를 철회하기 전에 귀하의 데이터를 처리한 법적 적법성에 영향을 미치지 않습니다.<br>우리는 일반적으로 다른 합법적인 근거가 있는 경우, 귀하의 동의에 의존하지 않음을 강조합니다. 우리가 귀하의 동의에 의존하는 경우, 해당 시점에 귀하에게 이를 명확히 알릴 것입니다.<br>데이터 보기 및 수정<br>부정확한 개인정보를 수정하거나 불완전한 경우 보완할 권리가 있습니다.<br>이를 위해 각 사용자는 프로필 설정에서 자신의 개인정보를 보고, 관리하고, 업데이트할 수 있습니다.<br>우리가 귀하의 개인정보를 다른 사람과 공유하는 경우, 가능한 한 수정 사항을 통보할 것입니다.<br>요청 시, 그리고 가능하고 법적으로 허용되는 경우, 귀하가 직접 연락할 수 있도록 귀하의 개인정보를 공유한 사람을 통보할 것입니다.<br>데이터 삭제<br>서비스 사용을 거부할 권리가 있으며, 특정 상황에서는 개인정보를 삭제하거나 제거하도록 요청할 수 있습니다.<br>우리가 귀하의 데이터를 다른 사람과 공유하는 경우, 가능한 한 편집 사항을 통보할 것입니다.<br>요청 시, 그리고 가능하고 법적으로 허용되는 경우, 귀하가 직접 연락할 수 있도록 귀하의 개인정보를 공유한 사람을 통보할 것입니다.<br>데이터 보존<br>우리는 (1) 귀하가 계정을 삭제하기로 결정할 때까지, 또는 (2) 법적 요구나 합법적인 비즈니스 목적(예: 세금, 법률, 회계, 사기 또는 남용 방지 및/또는 기타 목적)을 위해 필요한 기간 동안 귀하의 개인정보를 보관합니다.<br>이 데이터는 계정 삭제 후에도 저장될 수 있습니다.<br>적용 가능한 보존 기간이 만료되면, 우리는 적용 법률 및 규정에 따라 귀하의 개인정보를 안전하게 파기할 것입니다.<br>일부 경우, 귀하의 개인정보를 익명화하여 더 이상 귀하와 관련이 없도록 할 수 있습니다.<br>이 경우, 해당 데이터는 더 이상 개인정보로 간주되지 않습니다.<br>데이터 이동<br>귀하는 우리가 보유하고 있는 개인정보를 받을 권리가 있습니다. 우리는 귀하에게 일반적으로 사용되는 구조화된 기계 판독 가능한 형식으로 개인정보를 제공할 것입니다.<br>원하는 경우, 이를 다른 곳에서 재사용할 수 있습니다.<br>데이터 보호 당국에 불만 제기<br>우리의 개인정보 보호 관행에 대한 우려 사항이 있거나, 귀하의 개인정보를 처리하는 방식에 대해 우려가 있는 경우, 유럽 연합 회원국의 데이터 보호 당국 또는 데이터 보호 문제에 대한 영국 감독 기관인 정보 커미셔너 사무소(ICO)에 신고할 수 있습니다.<br>이러한 권리를 행사하고자 하는 경우, 저희에게 연락해 주십시오.<br>요청에 응답하기 전에 귀하의 신원을 확인하기 위해 추가 정보를 요청할 수 있습니다.<br>국제 데이터 전송<br>서비스를 통해 수집된 정보는 우리의 서비스 제공업체 및 제휴된 비즈니스가 위에 설명된 목적을 위해 여러 위치에 있는 서버에 저장될 것입니다.<br>이는 귀하가 서비스를 탐색하고 사용할 수 있도록 하기 위해 필요합니다. 데이터는 비즈니스 운영을 지원하는 서비스 제공업체 및 제휴 업체에게 전송될 수 있습니다(위에서 설명됨).<br>해당 국가들은 귀하의 국가에서 제공하는 개인정보 보호 법적 기준과 동일한 기준을 제공하지 않을 수 있습니다.<br>개인정보를 귀하의 국가 외부로 전송하는 경우, 정보가 처리되는 동안 충분한 수준의 보안 보호를 받을 수 있도록 필요한 조치를 취할 것입니다.<br>도입된 안전장치에 대한 자세한 정보를 받고 싶다면, 다음 이메일을 통해 문의해 주십시오: knitbot@protonmail.com<br><br><br>캘리포니아 사용자 특정 권리<br>적격 캘리포니아 거주자인 경우, 캘리포니아 소비자 개인정보 보호법(\"\"CCPA\"\")은 귀하의 개인정보 수집 및 사용에 대한 특정 권리를 제공합니다. 귀하는 CCPA에 따라 다음 권리를 가집니다:<br>과거 12개월 동안의 개인정보 수집 및 사용에 대한 특정 정보를 공개하도록 요청할 권리. 수집된 소비자 개인정보의 카테고리 목록은 '수집하는 개인정보' 섹션에 나열되어 있으며, 개인정보가 공개될 수 있는 제3자의 카테고리 목록은 '개인정보를 언제 공유할까요' 섹션에 나열되어 있습니다. 데이터 이동 요청을 행사하기 위해 저희에게 연락해 주십시오. 별도로, 우리는 귀하의 개인정보를 판매하지 않습니다.<br>수집된 개인정보 삭제를 요청할 권리. 자세한 내용은 \"사용자 계정 삭제\" 섹션을 참조하십시오.<br>CCPA에 따른 귀하의 권리를 행사하는 동안 가격 및 서비스와 관련하여 차별받지 않을 권리. 우리는 소비자에게 개인 정보 판매 대가로 금전적 인센티브, 가격 차별 또는 서비스를 제공하지 않습니다.<br>연락처 정보<br>개인정보 처리에 대한 질문이나 제안 사항이 있는 경우, 다음 이메일을 통해 문의해 주십시오:<br>knitbot@protonmail.com<br>"
    },
    "UA": {
        "CONTEXT": "이용약관<br>간단히 말해: 간단히 말해서: 우리는 Knitbot Org. (\"Knitbot\", \"우리\", \"저희\")입니다. 우리는 귀하의 개인정보를 존중하며, 귀하가 제공한 정보의 기밀성을 보호하기 위해 최선을 다합니다.<br>귀하가 요청한 서비스 및 데이터를 제공하기 위해 필요한 경우에만 제3자와 귀하의 개인정보를 공유할 것입니다 (개인정보 보호정책에서 자세히 설명). 우리의 서비스는 18세 이상의 개인을 대상으로 합니다.<br>소개<br>KnitBot에 오신 것을 환영합니다. 우리의 서비스를 사용함으로써, 귀하는 다음 약관(\"\"사용자 약관\"\")에 동의하는 것입니다.<br>이를 주의 깊게 읽어 주십시오.<br>약관 동의<br>서비스에 접근하거나 서비스를 사용함으로써, 귀하는 이 사용자 약관에 구속되는 데 동의하는 것입니다.<br>이 약관에 동의하지 않으면, 서비스를 사용하지 마십시오.<br>제공되는 서비스<br>KnitBot은 자동 거래 서비스를 비롯한 다양한 기능을 무료로 제공합니다. 이러한 서비스의 사용은 귀하의 책임하에 이루어집니다. 자발적인 기부 및 레퍼럴 가입은 감사하지만, 우리의 서비스를 사용하기 위해 필수적인 것은 아닙니다.<br>이용자 의무<br>이용자는 우리의 서비스를 남용하지 않으며, 모든 적용 가능한 법률 및 규정을 준수할 것에 동의합니다.<br>이용자는 서비스 중단이나 간섭을 시도해서는 안 됩니다.<br>책임의 제한<br>KnitBot은 서비스를 '있는 그대로' 제공하며, 명시적, 묵시적 또는 법적 보증이나 조건 없이 제공합니다.<br>KnitBot은 특히 소유권, 상품성, 특정 목적에 대한 적합성 및 비침해에 대한 묵시적 보증을 명시적으로 부인합니다.<br>보증 및 위험 면책<br>거래 위험<br>자동 거래는 상당한 위험을 수반합니다. 우리의 서비스를 사용함으로써, 귀하는 모든 거래 결정 및 그로 인한 손익에 대해 전적으로 책임을 진다는 것을 인정하고 동의하는 것입니다. KnitBot은 발생한 거래 손실에 대해 책임을 지지 않습니다.<br>기술 문제<br>KnitBot은 서버 통신 오류, 시스템 장애 또는 사이버 공격, 해킹 또는 기타 악의적인 활동으로 인해 발생한 중단을 포함한 내외부 원인을 포함하여 KnitBot은 발생하는 모든 기술적 문제에 대해 책임을 지지 않습니다.<br>우리의 서비스가 중단 없이 오류 없이 제공될 것이라고 보증하지 않습니다.<br>서비스 불일치<br>귀하의 실제 사용과 의도된 사용 간의 불일치에 대해 책임지지 않습니다.<br>플랫폼 기능<br>KnitBot은 사용자가 설정한 거래 전략을 단순히 실행하는 플랫폼입니다. 사용자는 거래 전략을 직접 설정해야 하며, KnitBot은 이를 API를 통해 거래소로 전송할 뿐입니다. 거래 전략의 설정 및 실행에 대한 책임은 전적으로 사용자에게 있습니다.<br>배상책임<br>귀하는 우리의 서비스를 사용함으로써 발생하는 모든 청구, 요구 또는 손해에 대해 KnitBot을 면책하고 보호할 것에 동의하는 것입니다.<br>여기에는 합리적인 변호사 비용이 포함됩니다. 귀하의 서비스 사용, 이 약관 위반 또는 다른 사람의 권리를 침해한 경우가 해당됩니다.<br>개인정보 보호정책<br>우리의 개인정보 보호정책은 귀하의 개인정보를 어떻게 처리하는지에 대해 설명하고 있으며, 개인정보 보호정책에서 확인할 수 있습니다. 우리의 서비스를 사용함으로써, 귀하는 개인정보 보호정책에 설명된 대로 개인정보 수집 및 사용에 동의하는 것입니다.<br>계정 해지<br>우리는 단독 재량으로 귀하의 계정과 서비스 접근을 해지하거나 일시 중단할 권리를 보유하며, 이 사용자 약관을 위반하거나, 서비스 사용이 우리 또는 다른 사용자에게 해를 끼친다고 판단되는 경우, 또는 기타 이유로 해지할 수 있습니다.<br>준거법 및 분쟁 해결<br>이 약관은 공정의 원칙에 따라 해석되고 적용되며, 법적 분쟁의 원칙은 고려되지 않습니다.<br>이 약관에서 발생하거나 관련된 모든 분쟁은 상호 동의된 중재 기관의 규칙에 따라 구속력 있는 중재를 통해 해결됩니다.<br>기부 및 레퍼럴 가입<br>KnitBot에 대한 모든 기부는 자발적이며, 우리의 서비스 접근이나 사용을 위해 필수적인 것은 아닙니다.<br>또한, 사용자는 추천 링크를 통해 거래소에 가입할 수 있으며, 이는 KnitBot에 이익이 될 수 있지만, 역시 자발적인 것입니다.<br>이용약관 변경<br>우리는 웹사이트에 새로운 버전을 게시하여 수시로 이 이용약관을 업데이트할 수 있습니다.<br>변경 사항이 귀하에게 적합한지 확인하기 위해 가끔 웹사이트를 확인하시기 바랍니다.<br>적용 가능한 법률에 따라 필요한 경우, 이용약관에 대한 중요한 변경 사항이 귀하에게 통보될 것입니다.<br>연락처 정보<br>이 사용자 약관에 대한 질문이나 제안 사항이 있는 경우, 다음 이메일을 통해 문의해 주십시오:<br>knitbot@protonmail.com<br>"
    }
}